{
  "mainHeadings": [
    {
      "id": "translationQuran",
      "title": "Quran with Urdu Translation",
      "button": "Read more"
    },
    {
      "id": "namaz",
      "title": "The Importance of Prayer in Light of Quran and Sunnah",
      "button": "Read more"
    },
    {
      "id": "dua",
      "title": "The Importance of Supplication (Du'a) in Light of Quran and Sunnah",
      "button": "Read more"
    },
    {
      "id": "wealth",
      "title": "Wealth: A Trial",
      "button": "Read more"
    }
  ],
  "wealthSubHeading": [
    {
      "id": "1",
      "title": "Wealth is a trial",
      "button": "Read more"
    },
    {
      "id": "2",
      "title": "Giving precedence to the Hereafter over the World",
      "button": "Read more"
    },
    {
      "id": "3",
      "title": "Interest is a curse",
      "button": "Read more"
    }
  ],

  "wealthDetailPage": [
    {
      "id": "1",

      "content": [
        {
          "reference": "Surah Al-Humazah",
          "translation": "Woe to every scorner and mocker, who collects wealth and [continuously] counts it. He thinks that his wealth will make him immortal. No! He will surely be thrown into the Crusher. And what can make you know what is the Crusher? It is the fire of Allah, [eternally] fueled, which mounts directed at the hearts. Indeed, it [the fire] closes in on them in extended columns."
        },
        {
          "reference": "Surah Al-Takathur",
          "translation": "You are preoccupied with accumulating wealth until you visit the graveyards. No! You are going to know. Again, no! You are going to know. No! If you only knew with knowledge of certainty. You will surely see the Hellfire. Then you will surely see it with the eye of certainty. Then you will surely be asked that Day about pleasure."
        },
        {
          "reference": "Sahih Muslim 7420, Mishkat Al-Masabih 5169",
          "translation": "Narrated by Muttarrif, he said: I was in the company of my father [Mutarrif], I joined in the service of the Prophet (ﷺ). He was reciting Surah At-Takathur. The Prophet (ﷺ) then said: 'The son of Adam says: My wealth, my wealth. O son of Adam, is there anything as your belonging except that which you consumed, so it was worn out, or which you wore and it became old or which you gave (in charity) and sent it forth (for the Hereafter)?'"
        },
        {
          "reference": "Sahih Muslim 2415, 2417 Sunan Tirmidhi 2337",
          "translation": "Ibn Shihab reported: Anas bin Malik narrated to me that the Messenger of Allah (ﷺ) said: 'If the son of Adam had a valley full of gold, he would love to have two valleys, for nothing fills his mouth except the dust of the grave. And Allah turns with mercy to him who turns to Him in repentance.'"
        },
        {
          "reference": "Sahih Bukhari 6412 Sunan Tirmidhi 2304 Sunan Ibn Majah 4170",
          "translation": "The Prophet (ﷺ) said: 'Two blessings are such that many people incur loss due to them: health and free time for doing good.'"
        },
        {
          "reference": "Sahih Bukhari 6437-6436, Sahih Muslim 2418",
          "translation": "I heard the Prophet (ﷺ) saying: 'If the son of Adam had a valley full of gold, he would translationire to have two valleys, for nothing fills his mouth except the earth of the grave, yet Allah will accept the repentance of him who repents.'"
        },
        {
          "reference": "Sahih Bukhari 6514, Sahih Muslim 7424, Sunan Tirmidhi 2379, Sunan Nasai 1939",
          "translation": "The Messenger of Allah (ﷺ) said: 'Three things follow the deceased: his family, his wealth, and his deeds. Two of them return, and one remains with him: his family and wealth return, and his deeds remain with him.'"
        },
        {
          "reference": "Sahih Muslim 7420",
          "translation": "The Prophet (ﷺ) said: 'The son of Adam says: My wealth, my wealth. Do you own anything except that which you consumed and so it was finished, or which you clothed yourself with and so it was worn out, or which you gave as charity and sent it forth (to the Hereafter)?'"
        },
        {
          "reference": "Sunan at-Tirmidhi, Hadith number 2336, Mishkat al-Masabih, Hadith number 5914.",
          "translation": "I heard the Messenger of Allah (peace be upon him) saying: 'The test for every community lies in some kind of trial, and the test for my community lies in wealth.'"
        },

        {
          "reference": "Sahih Bukhari, Hadith numbers 2452, 3198, Sahih Muslim, Hadith numbers 4135-4132.",
          "translation": "I have heard the Messenger of Allah (peace be upon him) saying: 'Whoever unjustly takes even a handspan of land, his neck will be encircled with it on the Day of Judgment, and the seven earths will be placed around his neck.'"
        },

        {
          "reference": "Sahih Bukhari 4042, Sahih Muslim 5977",
          "translation": "The Prophet (ﷺ) said: 'I will be there waiting for you at the Pond (i.e., Al-Kawthar), and its width is as great as the distance between Sham and Ḥadramawt. I do not fear that you will associate others with me after I am gone, but I am afraid that you will compete with each other for worldly things, and that will translationtroy you, just as it translationtroyed those who were before you.'"
        },
        {
          "reference": "Sahih Bukhari 2654, 5977-5976, 6273, 6919, Sahih Muslim 259, Sunan Tirmidhi 1901, 2301, 3019",
          "translation": "It was narrated from Ubaidullah bin Abi Bakr that Anas bin Malik narrated to him: The Messenger of Allah (ﷺ) mentioned major sins or it was said to him: 'O Messenger of Allah, tell us about the major sins.' He said: 'Associating anything with Allah, killing a soul, disobedience to parents.' Then he sat up after he had been reclining, and said: 'Shall I not tell you of the greatest of the major sins?' They said: 'Yes, O Messenger of Allah.' He said: 'False speech or false testimony.' Shu'bah said: 'I think he said false testimony.'"
        },
        {
          "reference": "Sahih Bukhari 6460, Sahih Muslim 2427, 7441, Sunan Tirmidhi 2361, Sunan Ibn Majah 4139, Mishkat Al-Masabih 5164",
          "translation": "Narrated by Abu Huraira: The Messenger of Allah (ﷺ) prayed: 'O Allah! Grant the family of Muhammad (peace be upon him) sustenance to the extent that they can endure.'"
        },
        {
          "reference": "Sahih Bukhari 6957, 4565, 4659, 1402, 1403, Sahih Muslim 2290, 2292, Sunan Abu Dawood 1658, Sunan Nasai 2484, 2450, 2444, Sunan Ibn Majah 1786",
          "translation": "Aisha said: 'O son! We used to see three new moons in two months, and no fire used to be lit in the houses of the Prophet (ﷺ) (due to the lack of necessity). So, what used to sustain you?' She replied, 'The two black things: dates and water.' Yes, some of the Ansar neighbors of the Prophet (ﷺ) had milch goats (or camels) and they used to send the Prophet (ﷺ) some of its milk and he used to give us that to drink.'"
        },
        {
          "reference": "Sahih Bukhari 1408",
          "translation": "At that time I looked towards the sun and it had declined from the middle of the sky and had set, for it was the time of Asr prayer. I said, 'O Allah's Messenger (ﷺ)! I have never experienced such a day as this.' The Prophet (ﷺ) said, 'I have never experienced such a day as this, except in this situation (when this verse was revealed): 'Then woe to those whose hearts are hardened against the remembrance of Allah; those are in manifest error.' (Surah Al-Zumar, 39:22)"
        },
        {
          "reference": "Surah At-Tawbah, Ayah 35",
          "translation": "O you who have believed, indeed, many of the scholars and the monks devour the wealth of people unjustly and avert [them] from the way of Allah. And those who hoard gold and silver and spend it not in the way of Allah - give them tidings of a painful punishment."
        },
        {
          "reference": "Sahih Bukhari 6957, 4565, 4659, 1402, 1403, Sahih Muslim 2290, 2292, Sunan Abu Dawood 1658, Sunan Nasai 2484, 2450, 2444, Sunan Ibn Majah 1786",
          "translation": "The Prophet (ﷺ) said: 'Whomsoever Allah has given wealth but he does not pay its Zakat, then, on the Day of Resurrection, his wealth will be presented to him in the shape of a bald-headed poisonous male snake with two poisonous glands in its mouth and it will encircle itself round his neck and bite him over his cheeks and say, 'I am your wealth, I am your treasure.' Then the Prophet (ﷺ) recited the verse: 'Let not those who withhold...' (Surah Al-Imran, 3:180)"
        }
      ]
    },
    {
      "id": "2",

      "content": [
        {
          "reference": "Surah Al-Baqarah, Ayah 155",
          "translation": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient,"
        },
        {
          "reference": "Surah Al-A'la, Ayah 16-19",
          "translation": "But you preferenceer the worldly life, While the Hereafter is better and more enduring. Indeed, this is in the former scriptures, The scriptures of Abraham and Moses."
        },
        {
          "reference": "Sahih Muslim 7197, Sunan Tirmidhi 2323, Sunan Ibn Majah 4108",
          "translation": "The Messenger of Allah (ﷺ) said: 'By Allah! The world in comparison with the Hereafter is but as if one of you were to put his finger in the sea.'"
        },
        {
          "reference": "Surah At-Tawbah, Ayah 111",
          "translation": "Indeed, Allah has purchased from the believers their lives and their properties [in exchange] for that they will have Paradise. They fight in the cause of Allah, so they kill and are killed. [It is] a true promise [binding] upon Him in the Torah and the Gospel and the Qur'an. And who is truer to his covenant than Allah? So rejoice in your transaction which you have contracted. And it is that which is the great attainment."
        },

        {
          "reference": "Sahih Muslim, Hadith number 7417, Sunan at-Tirmidhi, Hadith number 2324, Sunan Ibn Majah, Hadith number 4113.",
          "translation": "The Messenger of Allah (peace be upon him) said: 'The world is the prison of a believer and the paradise of a disbeliever.'"
        },

        {
          "reference": "Sahih Muslim 7418, Sunan Abu Dawood 186",
          "translation": "The Messenger of Allah (ﷺ) passed by the market of Medina coming from the high ground and the people surrounded him, and there were no walls on any side of the street. The Messenger of Allah (ﷺ) touched with his hand the ear of a dead kid which had been brought from near the baker. He said: 'Who among you would like to have this for a dirham?' They said: 'We do not like to have it for anything, Messenger of Allah. What shall we do with it?' He said: 'Do you like to have it (free of any cost)?' They said: 'By Allah, Messenger of Allah, if it were alive, possessing the healthy ear, a defect in it would be more loathsome to us than anything else. Messenger of Allah, why should we not like to have it when it is dead?' He said: 'By Allah, the world in comparison with the Hereafter is but as if one of you were to put his finger in the sea.'"
        },
        {
          "reference": "Sahih Muslim 7088, Sunan Ibn Majah 4321",
          "translation": "Narrated Anas bin Malik: The Messenger of Allah (ﷺ) said: 'On the Day of Resurrection, the person who had the most delightful life of the world from among the inmates of Hell will be brought and will be dipped once in the Fire and it will be said to him: 'O son of Adam! Did you ever experience any comfort? Did you happen to get any luxury?' He will say: 'By Allah, no, my Rubb.' And then the most miserable person of the world from among the inmates of Paradise will be brought and will be dipped once into Paradise, and it will be said to him: 'O son of Adam! Did you ever experience any hardship? Or had any distress fallen to your lot?' He will say: 'By Allah, no, my Rubb, never did I experience any hardship or distress."
        },
        {
          "reference": "Sunan Tirmidhi 2560, Sunan Abu Dawood 4744, Sunan Nasai 3794",
          "translation": "The Messenger of Allah (ﷺ) said: 'When Allah created Paradise and Hell, He sent Gabriel to Paradise and said: 'Look at it and at what I have prepared therein for its inhabitants.' So he went and looked at it and at what Allah had prepared therein for its inhabitants. He then returned to Him and said: 'By Your Glory, no one hears of it without entering it.' So He commanded that it be encompassed by forms of hardship, and He said: 'Return to it and look at what I have prepared therein for its inhabitants.' So he returned to it and found that it was encompassed by forms of hardship. Then he returned to Him and said: 'By Your Glory, I fear that no one will enter it, O Rubb!' He said: 'Go to Hell and look at it and what I have prepared therein for its inhabitants.' He found that it was in layers, one above the other. Then he returned to Him and said: 'By Your Glory, no one who hears of it will enter it.' So He commanded that it be encompassed by translationires. Then He said: 'Return to it.' So he returned to it and said: 'By Your Glory, I am frightened that no one will escape from entering it.'"
        }
      ]
    },

    {
      "id": "3",

      "content": [
        {
          "reference": "Surah Al-Baqarah, Verse 275",
          "translation": "Those who devour interest will not stand except as stands one whom the devil has driven to madness by [his] touch. That is because they say, 'Trade is [just] like interest.' But Allah has permitted trade and has forbidden interest. So whoever has received an admonition from his Lord and translationists may have what is past, and his affair rests with Allah. But whoever returns to [dealing in interest or usury] - those are the companions of the Fire; they will abide eternally therein."
        },
        {
          "reference": "Surah Al-Baqarah, Verse 276",
          "translation": "Allah translationtroys interest and gives increase for charities. And Allah does not like every sinning disbeliever."
        },
        {
          "reference": "Surah Al-Baqarah, Verse 278",
          "translation": "O you who have believed, fear Allah and give up what remains [due to you] of interest, if you should be believers."
        },

        {
          "reference": "Surah Al-Baqarah, Verse 279",
          "translation": "And if you do not, then be informed of a war [against you] from Allah and His Messenger. But if you repent, you may have your principal - [thus] you do no wrong, nor are you wronged."
        },
        {
          "reference": "Sahih Bukhari 7048, Mishkat al-Masabih 4621",
          "translation": "We went on until we reached the bloodiest part of the stream. There are stones there. When a man in the stream intended to come out, the man on the bank would throw a stone at his mouth, so he would return to his original position. Whenever he intended to come out, he would throw a stone at his mouth, so he would return to his original position. The one you saw in the stream was a usurer."
        }
      ]
    }
  ],

  "namazSubHeading": [
    {
      "id": "1",
      "title": "Virtues of Prayer",
      "button": "Read more"
    },
    {
      "id": "2",
      "title": "Consequences of Not Praying",
      "button": "Read more"
    },
    {
      "id": "3",
      "title": "People's translationires After Death",
      "button": "Read more"
    },
    {
      "id": "4",
      "title": "Just Performing Obligatory Prayers is Sufficient",
      "button": "Read more"
    },
    {
      "id": "5",
      "title": "Virtues of Sunnah and Voluntary Prayers",
      "button": "Read more"
    },
    {
      "id": "6",
      "title": "Combining Two Prayers",
      "button": "Read more"
    }
  ],

  "namazDetailPage": [
    {
      "id": "1",
      "content": [
        {
          "reference": "Surah Al-Jathiyah, Verse 23",
          "translation": "Have you seen him who has taken his translationire as his god?"
        },
        {
          "reference": "Sahih Muslim 267-266-265 Sunan Tirmidhi 1999-1998 Sunan Ibn Majah 59,1474 Sunan Abu Dawood 4092",
          "translation": "The Prophet Muhammad (peace be upon him) said: 'Whoever has even a mustard-seed's weight of pride in his heart will not enter Paradise.' A person said: 'Verily, a man loves that his clothes should be fine and his shoes should be fine.' The Prophet said: 'Verily, Allah is Beautiful and He loves beauty. Pride is to reject the truth (out of self-conceit) and to look down upon people.'"
        },
        {
          "reference": "Surah Az-Zariyat, Verse 56",
          "translation": "I did not create the jinn and mankind except to worship Me."
        },
        {
          "reference": "Musnad Ahmad 1052",
          "translation": "Narrated by Thawban: The Messenger of Allah (peace be upon him) said, 'He who observes five prayers, diligently, in their proper times, will have a full promise of Allah that He will forgive him. He who does not observe them, has no such promise; and if He wills, He may forgive him and if He wills, He may punish him.'"
        },
        {
          "reference": "Musnad Ahmad 1082",
          "translation": "Narrated by Ka'b bin 'Ujrah: I was sitting in the Mosque (of the Prophet in Madinah), and a man prayed, and then came and greeted the Prophet. The Prophet returned the greeting and said, 'Go back and pray, for you have not prayed.' The man went back, prayed in the same way as before, returned and greeted the Prophet. The Prophet again said to him, 'Go back and pray, for you have not prayed.' This happened thrice. The man then said, 'By Him Who has sent you with the Truth, I cannot offer a better prayer than this. Please teach me.' The Prophet said, 'When you get up to pray, recite the Takbir, and then recite whatever you conveniently can from the Quran, then bow and remain quiet in that position; then raise your head, remain quiet in that standing position; then prostrate yourself and remain quietly in that prostration; and then raise yourself and sit quietly; and do that throughout all your prayers.'"
        },
        {
          "reference": "Surah Ibrahim, Ayah 40",
          "translation": "O my Sustainer! Make me one who establishes prayer, and [also] from my translationcendants. Our Lord, accept my supplication."
        },
        {
          "reference": "Surah Al-An'am, Ayahs 162-163",
          "translation": "Say, 'Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, the Lord of the worlds. No partner has He. And this I have been commanded, and I am the first [among you] of the Muslims.'"
        }
      ]
    },
    {
      "id": "2",
      "content": [
        {
          "reference": "Sunan Ibn Majah, Hadiths 1425-1426, Mishkat al-Masabih 1330",
          "translation": "The Prophet ﷺ said: 'The first action for which a person will be held accountable on the Day of Resurrection will be his obligatory prayer.'"
        },
        {
          "reference": "Surah Al-Ma'idah, Ayah 55",
          "translation": "Certainly, your ally is Allah and His Messenger and those who have believed - those who establish prayer and give zakah, and they bow [in worship]."
        },
        {
          "reference": "Surah Al-Muddathir, Ayahs 41-43",
          "translation": "Regarding the criminals, when they are asked, 'What put you into Hellfire?' They will say, 'We were not of those who prayed.'"
        },
        {
          "reference": "Surah Ya-Sin, Ayahs 63-64",
          "translation": "This is the Hellfire which you were promised. Enter to burn therein today for what you used to disbelieve in.'"
        },
        {
          "reference": "Surah Ar-Rum, Ayah 31",
          "translation": "Turn to Allah in repentance, fear Him, establish prayer, and do not be among the polytheists."
        },

        {
          "reference": "Sahih Muslim 246-247, Sunan Tirmidhi 2618-2620, Sunan Abu Dawood 4678, Sunan Nasai 465, Sunan Ibn Majah 1078",
          "translation": "It is narrated from Abu Sufyan that he said: 'I heard Jabir (may Allah be pleased with him) saying: 'I heard the Messenger of Allah ﷺ saying: 'Indeed, between a person and disbelief and polytheism is the abandonment of prayer.'''"
        },
        {
          "reference": "Sunan Tirmidhi 2621, Sunan Nasai 464, Sunan Ibn Majah 1079",
          "translation": "The Messenger of Allah ﷺ said: 'The covenant between us and them is prayer, so whoever abandons it has disbelieved.'"
        },
        {
          "reference": "Sunan Tirmidhi 2622",
          "translation": "The noble companions (may Allah be pleased with them) did not consider leaving any act besitranslation prayer as disbelief."
        },
        {
          "reference": "Sunan Abu Dawood 495, Mishkat al-Masabih 572",
          "translation": "Narrated by 'Amr ibn al-'As (may Allah be pleased with him) that the Messenger of Allah ﷺ said: 'Order your children to pray when they reach the age of seven, and discipline them for it (if they neglect it) when they are ten years old, and separate them in their beds.'"
        },
        {
          "reference": "Musnad Ahmad 1090, Mishkat al-Masabih 578",
          "translation": "Narrated by Abdullah ibn Amr ibn al-As (may Allah be pleased with him) that the Prophet (peace be upon him) mentioned prayer one day and said: 'Whoever guards it (prayer) well, it will be a light, evidence, and salvation for him on the Day of Resurrection, and whoever does not guard it well, it will not be a light, evidence, or salvation for him on the Day of Resurrection, and he will be with Qarun, Pharaoh, Haman, and Ubayy ibn Khalaf.'"
        },

        {
          "reference": "Sunan Ibn Majah 4034",
          "translation": "Narrated by Abu Darda (may Allah be pleased with him): My close friend, the beloved Prophet ﷺ, advised me, saying: 'Do not associate anything with Allah, even if you are cut into pieces or burned. And do not intentionally abandon the obligatory prayer, for whoever intentionally abandons it, Allah will have no obligation to protect him. And do not drink alcohol, for it is the key to every evil.'"
        },
        {
          "reference": "Surah Al-Qalam, Verse 42-43",
          "translation": "On the Day the shin will be uncovered, and they are invited to prostration but the disbelievers will not be able. Their eyes will be humbled, humiliation will cover them. And they used to be invited to prostration while they were sound. (But) they were unable."
        },
        {
          "reference": "Sahih Bukhari 4919",
          "translation": "Our Lord will reveal His shin on the Day of Resurrection, and every believer, man and woman, will prostrate to Him. Only those who used to prostrate in the world for showing off and for fame will not be able to prostrate then. Their backs will be stiff like one piece of a hard plate, so they will not be able to prostrate."
        },
        {
          "reference": "Surah Maryam, Verse 59",
          "translation": "Then there succeeded them a generation who neglected prayer and pursued translationires, so they will be thrown into Hellfire."
        }
      ]
    },

    {
      "id": "3",
      "content": [
        {
          "reference": "Surah Al-An'am, Verse 27",
          "translation": "And if you could but see when they are made to stand before the Fire and will say, 'Oh, would that we could be returned [to life on earth] and not deny the signs of our Lord and be among the believers.'"
        },
        {
          "reference": "Surah Al-Kahf, Verse 42",
          "translation": "Would that I had not taken the (person) as a friend."
        },
        {
          "reference": "Surah Al-Haqqah, Verse 25",
          "translation": "Ah, would that my record had not been given to me, and I had not known what is my account!"
        },
        {
          "reference": "Surah Al-Furqan, Verse 28-29",
          "translation": "And the Day the wrongdoer will bite on his hands [in regret] he will say, 'Oh, I wish I had taken with the Messenger a way. Oh, woe to me! I wish I had not taken that one as a friend."
        },
        {
          "reference": "Surah Al-Fajr, Verse 24",
          "translation": "And he will say, 'Oh, I wish I had sent ahead [some good] for my life.'"
        },

        {
          "reference": "Surah Al-Furqan, Verse 27",
          "translation": "And [mention] the Day the wrongdoer will bite on his hands [in regret] he will say, 'Oh, I wish I had taken with the Messenger a way.'"
        },
        {
          "reference": "Surah Al-Ahzab, Verse 66",
          "translation": "The Day their faces will be turned about in the Fire, they will say, 'Oh, would that we had obeyed Allah and obeyed the Messenger.'"
        },
        {
          "reference": "Surah An-Nisa, Verse 73",
          "translation": "And if you [O Muhammad] are given mercy from Allah, they will surely say, as if there had not been between you and them any affection. Oh, I wish I had been with them [who died] so I could have attained a great attainment."
        },
        {
          "reference": "Surah An-Naba, Verse 40",
          "translation": "Indeed, We have warned you of a near punishment on the Day when a man will observe what his hands have put forth and the disbeliever will say, 'Oh, I wish that I were dust!'"
        },
        {
          "reference": "Surah Az-Zukhruf, Verse 38",
          "translation": "[Even] until, when he comes to Us [at Judgement], he says [to his companion], 'Oh, I wish there were between me and you the distance between the east and west - how wretched a companion!'"
        },
        {
          "reference": "Surah Al-Haqqah, Verse 27",
          "translation": "Oh, I wish that my death had been the decisive one!"
        }
      ]
    },

    {
      "id": "4",
      "content": [
        {
          "reference": "Sahih Bukhari 46,1397; Sahih Muslim 100,106",
          "translation": "A villager came to the service of the noble Prophet Muhammad (peace be upon him) and said, 'Inform me of such a deed that if I do it consistently, I shall enter Paradise.' The Prophet (peace be upon him) replied, 'Worship Allah and do not associate anything with Him, establish the obligatory prayers, pay the obligatory charity (Zakat), and observe fasting during the month of Ramadan.' The villager said, 'By Him in Whose Hand my life is, I will not increase nor decrease upon these acts.' When the villager turned his back (to leave), the Prophet Muhammad (peace be upon him) said, 'If anyone wants to see a man from the people of Paradise, let him look at this man.'"
        }
      ]
    },

    {
      "id": "5",
      "content": [
        {
          "reference": "Sunan Ibn Majah 1426; Mishkat al-Masabih 1330",
          "translation": "Narrated by Abu Hurairah, may Allah be pleased with him, that I heard the Messenger of Allah (peace be upon him) saying: 'The first thing for which a person will be brought to account on the Day of Resurrection will be his prayer. If it is found to be complete, he will have succeeded and prospered, but if it is incomplete, he will have failed and lost. If any shortcoming is found in his obligatory prayers, the Lord Almighty will say: See if My servant has any voluntary prayers, so that the obligatory prayers may be made up with them. Then the rest of his actions will be judged in the same manner.' Another narration adds: 'Then the account of Zakat will also be conducted in the same manner, and then the account of the rest of the deeds will be conducted in the same manner.'"
        },
        {
          "reference": "Sahih Muslim 1694",
          "translation": "Narrated by Umm Habibah, may Allah be pleased with her, that she said: 'I heard the Messenger of Allah (peace be upon him) saying: 'The one who performs twelve Rak'ahs (of Sunnah prayers) during the day and night, a house will be built for him in Paradise.'"
        },
        {
          "reference": "Sahih Bukhari 1180,1182; Sahih Muslim 1699",
          "translation": "Khalid narrated from Abdullah bin Shaqiq that he asked Aisha, may Allah be pleased with her, about the voluntary prayers of the Messenger of Allah, peace be upon him. She replied: 'He used to offer four Rak'ahs before Zuhr and then would go out and lead the people in prayer. Then he would come back and pray two Rak'ahs (Sunan) at home. He would offer two Rak'ahs after Maghrib, then would come back and pray two Rak'ahs at home. He would offer two Rak'ahs after Isha and would come back and pray two Rak'ahs at home. He would also offer two Rak'ahs before Fajr. And the Witr prayer he would include in the Night prayers. And he would stand long in prayer, both standing and sitting, and when he recited the Quran in prayer, he would stand and when he bowed and prostrated, he would do so sitting. And when Fajr dawned, he would pray two Rak'ahs.'"
        },
        {
          "reference": "Virtue of Witr Prayer"
        },
        {
          "reference": "Sunan Tirmidhi 453",
          "translation": "Witr prayer is not obligatory like the obligatory prayers, rather the Messenger of Allah, peace be upon him, made it a Sunnah and said: 'Allah is odd (Witr) and loves what is odd. O people of the Quran, offer Witr prayer.'"
        },

        {
          "reference": "Sunan Tirmidhi 465; Sunan Ibn Majah 1188; Sunan Abu Dawood 1431",
          "translation": "The Messenger of Allah, peace be upon him, said: 'Whoever misses the Witr prayer or forgets it, then when he remembers or wakes up, let him pray it.'"
        },
        {
          "reference": "Sunan Tirmidhi 452",
          "translation": "The Messenger of Allah, peace be upon him, came out to us (from his apartment) and said: 'Allah Almighty has added a prayer for you, which is better for you than the red camels, and that is the Witr. Allah has appointed its time for you from the end of the 'Isha' prayer until the dawn begins.'"
        },
        {
          "reference": "Virtue of Offering Two Optional Units of Prayer after Witr",
          "translation": ""
        },
        {
          "reference": "Mishkat al-Masabih 1286",
          "translation": "Narrated by Thauban, may Allah be pleased with him, the Prophet, peace be upon him, said: 'This is a difficult and great act of devotion. When any one of you offers Witr, let him pray two Rak'ahs. If he wakes up at night, let him offer prayer (Tahajjud), otherwise these two Rak'ahs will be sufficient for him.'"
        }
      ]
    },

    {
      "id": "6",
      "content": [
        {
          "reference": "Sahih Bukhari 543, 562; Sahih Muslim 1637-1628; Sunan Tirmidhi 187",
          "translation": "The Messenger of Allah, peace be upon him, combined Dhuhr and Asr prayers together without fear or rain in Madinah, and he combined Maghrib and Isha prayers together. Ibn Abbas, may Allah be pleased with them both, was asked about the intention of the Prophet, peace be upon him, regarding this. He said: 'His intention was not to put his Ummah in difficulty.'"
        },
        {
          "reference": "Sahih Bukhari 1111; Sahih Muslim 1621, 1625, 1627; Sunan Tirmidhi 553; Sunan Abu Dawood 1220; Sunan Ibn Majah 1070",
          "translation": "The Prophet, peace be upon him, while returning from the Tabuk expedition, when the sun declined, delayed the Dhuhr prayer to the time of Asr, combining them, and when the sun declined further, he delayed the Asr prayer to the time of Dhuhr, combining them. Then he proceeded on his journey. When they intended to travel before Maghrib, he delayed the Maghrib prayer and combined it with Isha, and when they intended to travel after Maghrib, he delayed the Isha prayer and combined it with Maghrib."
        },
        {
          "reference": "The Purpose of My Life: Your Religion's Eminence",
          "translation": "I am a Muslim for this reason, I am a worshipper for this reason."
        }
      ]
    }
  ],

  "duaSubHeading": [
    {
      "id": 1,
      "title": "The Virtue of Remembrance of Allah",
      "button": "Read more"
    },
    {
      "id": 2,
      "title": "The Best Remembrance",
      "button": "Read more"
    },
    {
      "id": 3,
      "title": "The World is a Place of Test",
      "button": "Read more"
    },
    {
      "id": 4,
      "title": "The Importance of Prayer",
      "button": "Read more"
    },
    {
      "id": 5,
      "title": "The Most Magnificent Name",
      "button": "Read more"
    },
    {
      "id": 6,
      "title": "Sending Blessings upon the Prophet",
      "button": "Read more"
    },
    {
      "id": 7,
      "title": "Prayer for Entry into Paradise",
      "button": "Read more"
    },
    {
      "id": 8,
      "title": "Prayer for Protection from the Punishment of Hell",
      "button": "Read more"
    },
    {
      "id": 9,
      "title": "The Prayer Muhammad Made When He Saw Allah in a Dream",
      "button": "Read more"
    },
    {
      "id": 10,
      "title": "Prayer for Seeking Forgiveness",
      "button": "Read more"
    },
    {
      "id": 11,
      "title": "Prayer for Relief from Hardship and Distress",
      "button": "Read more"
    },
    {
      "id": 12,
      "title": "Prayer for Blessings in Provision",
      "button": "Read more"
    },
    {
      "id": 13,
      "title": "Prayer for Increase in Knowledge",
      "button": "Read more"
    },
    {
      "id": 14,
      "title": "Prayer for Visiting the Cemetery",
      "button": "Read more"
    },
    {
      "id": 15,
      "title": "Prayer for Leaving Home or Traveling",
      "button": "Read more"
    },
    {
      "id": 16,
      "title": "Prayer for Forgiveness of the Deceased",
      "button": "Read more"
    },
    {
      "id": 17,
      "title": "Prayer for Protection from Sudden Calamity",
      "button": "Read more"
    },
    {
      "id": 18,
      "title": "Prayer After the Call to Prayer (Adhan)",
      "button": "Read more"
    }
  ],

  "duaDetailPage": [
    {
      "id": "1",
      "content": [
        {
          "reference": "Surah Ar-Ra'd Verse 28",
          "translation": "Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured."
        },
        {
          "reference": "Surah Al-Imran Verse 41",
          "translation": "O you who have believed, remember Allah with much remembrance. And exalt Him morning and afternoon."
        },
        {
          "reference": "Surah Al-Hijr Verse 99",
          "translation": "And worship your Lord until there comes to you the certainty (death)."
        },
        {
          "reference": "Sahih al-Bukhari 6407, Sahih Muslim 1823",
          "translation": "The Prophet Muhammad, peace be upon him, said: 'The example of one who remembers his Lord and one who does not is like that of the living and the dead.'"
        },
        {
          "reference": "Sunan Ibn Majah 3792",
          "translation": "Narrated by Abu Huraira: The Prophet, peace be upon him, said: 'Allah says: 'I am with my servant when he remembers Me, and his lips move with My remembrance.'"
        },
        {
          "reference": "Sunan At-Tirmidhi 3375",
          "translation": "A man said: 'O Messenger of Allah! The obligations of Islam are many for me. Tell me something to which I may cling.' The Prophet, peace be upon him, said: 'Let your tongue be always moist with the remembrance and mention of Allah.'"
        },
        {
          "reference": "Sahih al-Bukhari 43",
          "translation": "Once the Prophet, peace be upon him, came to us while a woman was sitting with us. He asked: 'Who is she?' We replied: 'She is so and so and she performs a lot of prayers (fasts, charity, etc.)' The Prophet, peace be upon him, said: 'Wait for her; for her status will be decided according to her deeds.'"
        }
      ]
    },
    {
      "id": "2",
      "content": [
        {
          "reference": "Sahih Muslim 1358",
          "arabic": " اللهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، وَسُبْحَانَ اللهِ  بُكْرَةً وَأَصِيلًا",
          "translation": "Narrated by Ibn Umar (RA): We were once praying with the Messenger of Allah (ﷺ) when a man among the people exclaimed, 'Allah is truly Great, much Praise be to Allah, Glory be to Allah in the morning and in the evening.' The Prophet (ﷺ) asked, 'Who uttered such and such words?' A man among the people replied, 'It was I, O Messenger of Allah!' The Prophet (ﷺ) said, 'I saw the gates of heaven opened for him.' Since then, Ibn Umar (RA) never abandoned saying those words after every prayer."
        },
        {
          "reference": "Virtues of Subhan Allah, Alhamdulillah, Allahu Akbar"
        },
        {
          "reference": "Musnad Ahmad 10723, 1865, 1864, Sunan Abi Dawood 5065, Sunan Tirmidhi 3410, Sunan Ibn Majah 926",
          "translation": "Narrated by Abdullah bin Amr (RA): The Prophet (ﷺ) said, 'Whoever consistently practices two phrases, will enter Paradise and they are easy to say but few act upon them: after every prayer, say ten times: 'Subhan Allah', ten times: 'Allahu Akbar', and ten times: 'Alhamdulillah'. The Prophet (ﷺ) gestured with his hand indicating the number ten and said, 'These are one hundred on the tongue, but one thousand on the scale (of deeds). And when you go to bed, say them together: 'Subhan Allah, Alhamdulillah, Allahu Akbar', one hundred times. That is equivalent to saying them a hundred times on the tongue and they are one thousand on the scale.' Then he asked, 'Who among you commits two thousand sins in a day?' The Companions replied, 'How could anyone do that?' He said, 'By the morning, one engages in idle talk, and in the evening as well, and in between that, he neglects his prayers.'"
        },
        {
          "reference": "Sunan Ibn Majah 1356, Sunan Abi Dawood 766",
          "arabic": "دس بار ( الله اكبر ) دس بار ( اَلْحَمْدُلِلَّہِ ) دس بار ( سُبْحَانَ اللہِ ) اور دس بار ( اَسْتَغْفِرُاللہ ) کہتے تھے ۔ پھر فرماتے : ( اللَّهُمَّ اغْفِرْلِى وَاهْدِنِى وَارْزُقْنِى وَعَافِنِى )",
          "translation": "The Prophet (ﷺ) began the night prayer with these words: 'You asked me something that no one before you has asked me. You should say ten times: 'Allahu Akbar', ten times: 'Alhamdulillah', ten times: 'Subhan Allah', and ten times: 'Astaghfirullah'. Then say: 'O Allah, forgive me, guide me, provide for me, and grant me security.' And he used to seek referenceuge from the difficulties of standing on the Day of Resurrection."
        },
        {
          "reference": "Sahih Muslim 6842, 6844, Sunan Abi Dawood 5077, Sunan Ibn Majah 3867, Sahih Bukhari 6403, 1154",
          "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "translation": "Narrated by Abdullah bin Qais (RA): The Prophet (ﷺ) said, 'Shall I not inform you of a treasure from the treasures of Paradise?' I said: 'Certainly, O Messenger of Allah!' He said, 'Say: 'There is no power and no strength except with Allah.'"
        },
        {
          "reference": "Sahih Bukhari 6409, Sahih Muslim 6862",
          "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "translation": "Saving oneself from sins and the power of goodness is solely and only attained from Allah. You (peace be upon him) said: 'Abdullah bin Qais! Should I not inform you of one of the treasures of Paradise?' I said: 'Why not, Messenger of Allah!' You (peace be upon him) said: 'Say: There is no power nor strength except with Allah."
        },
        {
          "reference": "Sahih Bukhari 6682, Sahih Muslim 6846, Sunan At-Tirmidhi 3467, Sunan Ibn Majah 3806, Musnad Ahmad 5463, Mishkat Al-Masabih 2298",
          "arabic": "سُبحَانَ اللَّهِ وَ بِحَمْدِهِ ، سُبحَانَ اللَّهِ الْعَظِيمِ",

          "translation": "The Prophet Muhammad (peace be upon him) said, 'Two words are light on the tongue, heavy on the scales [on the Day of Judgment], and beloved to the Most Merciful: SubhanAllahi wa bihamdihi, SubhanAllahil-Azim.'"
        },
        {
          "reference": "Sahih Muslim 6847, Sunan At-Tirmidhi 3597, 3462, Mishkat Al-Masabih 2295",
          "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",

          "translation": "Narrated Abu Huraira: The Messenger of Allah (peace be upon him) said, 'The uttering of the words: SubhanAllahi wal-hamdulillahi wa la ilaha illallahu wallahu akbar, is dearer to me than anything over which the sun rises.'"
        },
        {
          "reference": "Sunan At-Tirmidhi 3433",
          "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",

          "translation": "The Prophet Muhammad (peace be upon him) said, 'Whoever sits in a gathering and indulges in useless talk and before getting up recites: Subhanaka Allahumma wa bihamdika, ash-hadu alla ilaha illa anta, astaghfiruka wa atubu ilayk (Glory is to You, O Allah, and praise is to You. I bear witness that there is no god but You. I seek Your forgiveness and repent to You), then such a prayer will be the expiation for that which has been said in that gathering.'"
        },
        {
          "reference": "Sahih Bukhari 6306",
          "arabic": "اللَّهُمَّ أَنْتَ رَبِّي ، لَا إِلَهَ إِلَّا أَنْتَ ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",

          "translation": "The Prophet Muhammad (peace be upon him) said, 'Whoever supplicates with these words during the day, having faith in them and dies on the same day before the evening, will be among the dwellers of Paradise. And whoever supplicates with these words during the night, having faith in them and dies before the morning, will be among the dwellers of Paradise.'"
        },
        {
          "reference": "Sahih Bukhari 1154, Sunan Ibn Majah 3878, Sunan At-Tirmidhi 3414",
          "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، ‏‏‏‏‏‏وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",

          "translation": "The Prophet Muhammad (peace be upon him) said, 'When a person wakes up from sleep and says: La ilaha illallah wahdahu la sharika lahu, lahul mulku wa lahul hamdu wa huwa 'ala kulli shay'in qadir, SubhanAllahi, walhamdu lillahi, wa la ilaha illallah, wallahu akbar, wa la hawla wa la quwwata illa billah (There is no god but Allah alone, without any partner. To Him belongs sovereignty, and to Him belongs all praise, and He is able to do all things. Glory is to Allah, and praise is to Allah, and there is no god but Allah, and Allah is the Greatest, and there is no power and no strength except with Allah), then says: O my Lord, forgive me,' he will be forgiven. And if he performs ablution and offers a prayer, his prayer will be accepted.'"
        }
      ]
    },

    {
      "id": "3",
      "content": [
        {
          "reference": "Surah Al-A'la, Verse 16-19",
          "translation": "But you preferenceer the worldly life, while the Hereafter is better and more enduring. Indeed, this is in the former scriptures, the scriptures of Abraham and Moses."
        },
        {
          "reference": "Surah Al-Baqarah, Verse 155",
          "translation": "And We will surely test you with something of fear and hunger and a loss of wealth, lives, and fruits, but give good tidings to the patient."
        },
        {
          "reference": "Surah Al-Hadid, Verse 22-23",
          "translation": "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy. In order that you not translationpair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful."
        }
      ]
    },

    {
      "id": "4",

      "content": [
        {
          "reference": "Sahih Muslim 6774, Mishkat Al-Masabih 5298",
          "translation": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said: 'The strong believer is better and more beloved to Allah than the weak believer, while there is good in both. Guard over that which benefits you, seek Allah's help, and do not feel helpless. If something befalls you, do not say, 'If only I had done such and such,' but rather say, 'This is the decree of Allah, and whatever He wills He does,' for (the word) 'if' opens the door to Satan's work.'"
        },
        {
          "reference": "Sahih Muslim 1772, Sahih Bukhari 1145",
          "translation": "Narrated Abu Huraira: Allah's Messenger (ﷺ) said, 'Our Lord, the Blessed, the Superior, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: 'Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?'"
        },
        {
          "reference": "Sunan At-Tirmidhi 2969, Sunan Ibn Majah 3828, Sunan Abu Dawood 1479",

          "translation": "Narrated Nu'man bin Bashir: The Messenger of Allah (ﷺ) said, 'Supplication is worship.' Then he recited the verse: 'And your Lord said: 'Call upon Me, I will respond to you.' (Quran 40:60) and the saying of Allah: 'And your Lord said: 'Call upon Me, I will respond to you.'"
        },
        {
          "reference": "Sahih Muslim 6936",
          "translation": "Narrated Abu Huraira: The Prophet (ﷺ) said, 'As long as anyone of you is engaged in prayer, he is communicating in private with his Lord, and so he should not spit in front of him because his Lord is in front of him.'"
        },
        {
          "reference": "Sunan At-Tirmidhi 2516, Mishkat Al-Masabih 5302",
          "translation": "Narrated Abu Huraira: The Messenger of Allah (ﷺ) said, 'Allah the Exalted says: 'I am as My servant thinks I am. I am with him when he makes mention of Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it. And if he draws near to Me a hand's span, I draw near to him an arm's length; and if he draws near to Me an arm's length, I draw near to him a fathom's length. And if he comes to Me walking, I go to him at speed.'"
        },
        {
          "reference": "Mishkat Al-Masabih 2259",
          "translation": "Narrated Abu Sa'eed Al-Khudri: The Prophet (ﷺ) said: 'When a Muslim supplicates, making a request in which there is no sin or cutting off of the ties of kinship, Allah grants him one of three things: either He hastens to answer his prayer, or He stores it up for him in the Hereafter, or He turns away from him an equivalent amount of evil.' The Companions said: 'Then we should make a lot of supplication.' The Prophet (ﷺ) said: 'Allah is more ready to answer than you are to ask.'"
        },

        {
          "reference": "Sunan Abu Dawood 521, Sunan At-Tirmidhi 212, Mishkat Al-Masabih 671",
          "translation": "Narrated Anas bin Malik: The Messenger of Allah (ﷺ) said: 'The supplication made between the Adhan and Iqamah is not rejected.'"
        },
        {
          "reference": "Mishkat Al-Masabih 930, Sunan An-Nasa'i 1285, Sunan Abu Dawood 1481, Sunan At-Tirmidhi 3476",
          "translation": "Hazrat Fazalah bin 'Ubaid (may Allah be pleased with him) narrates that when the Messenger of Allah (peace be upon him) was present, a man came and performed the prayer and supplicated: 'O Allah! Forgive me and have mercy on me.' The Messenger of Allah (peace be upon him) said: 'O worshipper! You have been hasty. When you perform the prayer, sit down and recite (the Tashahhud), then praise Allah with the due praise, send blessings upon me, then supplicate to Allah.' The narrator states that after this, another man performed the prayer, and he praised Allah and sent blessings upon the Prophet. The Prophet (peace be upon him) said to him: 'O worshipper! Supplicate, your supplication will be accepted.' This narration is reported in Sunan At-Tirmidhi, Sunan Abu Dawood, and Sunan An-Nasa'i in similar wording."
        }
      ]
    },
    {
      "id": "5",
      "content": [
        {
          "reference": "Sunan Abu Dawood 1496, Surah Al-Baqarah, Ayah 163; Surah Al-Imran, Ayah 1 and 2",
          "translation": "Narrated by Shahr ibn Hawshab, Hazrat Asma bint Yazid (may Allah be pleased with her) reported that the Prophet (peace be upon him) said: 'The greatest name of Allah is in these two verses: (And your God is one God; there is no deity [worthy of worship] except Him, the Entirely Merciful, the Especially Merciful) and in the opening verse of Surah Al-Imran (Alif, Lam, Meem. Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence).'"
        },
        {
          "reference": "Surah As-Saffat, Ayah 180-182",
          "arabic": " سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ وَسَلَـٰمٌ عَلَى ٱلْمُرْسَلِينَ وَٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
          "translation": "Glory be to your Lord, the Lord of Honor, above what they attribute. And peace upon the messengers. And praise to Allah, Lord of the worlds."
        },
        {
          "reference": "Surah Al-Hashr, Ayah 22-24",
          "arabic": "هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ۖ عَـٰلِمُ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ ۖ هُوَ ٱلرَّحْمَـٰنُ ٱلرَّحِيمُ هُوَ ٱللَّهُ ٱلَّذِىلَآ إِلَـٰهَ إِلَّا هُوَ ٱلْمَلِكُ ٱلْقُدُّوسُ ٱلسَّلَـٰمُ ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ ٱلْعَزِيزُ ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ ۚ سُبْحَـٰنَ ٱللَّهِ  عَمَّا يُشْرِكُونَ هُوَ ٱللَّهُ ٱلْخَـٰلِقُ ٱلْبَارِئُ ٱلْمُصَوِّرُ ۖ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ ۚ يُسَبِّحُ لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
          "translation": "Exalted is Allah above whatever they associate with Him. He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise."
        },
        {
          "reference": "Sunan Abu Dawood 1493, Sunan Tirmidhi 3475, Sunan Ibn Majah 3857",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
          "translation": "Narrated by Abdullah bin Buraidah, his father reported that the Messenger of Allah (peace be upon him) heard a person supplicating: 'O Allah, I ask You, as I bear witness that You are Allah, there is no deity except You, the One, the Self-Sufficient Master, Who begets not, nor was He begotten, and there is none comparable to Him.' The Prophet (peace be upon him) said: 'By using these names of Allah, he supplicated to Allah with which if he supplicated, He would answer, and if he asked something of Him, He would give him.'"
        },
        {
          "reference": "Sunan Nasa'i 1301, Sunan Abu Dawood 1495, Sunan Tirmidhi 3544, Sunan Ibn Majah 3858",
          "arabic": "( اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ ، لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ ، يَا ذَالْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ )’’",
          "translation": "Narrated by Anas (may Allah be pleased with him), he said: The Messenger of Allah (peace be upon him) was sitting with us, and a man was praying. He said: 'O Allah, I ask You, as all praise is due to You, there is no deity except You, the Bestower, the Originator of the heavens and the earth, O Possessor of Majesty and Honor, O Ever-Living, O Self-Sustaining.' The Prophet (peace be upon him) said: 'He has called upon Allah by His greatest name, with which if He is called upon, He answers, and if He is asked, He gives.'"
        },
        {
          "reference": "Sunan Abu Dawood 985",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ الْأَحَدُ الصَّمَدُ الَّذِي   لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ، أَنْ تَغْفِرَلِي ذُنُوبِي ، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "translation": "O Allah, I ask You, O Allah, the One, the Eternal Refuge; who begets not, nor was begotten, and there is none comparable to Him, that You forgive me my sins, verily You are the Oft-Forgiving, Most Merciful.' The Prophet ﷺ said: 'It has been forgiven, it has been forgiven.' He repeated this statement three times.' (Translation of the supplication: 'I ask You, O Allah! The One, the Self-Sufficient Master, who begets not, nor was begotten, and there is none comparable to Him! To forgive me my sins, verily You are the Oft-Forgiving, Most Merciful.')"
        },
        {
          "reference": "The Virtue of Surah Al-Fatiha"
        },
        {
          "reference": "Surah Al-Hijr, Ayah 87",
          "translation": "We have certainly given you, [O Muhammad], seven of the often repeated [verses] and the great Qur'an."
        },
        {
          "reference": "Sahih Bukhari 5007",
          "translation": "Narrated by Abu Huraira: The Prophet (ﷺ) asked Ubai bin Ka`b, 'How do you recite the Qur'an?' Ubai replied, 'I recite it with the Divine Inspiration of Allah.' The Prophet (ﷺ) said, 'Don't you see that no doubt, neither do your hearts get weary nor do your eyes get tired? So, recite the Qur'an as much as is easy for you. By Him in Whose Hand my life is, whenever you recite the Qur'an, you will be awarded for it and your sins will be committed to oblivion. Then Ubai added, 'So I recited it, and (for every verse) I have been awarded an extra good deed.'"
        },
        {
          "reference": "Sunan Abu Dawood 3420",
          "translation": "Narrated by Kharijah bin Salat: The people passed by an animal which had been tied up, and they said: 'This man (the owner) should offer a sacrifice for it.' Some of them said: 'He should not offer a sacrifice for it.' They argued about it until they kept him awake, and he had no option but to offer a sacrifice for it. So he took it to the Prophet (ﷺ) and told him what had happened. The Prophet (ﷺ) said: 'Eat it, for the fatigued person gets a double reward.'"
        },
        {
          "reference": "Sahih Muslim 878, Musnad Ahmad 823",
          "translation": "Narrated by Al-A'raj from Abu Huraira: The Messenger of Allah (ﷺ) said: 'He who performs a prayer and improves its ruku' and sujud (bowing and prostrating), his prayer will be rewarded by Allah to the extent of the improvement he made in his prayer. The servant said: 'O Messenger of Allah, what is an improvement in prayer?' He (the Prophet) said: 'It is the recitation of the Qur'an.'"
        },

        {
          "reference": "Sunan Tirmidhi 2875, Mishkat Al-Masabih 2142",
          "translation": "Hazrat Abu Huraira (RA) narrated that the Messenger of Allah (ﷺ) said to Ubayy bin Ka'b (RA): 'How do you recite in prayer?' He recited Surah Al-Fatiha, so the Messenger of Allah (ﷺ) said: 'By Him in Whose Hand is my soul! This is like a Surah which has been revealed in the Taurat (Torah) and in the Injeel (Gospel), but it is not like any that is in the Zabur (Psalms) or the Quran; it is the seven oft-repeated verses and the Great Quran which I have been given.'"
        },

        {
          "reference": "The Virtue of Surah Al-Ikhlas"
        },
        {
          "reference": "Sahih Muslim 1886",
          "translation": "The Prophet Muhammad (ﷺ) said: 'Is any one of you incapable of reciting one-third of the Qur'an in a night?' They (the Companions) asked, 'How can one recite one-third of the Qur'an?' He (the Prophet) replied, 'Say: He is Allah, [who is] One, is equivalent to one-third of the Qur'an.'"
        },
        {
          "reference": "Musnad Ahmad 8869",
          "translation": "Narrated by Mu'adh bin Anas: The Messenger of Allah (ﷺ) said, 'Whoever recites 'Say, He is Allah, [who is] One' (Surah Al-Ikhlas) ten times, Allah will build for him a house in Paradise.' Umar (may Allah be pleased with him) said, 'O Messenger of Allah! Then we can acquire a lot of houses.' The Prophet (ﷺ) replied, 'Allah has even more and better (rewards).'"
        },
        {
          "reference": "Sunan Abu Dawood 4722",
          "translation": "Narrated by Abu Huraira: The Prophet (ﷺ) said, 'When you hear the call to prayer, say what the Mu'adhdhin says. Then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah. Then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.'"
        },
        {
          "reference": "Sunan Tirmidhi 869",
          "translation": "Narrated by Aisha: The Messenger of Allah (ﷺ) performed Tawaf and prayed two Rak'ahs (units of prayer) behind Maqam Ibrahim, reciting in them Surah Al-Ikhlas and Surah Al-Kafirun."
        }
      ]
    },
    {
      "id": "6",
      "content": [
        {
          "reference": "Sunan Nasa'i 1284",
          "translation": "You said: 'An angel came to me and said: 'O Muhammad! Your Lord has said: Do you not like that whoever sends blessings upon you, I send mercy upon him ten times? And whoever sends salutations upon you, I send salutations upon him ten times.'"
        },
        {
          "reference": "Sunan Tirmidhi 3545, Musnad Ahmad 927",
          "translation": "The Messenger of Allah (ﷺ) said: 'The nose of the person who has been mentioned in my presence should be filled with dust, and he should not send blessings upon me.'"
        },
        {
          "reference": "Sunan Nasa'i 1293",
          "translation": "Hazrat Musa bin Talha reported: I asked Hazrat Zaid bin Kharijah (may Allah be pleased with him), and he said: I asked the Messenger of Allah (ﷺ) and he said: 'Send blessings upon me and make earnest supplication for me, and say: [O Allah! Bless Muhammad and the family of Muhammad] 'O Allah! Bestow special mercy upon Muhammad (ﷺ) and the family of Muhammad.'"
        },
        {
          "reference": "Musnad Ahmad 9966",
          "translation": "Narrated Abu Huraira: The Prophet (ﷺ) said, 'People who sit in a gathering in which they do not remember Allah and do not send blessings on the Prophet (ﷺ), will feel regret on the Day of Resurrection. Even if they enter Paradise due to their deeds.'"
        }
      ]
    },
    {
      "id": "7",
      "content": [
        {
          "reference": "Musnad Ahmad 2478, Sunan at-Tirmidhi 2572, Sunan an-Nasa'i 5523, Sunan Ibn Majah 4340",
          "translation": "Narrated by Anas ibn Malik (may Allah be pleased with him), the Messenger of Allah (peace be upon him) said: 'Whoever asks Allah for Paradise three times, Paradise will say (while praying for him): 'O Allah, admit him to Paradise.' And whoever seeks protection from the Fire three times, the Fire will say (while praying for him): 'O Allah, protect him from the Fire.'"
        },
        {
          "reference": "Surah Al-A'raf, verse 126",
          "arabic": "رَبَّنَاۤ اَفۡرِغۡ عَلَیۡنَا صَبۡرًا وَّ تَوَفَّنَا مُسۡلِمِیۡنَ",
          "translation": "Surah Al-A'raf, verse 126: 'Our Lord, pour upon us patience and let us die as Muslims [in submission to You].' (Quran 7:126)"
        },
        {
          "reference": "",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ الفردوس مع النَّبِیّٖنَ وَ الصِّدِّیۡقِیۡنَ وَ الشُّہَدَآءِ وَ الصّٰلِحِیۡنَ",

          "translation": "O Allah, I ask You for Paradise and its highest ranks among the Prophets, the truthful, the martyrs, and the righteous,"
        },
        {
          "reference": "Sunan Abu Dawood 1522, Sunan an-Nasa'i 1304",
          "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
          "translation": "It is narrated from Mu'adh ibn Jabal (may Allah be pleased with him) that the Prophet (peace be upon him) took his hand and said: 'By Allah, I love you.' Then he said: 'I advise you, O Mu'adh, do not fail to say after every prayer: 'O Allah, help me in remembering You, in thanking You, and in worshipping You excellently.'"
        },
        {
          "reference": "A Great Supplication",
          "arabic": "اللّهُمَّ اغْفِرْ لَنَا قَبْلَ الْمَوْتِ وَارْحَمْنَا عِنْدَ الْمَوْتِ وَلَا تُعَذِّبْنَا بَعْدَ الْمَوْتِ وَلَا تُحَاسِبْنَا يَوْمَ الْقِيمَةِ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "translation": "O Allah! Forgive us before death, have mercy on us at the time of death, and do not punish us after death. And do not hold us accountable on the Day of Judgment. Surely, You are Capable of all things."
        },

        {
          "reference": "Sunan Ibn Majah 3820",
          "arabic": "اللَّهُمَّ اجْعَلْنِي مِنْ الَّذِينَ إِذَا أَحْسَنُوا اسْتَبْشَرُوا وَإِذَا أَسَاءُوا اسْتَغْفَرُوا",

          "translation": "Narrated by 'Aishah (may Allah be pleased with her), the Prophet (peace be upon him) used to supplicate: 'O Allah, make me among those who, when they do good, feel happy, and when they do wrong, seek forgiveness.'"
        },
        {
          "reference": "Surah Aal-e-Imran, verse 193",
          "arabic": "رَبَّنَا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَ کَفِّرۡ عَنَّا سَیِّاٰتِنَا وَ تَوَفَّنَا مَعَ الۡاَبۡرَارِ",

          "translation": "Our Lord, forgive us our sins and remove from us our misdeeds and cause us to die with the righteous."
        },
        {
          "reference": "",
          "arabic": "اَلَّلھُمَّ اغْفِرْلِی وَلِوَالِدَیَّ وَلِلْمُوْمِنِیْنَ وَالْمُوْمِنَاتْ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَات",

          "translation": "O Allah, forgive me, my parents, the believers, the believing women, the Muslim men, and the Muslim women."
        },
        {
          "reference": "Surah Al-Hashr, verse 10",
          "arabic": "رَبَّنَا اغۡفِرۡ لَنَا وَ لِاِخۡوَانِنَا الَّذِیۡنَ سَبَقُوۡنَا بِالۡاِیۡمَانِ وَ لَا تَجۡعَلۡ فِیۡ قُلُوۡبِنَا غِلًّا لِّلَّذِیۡنَ اٰمَنُوۡا رَبَّنَاۤ اِنَّکَ رَءُوۡفٌ رَّحِیۡمٌ",

          "translation": "Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful."
        }
      ]
    },

    {
      "id": "8",
      "content": [
        {
          "reference": "Musnad Ahmad 2478, Sunan Tirmidhi 2572, Sunan Nasa'i 5523, Sunan Ibn Majah 4340",
          "translation": "Narrated by Anas bin Malik: The Messenger of Allah (ﷺ) said: 'Whoever asks Allah for Paradise three times, Paradise says (while making dua for him): 'O Allah! Admit him to Paradise.' And whoever seeks referenceuge from the Fire three times, the Fire says (while making dua for him): 'O Allah! Protect him from the Fire.'"
        },
        {
          "reference": "Surah Al-Baqarah, Ayah 201, Sahih Bukhari 6389, Sahih Muslim 6840",
          "arabic": "اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ",
          "translation": "O Allah! Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire."
        },
        {
          "reference": "Surah Al-Furqan, Ayah 65",
          "arabic": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
          "translation": "Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering."
        },
        {
          "reference": "Surah Al-Imran, Ayah 16",
          "arabic": "رَبَّنَآ اِنَّنَآ اٰمَنَّا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَ قِنَا عَذَابَ النَّارِ",
          "translation": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire."
        },
        {
          "reference": "Sahih Bukhari 832, Sahih Muslim 1324, 1333",
          "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
          "translation": "Narrated by Abu Huraira: The Prophet (ﷺ) said, 'When any one of you says Tashahhud, let him seek referenceuge with Allah from four things and say: O Allah, I seek referenceuge with You from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil of the trial of the False Messiah.'"
        },
        {
          "reference": "Al-Mustadrak al-Hakim 6508, Musnad Ahmad 17778",
          "arabic": "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآخِرَةِ",
          "translation": "O Allah, make the outcome of all our affairs good, and protect us from the disgrace of this world and the punishment of the Hereafter."
        },
        {
          "reference": "Surah Al-Imran, Ayah 8",
          "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
          "translation": "Our Lord, do not let our hearts deviate after You have guided us and grant us mercy from Yourself. Indeed, You are the Bestower."
        },
        {
          "reference": "Sunan Nasa'i 1303, Sahih Bukhari 834",
          "arabic": "اللهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "translation": "Narrated by Abu Bakr: The Messenger of Allah (ﷺ) said: 'Teach me a supplication which I may recite in my prayer.' He (the Prophet) said: 'Say: O Allah, I have wronged myself excessively and no one forgives sins except You. So grant me forgiveness from You and have mercy on me. Surely, You are the Most Forgiving, Most Merciful.'"
        },
        {
          "reference": "Sunan Abu Dawood 5079",
          "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ",
          "translation": "O Allah, save me from the Hellfire."
        },

        {
          "reference": "Sahih Bukhari 6370, 6374",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ",
          "translation": "Through these words, seek referenceuge with Allah, as the Prophet Muhammad (peace be upon him) used to seek referenceuge: 'O Allah! I seek referenceuge with You from cowardice, miserliness, being brought to a lowly state in old age, and the trials of this world and the punishment of the grave.'"
        }
      ]
    },
    {
      "id": "9",
      "content": [
        {
          "reference": "Sunan Tirmidhi 3235, Mishkat al-Masabih 748",
          "description": "When Muhammad (peace be upon him) saw Allah in a dream and made this prayer.",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ فِتْنَةَ قَوْمٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ، أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبَّ عَمَلٍ يُقَرِّبُ إِلَى حُبِّكَ",
          "translation": "O Allah! I seek Your assistance in doing good deeds and abstaining from evil deeds, and I desire to love the poor, and I ask for Your forgiveness and mercy. And when You intend to test a nation, then grant me death before You put me into trial. I seek Your love, and the love of those who love You, and the love of deeds that bring me closer to Your love.",
          "note": "The Messenger of Allah (peace be upon him) said: 'This is a right, learn and memorize it, and teach it to others.'"
        }
      ]
    },
    {
      "id": "10",
      "content": [
        {
          "reference": "Sunan Ibn Majah 3660",
          "translation": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) said: 'One Qintar (a large measure) is better than what is between the heavens and the earth. It is better than anything between the heavens and the earth. And the Messenger of Allah (ﷺ) said: 'The status of a person in Paradise is raised, and he will say: 'O Lord! How did I come to this?' He will be told: 'Through your son's seeking forgiveness for you.''"
        },
        {
          "reference": "Surah Bani Isra'il (17:24)",
          "arabic": "رَّبِّ ارۡحَمۡہُمَا کَمَا رَبَّیٰنِیۡ صَغِیۡرًا",
          "translation": "O my Lord! Have mercy on them both as they did care for me when I was little."
        },
        {
          "reference": "Surah Ibrahim (14:40-41)",
          "arabic": "رَبِّ اجۡعَلۡنِیۡ مُقِیۡمَ الصَّلٰوۃِ وَ مِنۡ ذُرِّیَّتِیۡ ٭ۖ رَبَّنَا وَ تَقَبَّلۡ دُعَآءِ رَبَّنَا اغۡفِرۡ لِیۡ وَ لِوَالِدَیَّ وَ لِلۡمُؤۡمِنِیۡنَ یَوۡمَ یَقُوۡمُ الۡحِسَابُ",
          "translation": "My Lord! Make me an establisher of prayer, and (many) from my translationcendants. Our Lord, and accept my supplication. Our Lord, forgive me and my parents and the believers the Day the account is established."
        },
        {
          "arabic": "اَلَّلھُمَّ اغْفِرْلِی وَلِوَالِدَیَّ وَلِلْمُوْمِنِیْنَ وَالْمُوْمِنَاتْ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَات",
          "translation": "O Allah! Forgive me, my parents, the believers, the believing men, and the believing women, and the Muslims, and the Muslim women."
        }
      ]
    },

    {
      "id": "11",
      "content": [
        {
          "reference": "Surah Al-Anbiya (21:87), Sunan Tirmidhi 3505",
          "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
          "translation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers."
        },
        {
          "reference": "Surah Al-Imran (3:173), Sahih Bukhari 4563",
          "arabic": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
          "translation": "Allah is sufficient for us, and He is the best Disposer of affairs."
        },
        {
          "reference": "Al-Mustadrak al-Hakim 1875, Sunan Tirmidhi 3524, Mishkat al-Masabih 2454",
          "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ",
          "translation": "O Ever-Living, O Self-Subsisting and Supporter of all, by Your mercy I seek help."
        },
        {
          "reference": "Sahih Bukhari 6345",
          "arabic": "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ وَالْأَرْضِ ، وَرَبُّ الْعَرْشِ الْعَظِيمِ",
          "translation": "There is no god but Allah, the Mighty, the Forbearing. There is no god but Allah, the Lord of the heavens and the earth, the Lord of the Great Throne."
        },
        {
          "reference": "Virtues of the Last Verses of Surah Al-Baqarah"
        },
        {
          "reference": "Surah Al-Baqarah Ayah 286-284, Sahih Bukhari 4008, Sahih Muslim 431, 1877, 1878, 1880, Sunan at-Tirmidhi 2882, Mishkat al-Masabih 2145",
          "translation": "Hadith: Ibn 'Abbas reported that Jibril (Gabriel) was sitting with the Prophet (ﷺ) and he heard a creaking sound from above. Jibril looked upward and said, 'This gate has opened today which has never been opened before.' An angel translationcended from it and came to the Prophet (ﷺ) and said, 'Receive the good news of two lights that you have been given, which no other prophet before you was given: the Opening of the Book (Surah Al-Fatihah) and the last verses of Surah Al-Baqarah."
        },
        {
          "reference": "Surah Al-Kahf (18:10)",
          "arabic": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
          "translation": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance."
        },
        {
          "reference": "Surah Taha (20:25-28)",
          "arabic": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي",
          "translation": "My Lord, expand for me my breast [with assurance] and ease for me my task and untie the knot from my tongue that they may understand my speech."
        },
        {
          "reference": "Sahih Bukhari 5425",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
          "translation": "O Allah, I seek referenceuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts, and from being overpowered by men."
        },
        {
          "reference": "Dua for Changing Grief into Happiness",
          "arabic": "No specific Arabic text provided."
        },
        {
          "reference": "Sahih Muslim 2126, Mishkat al-Masabih 1618",
          "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
          "translation": "Hadith: Um Salama reported that the Messenger of Allah (ﷺ) said: 'No Muslim is afflicted with any harm, but that he is afflicted with sin as a result of it, except for what Allah expiates for him due to it. The person who had lost a child or wealth, is not afflicted with sin due to it.'"
        },
        {
          "reference": "Sunan Ibn Majah 1385, Sunan Tirmidhi 3578, Mishkat al-Masabih 2495",
          "arabic": "( اللَّهُمَّ إِنِّى أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ نَبِىِّ الرَّحْمَةِ يَا مُحَمَّدُ إِنِّى قَدْ تَوَجَّهْتُ بِكَ إِلَى رَبِّى فِى حَاجَتِى هَذِهِ لِتُقْضَى اللَّهُمَّ فَشَفِّعْهُ فِىَّ )",
          "translation": "Narrated by 'Uthman bin Hanif: A blind man came to the Prophet (ﷺ) and said to him, 'Pray to Allah to heal me.' The Prophet (ﷺ) said: 'If you wish I will pray for you, and if you wish, you can be patient, for that is better for you.' The man said, 'Pray to Allah to heal me.' The Prophet (ﷺ) said: 'Go and perform ablution, then pray two Rak'ahs, and then say: O Allah, I ask You and turn to You through Your Prophet Muhammad, the Prophet of mercy; O Muhammad (ﷺ), I turn through you to my Lord, that He may fulfill my need, and I turn to Allah through you, O Muhammad (ﷺ). He then said: If you did so, Allah will heal you.' The man went away, performed ablution, prayed two Rak'ahs, and said the du'a. Allah healed him, and he never abandoned anything of the Salat."
        }
      ]
    },

    {
      "id": "12",
      "content": [
        {
          "reference": "Sunan Tirmidhi 3489, Sunan Ibn Majah 3832",
          "arabic": "اللَّهُمَّ إِنِّيأَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
          "translation": "O Allah, I ask You for guidance, piety, chastity, and sufficiency."
        },
        {
          "reference": "Sunan Ibn Majah 925",
          "arabic": "(اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً)",
          "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds."
        },
        {
          "reference": "Sunan Tirmidhi 3563, Mishkat al-Masabih 2449",
          "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
          "translation": "O Allah, suffice me with what is lawful against what is forbidden, and enrich me by Your grace from all others."
        },
        {
          "reference": "Surah Al-Ma'idah 5:114",
          "arabic": "اللّٰہُمَّ رَبَّنَاۤ اَنۡزِلۡ عَلَيۡنَا مَآئِدَۃً مِّنَ السَّمَآءِ تَكُوۡنُ لَنَا عِیۡدًا لِّاَوَّلِنَا وَ اٰخِرِنَا وَ اٰیَۃً مِّنۡكَ ۚ وَ ارۡزُقۡنَا وَ اَنۡتَ خَیۡرُ الرّٰزِقِیۡنَ",
          "translation": "O Allah, our Lord, send down to us a table [spread with food] from the heaven to be for us a festival for the first of us and the last of us and a sign from You. And provide for us, and You are the best of providers."
        }
      ]
    },

    {
      "id": "13",
      "content": [
        {
          "reference": "Sunan Ibn Majah 925",
          "arabic": "(اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً)",
          "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds."
        },
        {
          "reference": "Surah Taha 20:114",
          "arabic": "رَّبِّ زِدۡنِیۡ عِلۡمًا",
          "translation": "O my Lord! Increase me in knowledge."
        }
      ]
    },

    {
      "id": "14",
      "content": [
        {
          "reference": "Sahih Muslim 2257",
          "arabic": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ لَلَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ",
          "translation": "Peace be upon you, O people of the abotranslation, among the believers and the Muslims, and indeed we, by the will of Allah, will join you. I ask Allah for safety for us and for you."
        }
      ]
    },

    {
      "id": "15",
      "content": [
        {
          "reference": "Sunan Tirmidhi 3426",
          "arabic": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "translation": "The Messenger of Allah (ﷺ) said: 'Whoever says when he leaves his house: Bismillah, tawakkaltu 'ala Allah, la hawla wa la quwwata illa billah (In the name of Allah, I put my trust in Allah, there is no power and no strength except with Allah),' it will be said to him: 'You have been sufficed, and you have been protected,' and the devil will turn away from him.'"
        },
        {
          "reference": "Surah Az-Zukhruf (43:13-14)",
          "arabic": "سُبۡحٰنَ الَّذِیۡ سَخَّرَ لَنَا ہٰذَا وَ مَا کُنَّا لَہٗ مُقۡرِنِیۡنَ وَ اِنَّاۤ اِلٰی رَبِّنَا لَمُنۡقَلِبُوۡنَ",
          "translation": "Glorified is He who has subjected this to us, and we could not have [otherwise] subdued it. And indeed we, to our Lord, will [surely] return."
        }
      ]
    },

    {
      "id": "16",
      "content": [
        {
          "reference": "Sunan Abi Dawud 3201",
          "arabic": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا، وَشَاهِدِنَا وَغَائِبِنَا، وَصَغِيرِنَا وَكَبِيرِنَا، وَذَكَرِنَا وَأُنْثَانَا اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلَامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِيمَانِ",
          "translation": "O Allah! Forgive our living and our dead, those who are present among us and those who are absent, our young and our old, our males and our females. O Allah! Whoever You keep alive, keep him alive on Islam, and whoever You cause to die, cause him to die with faith."
        },
        {
          "reference": "Sahih Muslim 2232, 2234; Sunan Nasai 62, 1985, 1986; Sunan Tirmidhi 1025; Sunan Ibn Majah 1500",
          "arabic": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأَدْخِلْهُ الْجَنَّةَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ أَوْ مِنْ عَذَابِ النَّارِ",
          "translation": "O Allah! Forgive him, have mercy on him, pardon him, grant him security, provide him a nice place and spacious accommodation, wash him (off from his sins) with water, snow, and hail, cleanse him from sins as a white garment is cleansed from dirt, replace his present abode with a better one, replace his family with a better one, replace his spouse with a better one, admit him to Paradise, and protect him from the torment of the grave and the torment of the Hell-fire."
        },
        {
          "reference": "Sunan Abi Dawud 3202; Sunan Ibn Majah 1499",
          "arabic": "اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِى ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ فَاغْفِرْ",
          "translation": "O Allah! Such-and-such (mentioning the name of the dead) is under Your protection and in the rope of Your security. Save him from the trial of the grave and torment of the Fire, and You are the One Who fulfills the promises and grants requests, so forgive him."
        },
        {
          "reference": "Sahih Muslim 2130, Sunan Abi Dawud 3118, Sunan Ibn Majah 1454",
          "arabic": "اللَّهُمَّ اغْفِرْ لِأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ وَافْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ",
          "translation": "O Allah! Forgive Abu Salamah and elevate his status among the guided ones, and make his offspring the successors, and forgive us and him, O Lord of the worlds. Enlarge his grave and shed light upon him in it.",
          "note": "Note: Abu Salamah can be replaced with any other name."
        },
        {
          "reference": "Sahih Bukhari 2884, 6383, 4323; Sahih Muslim 6406",
          "arabic": "اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ",
          "translation": "O Allah! Forgive 'Ubayd Abu 'Amir, and raise his status among the guided ones on the Day of Resurrection.",
          "note": "Note: Abu 'Amir can be replaced with any other name."
        },
        {
          "reference": "Al-Mustadrak al-Hakim 1328",
          "arabic": "اللَّهُمَّ عَبْدُكَ، وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ إِنْ كَانَ مُحْسِنًا فَزِدْ فِي إِحْسَانِهِ، وَإِنْ كَانَ مُسِيئًا فَتَجَاوَزَ عَنْهُ",
          "translation": "O Allah! He is Your servant, the son of Your servant. He is in need of Your mercy, and You are without need of punishing him. If he was a doer of good, then increase his goodness, and if he was a wrongdoer, then overlook his sins."
        }
      ]
    },

    {
      "id": "17",
      "content": [
        {
          "reference": "Sunan Tirmidhi 3388, Sunan Abi Dawud 5088",
          "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
          "translation": "I seek referenceuge in Allah's perfect words from the evil of what He has created."
        },
        {
          "reference": "Sahih Muslim 6880",
          "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
          "translation": "I seek referenceuge in the perfect words of Allah from the evil of what He has created."
        },
        {
          "reference": "Sunan Nasai 5533",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ التَّرَدِّي وَالْهَدْمِ وَالْغَرَقِ وَالْحَرِيقِ وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا",
          "translation": "O Allah! I seek referenceuge in You from slipping or being thrown, collapsing or drowning, being burned or suffocated, and I seek referenceuge in You from the devil misleading me at the time of death, and I seek referenceuge in You from dying in Your cause while retreating, and I seek referenceuge in You from dying of poisonous creatures."
        },
        {
          "reference": "Sahih Muslim 6944",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ",
          "translation": "O Allah! I seek referenceuge in You from the removal of Your blessings, the change of Your protection, the suddenness of Your punishment, and from all Your displeasure."
        }
      ]
    },

    {
      "id": "18",
      "content": [
        {
          "reference": "Sahih Bukhari 614",
          "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ ، حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ",
          "translation": "O Allah! Lord of this perfect call and established prayer, grant Muhammad the intercession and favor, and raise him to the praised station You have promised him, a station of praise which You have promised him."
        }
      ]
    }
  ],

  "QuranwithTran": [
    {
      "id": "1",
      "link": "http://bit.ly/2qpLHGY",
      "text": "para 1",
      "button": "Read more"
    },

    {
      "id": "2",
      "link": "http://bit.ly/2qnS2Ha",
      "text": "para 2",
      "button": "Read more"
    },

    {
      "id": "3",
      "link": "http://bit.ly/2sbSqoq",
      "text": "para 3",
      "button": "Read more"
    },

    {
      "id": "4",
      "link": "http://bit.ly/2r6TOeq",
      "text": "para 4",
      "button": "Read more"
    },

    {
      "id": "5",
      "link": "http://bit.ly/2qzzsYk",
      "text": "para 5",
      "button": "Read more"
    },

    {
      "id": "6",
      "link": "http://bit.ly/2qI4EE2",
      "text": "para 6",
      "button": "Read more"
    },
    {
      "id": "7",
      "link": "http://bit.ly/2rW88HS",
      "text": "para 7",
      "button": "Read more"
    },

    {
      "id": "8",
      "link": "http://bit.ly/2qK0aO4",
      "text": "para 8",
      "button": "Read more"
    },

    {
      "id": "9",
      "link": "http://bit.ly/2rBqzB0",
      "text": "para 9",
      "button": "Read more"
    },
    {
      "id": "10",
      "link": "http://bit.ly/2s3dkdd",
      "text": "para 10",
      "button": "Read more"
    },

    {
      "id": "11",
      "link": "http://bit.ly/2so5po5",
      "text": "para 11",
      "button": "Read more"
    },

    {
      "id": "12",
      "link": "http://bit.ly/2rzgVP9",
      "text": "para 12",
      "button": "Read more"
    },

    {
      "id": "13",
      "link": "http://bit.ly/2rSIJ1l",
      "text": "para 13",
      "button": "Read more"
    },

    {
      "id": "14",
      "link": "http://bit.ly/2sk5Lid",
      "text": "para 14",
      "button": "Read more"
    },

    {
      "id": "15",
      "link": "http://bit.ly/2rKJHw3",
      "text": "para 15",
      "button": "Read more"
    },

    {
      "id": "16",
      "link": "http://bit.ly/2sMTr7y",
      "text": "para 16",
      "button": "Read more"
    },

    {
      "id": "17",
      "link": "http://bit.ly/2r9opp2",
      "text": "para 17",
      "button": "Read more"
    },

    {
      "id": "18",
      "link": "http://bit.ly/2rpK4c8",
      "text": "para 18",
      "button": "Read more"
    },

    {
      "id": "19",
      "link": "http://bit.ly/2rpq1iW",
      "text": "para 19"
    },

    {
      "id": "20",
      "link": "http://bit.ly/2rAX4Mc",
      "text": "para 20",
      "button": "Read more"
    },

    {
      "id": "21",
      "link": "http://bit.ly/2rBv2Aa",
      "text": "para 21",
      "button": "Read more"
    },

    {
      "id": "22",
      "link": "http://bit.ly/2sbmkft",
      "text": "para 22",
      "button": "Read more"
    },
    {
      "id": 23,
      "link": "http://bit.ly/2rtPXpH",
      "text": "para 23",
      "button": "Read more"
    },
    {
      "id": 24,
      "link": "http://bit.ly/2sfUCOE",
      "text": "para 24",
      "button": "Read more"
    },
    {
      "id": 25,
      "link": "http://bit.ly/2smfZxF",
      "text": "para 25",
      "button": "Read more"
    },
    {
      "id": 26,
      "link": "http://bit.ly/2tLUEvC",
      "text": "para 26",
      "button": "Read more"
    },
    {
      "id": 27,
      "link": "http://bit.ly/2tru5wz",
      "text": "para 27",
      "button": "Read more"
    },
    {
      "id": 28,
      "link": "http://bit.ly/2rXeW98",
      "text": "para 28",
      "button": "Read more"
    },
    {
      "id": 29,
      "link": "http://bit.ly/2s5NLEk",
      "text": "para 29",
      "button": "Read more"
    },
    {
      "id": 30,
      "link": "http://bit.ly/2s1BBB4",
      "text": "para 30",
      "button": "Read more"
    }
  ],

  "navbar": {
    "navHeading": "In the remembrance of Allah, hearts find tranquility"
  }
}
