{
  "mainHeadings": [
    {
      "id": "translationQuran",
      "title": "قرآن  اردو  ترجمے کے ساتھ",
      "button": "Read more"
    },
    {
      "id": "namaz",
      "title": "قرآن و سنت کی روشنی میں نماز کی اہمیت",
      "button": "Read more"
    },
    {
      "id": "dua",
      "title": "قرآن و سنت کی روشنی میں دعا کی اہمیت",
      "button": "Read more"
    },
    {
      "id": "wealth",
      "title": "مال ایک فتنہ",
      "button": "Read more"
    }
  ],

  "wealthSubHeading": [
    {
      "id": "1",
      "title": "مال ایک فتنہ",
      "button": "Read more"
    },
    {
      "id": "2",
      "title": "آخرت کو دنیا پرترجی دینا",
      "button": "Read more"
    },
    {
      "id": "3",
      "title": "سود ایک لعنت",
      "button": "Read more"
    }
  ],

  "wealthDetailPage": [
    {
      "id": "1",
      "content": [
        {
          "reference": "سورۃ ٱلهُمَزَة",
          "translation": "بڑی خرابی ہے ہر ایسے شخص کی جو عیب ٹٹولنے والا، غیبت کرنے والا ہو۔ جو مال کو جمع کرتا جائے اور گنتا جائے۔ وہ سمجھتا ہے کہ اس کا مال اس کے پاس سدا رہے گا۔ ہرگز نہیں، یہ تو ضرور توڑ پھوڑ دینے والی آگ میں پھینک دیا جائے گا۔ ور تجھے کیا معلوم کہ ایسی آگ کیا ہوگی؟ وہ اللہ تعالٰی کی سلگائی ہوئی آگ ہوگی، جو دلوں پر چڑھتی چلی جائے گی۔ وہ ان پر ہر طر ف سے بند کی ہوئی ہو گی، بڑے بڑے ستونوں میں۔"
        },
        {
          "reference": "سورۃ التکاثر",
          "translation": "تمہیں غافل رکھا مال کی زیادہ طلبی نے، یہاں تک کہ تم نے قبروں کا منہ دیکھا۔ ہاں ہاں جلد جان جاؤ گے۔ پھر ہاں ہاں جلد جان جاؤ گے۔ ہاں ہاں اگر یقین کا جاننا جانتے تو مال کی محبت نہ رکھتے، بیشک ضرور جہنم کو دیکھو گے۔ پھر بیشک ضرور اسے یقینی دیکھنا دیکھو گے۔ پھر بیشک ضرور اس دن تم سے نعمتوں کی پرسش ہو گی۔"
        },
        {
          "reference": "صحیح مسلم 7420, مشکوٰۃ المصابیح 5169",
          "translation": "حضرت مطرف اپنے والد سے روایت کرتے ہیں، انہوں نے کہا: میں نبی ﷺ کی خدمت میں حاضر ہوا، آپ (اس وقت) سورۂ تکاثر کی تلاوت فرما رہے تھے، آپ ﷺ نے فرمایا: ‘‘ابن آدم کہتا ہے: میرا مال، میرا مال، اے ابن آدم! حالانکہ تیرا مال تو صرف وہ ہے جو تو نے کھایا اور ختم کر دیا، یا پہن لیا اور بوسیدہ کر دیا یا صدقہ کر کے (آخرت کے لیے) آگے بھیج دیا۔"
        },
        {
          "reference": "صحیح مسلم 2415, 2417 سنن ترمذی 2337",
          "translation": "ابن شہاب نے حضرت انس بن مالک رضی اللہ عنہ سے اور انھوں نے رسول اللہ ﷺ سے روایت کی کہ آپ نے فرمایا: ‘‘اگر ابن آدم کے پاس سونے کی ( بھری ہوئی ) ایک وادی ہو تو وہ چاہے گا کہ اس کے پاس ایک اور وادی بھی ہو، اس کا منہ مٹی کے سوا کوئی اور چیز نہیں بھرتی، اللہ اس کی طرف توجہ فرماتا ہے جو اللہ کی طرف توجہ کرتا ہے۔‘‘"
        },
        {
          "reference": "صحیح بخاری 6412 سنن ترمذی 2304 سنن ابن ماجہ 4170",
          "translation": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا: ”دو نعمتیں ایسی ہیں کہ اکثر لوگ ان کی قدر نہیں کرتے، صحت اور فر"
        },
        {
          "reference": "صحیح بخاری 6437-6436، صحیح مسلم 2418",
          "translation": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا، ”اگر انسان کے پاس مال کی دو وادیاں ہوں تو تیسری کا خواہشمند ہو گا اور انسان کا پیٹ مٹی کے سوا اور کوئی چیز نہیں بھر سکتی اور اللہ اس شخص کی توبہ قبول کرتا ہے جو ( دل سے ) سچی توبہ کرتا ہے۔“"
        },
        {
          "reference": "صحیح بخاری 6514، صحیح مسلم 7424، سنن ترمذی 2379، سنن نسائی 1939",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، ”میت کے ساتھ تین چیزیں چلتی ہیں دو تو واپس آ جاتی ہیں صرف ایک کام اس کے ساتھ رہ جاتا ہے، اس کے ساتھ اس کے گھر والے اس کا مال اور اس کا عمل چلتا ہے اس کے گھر والے اور مال تو واپس آ جاتا ہے اور اس کا عمل اس کے ساتھ باقی رہ جاتا ہے۔“"
        },
        {
          "reference": "صحیح مسلم 7420",
          "translation": "آپ نے فرمایا: ’’ ابن آدم کہتا ہے: میرا مال، میرا مال ۔‘‘ فرمایا: ’’ آدم کے بیٹے! تیرے مال میں سے تیرے لیے صرف وہی ہے جو تم نے کھا کر فنا کر دیا، یا پہن کر پرانا کر دیا، یا صدقہ کر کے آگے بھیج دیا ۔‘‘"
        },
        {
          "reference": "سنن ترمذی 2336، مشکوٰۃ المصابیح 5914",
          "translation": "میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: ”ہر امت کی آزمائش کسی نہ کسی چیز میں ہے اور میری امت کی آزمائش مال میں ہے“"
        },
        {
          "reference": "صحیح بخاری 2452، 3198، صحیح مسلم 4135-4132",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے سنا ہے کہ جس نے ایک بالشت زمین بھی ظلم سے کسی کی دبا لی تو قیامت کے دن ساتوں زمینوں کا طوق اس کی گردن میں ڈالا جائے گا۔"
        },
        {
          "reference": "صحیح بخاری 4042, صحیح مسلم 5977",
          "translation": "آپ ﷺ نے فرمایا: ’’ میں حوض پر تمہارا پیش رو ہوں گا اور اس حوض کا عرض اتنا ہے جتنا ( شام کے ساتھ واقع ) ایلہ سے لے کر ( مدینہ اور مکہ کے درمیان واقع ) جحفہ کا فاصلہ ہے۔ مجھے تمہارے بارے میں یہ خوف نہیں کہ تم ( سب کے سب ) میرے بعد مشرک ہو جاؤ گے لیکن میں تمہارے بارے میں دنیا کے حوالے سے ڈرتا ہوں کہ تم اس میں ایک دوسرے کا مقابلہ کرنے لگو گے، آپس میں لڑو گے اور اسی طرح ہلاک ہو جاؤ گے جس طرح تم سے پہلے والے لوگ ہلاک ہوئے۔‘‘"
        },
        {
          "reference": "صحیح بخاری 2654, 5977-5976, 6273, 6919, صحیح مسلم 259, سنن ترمذی 1901, 2301, 3019",
          "translation": "مجھ سے عبیداللہ بن ابی بکر نے بیان کیا، انہوں نے کہا کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا، انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کبائر کا ذکر کیا یا ( انہوں نے کہا کہ ) نبی کریم صلی اللہ علیہ وسلم سے کبائر کے متعلق پوچھا گیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کے ساتھ شرک کرنا، کسی کی ( ناحق ) جان لینا، والدین کی نافرمانی کرنا۔ پھر فرمایا کیا میں تمہیں سب سے بڑا گناہ نہ بتا دوں؟ فرمایا کہ جھوٹی بات یا فرمایا کہ جھوٹی شہادت ( سب سے بڑا گناہ ہے )۔ شعبہ نے بیان کیا کہ میرا غالب گمان یہ ہے کہ نبی کریم صلی اللہ علیہ وسلم نے جھوٹی گواہی فرمایا تھا۔"
        },
        {
          "reference": "صحیح بخاری 6460, صحیح مسلم 2427, 7441, سنن ترمذی 2361, سنن ابن ماجہ 4139, مشکوٰۃ المصابیح 5164",
          "translation": "حضرت ابوہریرہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے دعا فرمائی: ’’ اے اللہ! آل محمد ﷺ کو صرف اتنا رزق عطا فرما کہ ان کے جسم و جان کا رشتہ برقرار رہ سکے۔‘‘"
        },
        {
          "reference": "صحیح بخاری 6957، 4565، 4659، 1402، 1403، صحیح مسلم 2290، 2292، سنن ابو داود 1658، سنن نسائی 2484، 2450، 2444، سنن ابن ماجہ 1786",
          "translation": " انہوں نے عروہ سے کہا، بیٹے! ہم دو مہینوں میں تین چاند دیکھ لیتے ہیں اور رسول اللہ صلی اللہ علیہ وسلم ( کی بیویوں ) کے گھروں میں چولھا نہیں جلتا تھا۔ میں نے پوچھا پھر آپ لوگ زندہ کس چیز پر رہتی تھیں؟ بتلایا کہ صرف دو کالی چیزوں پر، کھجور اور پانی۔ ہاں، نبی کریم صلی اللہ علیہ وسلم کے کچھانصاری پڑوسی تھے جن کے یہاں دودہیل اونٹنیاں تھیں وہ اپنے گھروں سے نبیکریم صلی اللہ علیہ وسلم کے لیے دودھ بھیج دیتے اور آپ ہمیں وہی دودھ پلا دیتے تھے۔"
        },
        {
          "reference": "صحیح بخاری 1408",
          "translation": "اس وقت میں نے سورج کی طرف نظر اٹھا کر دیکھا کہ کتنا دن ابھی باقی ہے ۔ کیونکہ مجھے ( آپ کی بات سے ) یہ خیال گزرا کہ آپ اپنے کسی کام کے لیے مجھےبھیجیں گے ۔ میں نے جواب دیا کہ جی ہاں ( احد پہاڑ میں نے دیکھا ہے ) آپ نےفرمایا کہ اگر میرے پاس احد پہاڑ کے برابر سونا ہو میں اس کے سوا دوست نہی رکھتا کہ صرف تین دینار بچا کر باقی تمام کا تمام ( اللہ کے راستے میں ) دےڈالوں ( ابوذر رضی اللہ عنہ نے پھر فرمایا کہ ) ان لوگوں کو کچھ معلوم نہیں یہ دنیا جمع کرنے کی فکر کرتے ہیں ۔ ہرگز نہیں خدا کی قسم نہ میں ان کیدنیا ان سے مانگتا ہوں اور نہ دین کا کوئی مسئلہ ان سے پوچھتا ہوں تاآنکہمیں اللہ تعالیٰ سے جا ملوں ۔"
        },
        {
          "reference": "سورۃ توبہ آیت نمبر 35",
          "translation": " اے ایمان والو! اکثر علماء اور عابد لوگوں کا مال ناحق کھا جاتے ہیں اوراللہ کی راہ سے روک دیتے ہیں اور جو لوگ سونے چاندی کا خزانہ رکھتے ہیں اور اللہ کی راہ میں خرچ نہیں کرتے انہیں دردناک عذاب کی خبر پہنچا دیجئے ۔ "
        },
        {
          "reference": " صحیح بخاری 6957,4565,4659, 1402,1403 صحیح مسلم 2290,2292 سنن ابو داود1658 سنن نسائی 2484,2450,2444 سنن ابن ماجہ 1786",
          "translation": " رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جسے اللہ نے مال دیا اور اس نے اس کی زکوٰۃ نہیں ادا کی تو قیامت کے دن اس کا مال نہایت زہریلے گنجے سانپکی شکل اختیار کر لے گا۔ اس کی آنکھوں کے پاس دو سیاہ نقطے ہوں گے۔ جیسے سانپ کے ہوتے ہیں ‘ پھر وہ سانپ اس کے دونوں جبڑوں سے اسے پکڑ لے گا اور کہے گا کہ میں تیرا مال اور خزانہ ہوں۔ اس کے بعد آپ صلی اللہ علیہ وسلم نے یہ آیت پڑھی ”اور وہ لوگ یہ گمان نہ کریں کہ اللہ تعالیٰ نے انہیں جو کچھ اپنے فضل سے دیا ہے وہ اس پر بخل سے کام لیتے ہیں کہ ان کا مال ان کے لیےبہتر ہے۔ بلکہ وہ برا ہے جس مال کے معاملہ میں انہوں نے بخل کیا ہے۔ قیامتمیں اس کا طوق بنا کر ان کی گردن میں ڈالا جائے گا۔“"
        }
      ]
    },
    {
      "id": "2",
      "content": [
        {
          "reference": "سورة البقرة آیت نمبر 155",
          "translation": "اور ہم کسی نہ کسی طرح تمہاری آزمائش ضرور کریں گے ، دشمن کے ڈر سے ، بھوک پیاس سے ، مال و جان اور پھلوں کی کمی سے اور ان صبر کرنے والوں کو خوشخبری دے دیجئے ۔"
        },
        {
          "reference": "سورة الأعلى آیت نمبر 19-16",
          "translation": "لیکن تم تو دنیا کی زندگی کو ترجیح دیتے ہو اور آخرت بہت بہتر اور بہت بقا والی ہے ۔یہ باتیں پہلی کتابوں میں بھی ہیں ۔ ( یعنی ) ابراہیم اور موسیٰ کی کتابوں میں ."
        },
        {
          "reference": "صحیح مسلم 7197 سنن ترمذی 2323 سنن ابن ماجہ 4108",
          "translation": "رسول اللہ ﷺ نے فرمایا :’’ اللہ کی قسم ! آخرت ( کے مقابلے ) میں دنیا کی حیثیت اس سے زیادہ نہیں جس طرح تم میں سے کوئی شخص اپنی ایک انگلی سمندر میں ڈالے"
        },
        {
          "reference": "سورۃ توبہ آیت نمبر 111",
          "translation": "کہ اللہ نے مومنوں سے ان کی جانیں اور ان کے مال اس بات کے بدلے خرید لیے ہیں کہ جنت انہی کی ہے ۔ وہ اللہ کے راستے میں جنگ کرتے ہیں ، جس کے نتیجے میں مارتے بھی ہیں ، اور مرتے بھی ہیں ۔ یہ ایک سچا وعدہ ہے جس کی ذمہ داری اللہ نے تورات اور انجیل میں بھی لی ہے ، اور قرآن میں بھی ۔ اور کون ہے جو اللہ سے زیادہ اپنے عہد کو پورا کرنے والا ہو؟ لہذا اپنے اس سودے پر خوشی مناؤ جو تم نے اللہ سے کرلیا ہے ۔ اور یہی بڑی زبردست کامیابی ہے ۔"
        },
        {
          "reference": "صحیح مسلم 7417 سنن ترمذی 2324 سنن ابن ماجہ 4113",
          "translation": "رسول اللہ ﷺ نے فرمایا :’’ دنیا مومن کا قید خانہ اور کافر کی جنت ہے ۔‘‘"
        },
        {
          "reference": "صحیح مسلم 7418 سنن ابو داود 186",
          "translation": "رسول اللہ ﷺ ( مدینہ کی ) کسی بالائی جانب سے داخل ہوتے ہوئے بازار سے گزرے ، لوگ آپ کے پہلو میں ( آپ کے ساتھ چل رہے ) تھے ۔ آپ حقیر سے کانوں والے مرے ہوئے میمنے کے پاس سے گزرے ، آپ نے اسے کان سے پکڑ کر اٹھایا ، پھر فرمایا :’’ تم میں سے کون اسے ایک درہم کے عوض لینا پسند کرے گا ؟‘‘ تو انھوں ( صحابہ ) نے کہا : ہمیں یہ کسی بھی چیز کے عوض لینا پسند نہیں ، ہم اسے لے کر کیا کریں گے ؟ آپ نے فرمایا :’’ ( پھر ) کیا تم پسند کرتے ہو کہ یہ تمھیں مل جائے ؟‘‘ انھوں ( صحابہ ) نے عرض کی : اللہ کی قسم ! اگر یہ زندہ ہوتا تب بھی اس میں عیب تھا ، کیونکہ ( ایک تو ) یہ حقیر سے کانوں والا ہے ( بھلا نہیں لگتا ) ، پھر جب وہ مرا ہوا ہے تو کس کام کا ؟ اس پر آپ ﷺ نے فرمایا :’’ اللہ کی قسم ! جتنا تمہارے نزدیک یہ حقیر ہے اللہ کے نزدیک دنیا اس سے بھی زیادہ حقیر ہے ۔‘‘"
        },
        {
          "reference": "صحیح مسلم 7088 سنن ابن ماجہ 4321",
          "translation": "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ ﷺ نے فرمایا :’’ قیامت کے دن اہل دنیا میں سب سے زیادہ نعمتوں کے مالک ، جہنم کے ایک مستحق کو لایا جائے گا اور اسے آگ میں ایک ڈبکی دی جائے گی ، پھر کہا جائے گا : آدم کے بیٹے ! کیا تو نے کبھی کوئی بھلائی دیکھی ؟ کیا تمہیں کبھی کوئی نعمت چھو کر گزری ؟ تو وہ کہے گا : اے پروردگار ! اللہ کی قسم ! کبھی نہیں ، اور دنیا میں سب سے زیادہ اذیتیں سہنے والے ، جنت کے مستحق کو لایا جائے گا اور اسے جنت ( کی کسی نہر ) میں ایک غوطہ لگوایا جائے گا ، پھر اس سے پوچھا جائے گا : آدم کے بیٹے ! کیا تم نے کبھی کوئی تکلیف دیکھی ؟ کیا کوئی تنگی تمہیں چھو کر گزری ؟ تو وہ کہے گا : نہیں ، اللہ کی قسم ! اے پروردگار ! مجھے کبھی کوئی اذیت نہیں اٹھانی پڑی اور میں نے کبھی کوئی سختی نہیں دیکھی ۔‘‘"
        },
        {
          "reference": "سنن ترمذی 2560,سنن ابو داود 4744,سنن نسائی 3794",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب اللہ تعالیٰ جنت اور جہنم کو پیدا کر چکا تو جبرائیل کو جنت کی طرف بھیجا اور کہا: جنت اور اس میں جنتیوں کے لیے جو کچھ ہم نے تیار کر رکھا ہے، اسے جا کر دیکھو“، آپ نے فرمایا: ”وہ آئے اور جنت کو اور جنتیوں کے لیے اللہ تعالیٰ نے جو تیار کر رکھا ہے اسے دیکھا:“ آپ نے فرمایا: ”پھر اللہ کے پاس واپس گئے اور عرض کیا: تیری عزت کی قسم! جو بھی اس کے بارے میں سن لے اس میں ضرور داخل ہو گا، پھر اللہ نے حکم دیا تو وہ ناپسندیدہ اور تکلیف دہ چیزوں سے گھیر دی گئی، اور اللہ نے کہا: اس کی طرف دوبارہ جاؤ اور اس میں جنتیوں کے لیے ہم نے جو تیار کیا ہے اسے دیکھو“۔ آپ نے فرمایا: ”جبرائیل علیہ السلام جنت کی طرف دوبارہ گئے تو وہ ناپسندیدہ اور تکلیف دہ چیزوں سے گھری ہوئی تھی چنانچہ وہ اللہ تعالیٰ کے پاس لوٹ کر آئے اور عرض کیا: مجھے اندیشہ ہے کہ اس میں کوئی داخل ہی نہیں ہو گا، اللہ نے کہا: جہنم کی طرف جاؤ اور جہنم کو اور جو کچھ جہنمیوں کے لیے میں نے تیار کیا ہے اسے جا کر دیکھو، ( انہوں نے دیکھا کہ ) اس کا ایک حصہ دوسرے پر چڑھ رہا ہے، وہ اللہ کے پاس آئے اور عرض کیا: تیری عزت کی قسم! اس کے بارے میں جو بھی سن لے اس میں داخل نہیں ہو گا۔ پھر اللہ نے حکم دیا تو وہ شہوات سے گھیر دی گئی۔ اللہ تعالیٰ نے کہا: اس کی طرف دوبارہ جاؤ، وہ اس کی طرف دوبارہ گئے اور ( واپس آ کر ) عرض کیا: تیری عزت کی قسم! مجھے ڈر ہے کہ اس سے کوئی نجات نہیں پائے گا بلکہ اس میں داخل ہو گا“۔"
        }
      ]
    },
    {
      "id": "3",
      "content": [
        {
          "reference": "سورة البقرة آیت نمبر 275",
          "translation": "سود خور لوگ نہ کھڑے ہونگے مگر اسی طرح جس طرح وہ کھڑا ہوتا ہے جسے شیطان چھو کر خبطی بنا دے ، یہ اس لئے کہ یہ کہا کرتے تھے کہ تجارت بھی تو سود ہی کی طرح ہے حالانکہ اللہ تعالٰی نے تجارت کو حلال کیا اور سود کو حرام ، جو شخص اپنے پاس آئی ہوئی اللہ تعالٰی کی نصیحت سُن کر رُک گیا اس کے لئے وہ ہے جو گزرا اور اس کا معاملہ اللہ تعالٰی کی طرف ہے اور جو پھر دوبارہ ( حرام کی طرف ) لوٹا وہ جہنمی ہے ، ایسے لوگ ہمیشہ ہی اس میں رہیں گے ۔"
        },
        {
          "reference": "سورة البقرة آیت نمبر 276",
          "translation": "اللہ تعالٰی سود کو مٹاتا ہے اور صدقہ کو بڑھاتا ہے اور اللہ تعالٰی کسی ناشکرے اور گنہگار سے محبت نہیں کرتا ۔"
        },
        {
          "reference": "سورة البقرة آیت نمبر 278",
          "translation": "اے ایمان والو اللہ تعالٰی سے ڈرو اور جو سود باقی رہ گیا ہے وہ چھوڑ دو اگر تم سچ مچ ایمان والے ہو ۔"
        },
        {
          "reference": "سورة البقرة آیت نمبر 279",
          "translation": "اور اگر ایسا نہیں کرتے تو اللہ تعالٰی سے اور اس کے رسول سے لڑنے کے لئے تیار ہو جاؤ ہاں اگر توبہ کر لو تو تمہارا اصل مال تمہارا ہی ہے ، نہ تم ظلم کرو اور نہ تم پر ظلم کیا جائے ۔"
        },
        {
          "reference": "صحیح بخاری 7048,مشکوٰۃ المصابیح 4621",
          "translation": "ہم چلے حتی کہ ہم خون کی نہر پر پہنچے ، وہاں نہر کے سامنے پتھر ہیں ، وہ شخص جو نہر میں ہے جب وہ باہر نکلنے کا ارادہ کرتا تھا تو باہر کنارے پر کھڑا آدمی اس کے منہ پر پتھر پھینکتا اور اسے اپنی پہلی جگہ پر پہنچا دیتا ہے ، وہ جب بھی نکلنے کے لیے آتا تھا پھر وہ اس کے منہ پر پتھر مارتا ہے تو وہ واپس وہیں چلا جاتا تھا ، آپ نے جسے نہر میں دیکھا تھا وہ سود خور تھا"
        }
      ]
    }
  ],

  "namazSubHeading": [
    {
      "id": "1",
      "title": "نماز کی فضلیت",
      "button": "Read more"
    },
    {
      "id": "2",
      "title": "نماز نہ پڑھنے والو کا انجام",
      "button": "Read more"
    },
    {
      "id": "3",
      "title": "مرنے کے بعد لوگوں کی تمنائیں",
      "button": "Read more"
    },
    {
      "id": "4",
      "title": "صرف فرض نماز پڑھ لینا بھی کافی ہے",
      "button": "Read more"
    },
    {
      "id": "5",
      "title": "سنّت اور نفل کی فضلیت",
      "button": "Read more"
    },
    {
      "id": "6",
      "title": "دو نمازوں کو جمع کرنا",
      "button": "Read more"
    }
  ],

  "namazDetailPage": [
    {
      "id": "1",
      "content": [
        {
          "reference": "سوره الجاثية آیت نمبر 23",
          "translation": "کیا آپ نے اسے بھی دیکھا؟ جس نے اپنی خواہش نفس کو اپنا معبود بنا رکھا ہے"
        },
        {
          "reference": "صحیح مسلم 267-266-265 سنن ترمذی 1999-1998 سنن ابن ماجہ 59,1474 سنن ابو داود 4092",
          "translation": "آپ نے فرمایا :’’ جس کے دل میں ذرہ برابر تکبر ہو گا ، وہ جنت میں داخل نہ ہو گا ۔‘‘ ایک آدمی نے کہا : انسان چاہتا ہے کہ اس کے کپڑے اچھے ہوں اور اس کے جوتے اچھے ہوں ۔ آپ نے فرمایا :’’ اللہ خود جمیل ہے ، وہ جمال کو پسند فرماتا ہے ۔ تکبر ، حق کو قبول نہ کرنا اور لوگوں کو حقیر سمجھنا ہے ۔"
        },
        {
          "reference": "سوره الزاریات آیت نمبر 56",
          "translation": "میں نے جنات اور انسانوں کو محض اس لئے پیدا کیا ہے کہ وہ صرف میری عبادت کریں"
        },
        {
          "reference": "مسند احمد 1052",
          "translation": "سیدنا حنظلہ کاتب ؓ سے مروی ہے کہ رسول اللہ ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ‌ نے فرمایا: جس نے پانچ نمازوں کے رکوع، سجود اور اوقات کی اچھی طرح حفاظت کی اور یہ جان لیا کہ یہ اللہ تعالیٰ کی طرف سے حق ہیں، وہ جنت میں داخل ہو گا۔ ایک روایت میں ہے: اس کے لیے جنت واجب ہو جائے گی۔ اور ایک روایت میں ہے: وہ ان نمازوں کو اللہ تعالیٰ کا حق سمجھتا ہے، تو وہ آگ پر حرام ہو جائے گا۔"
        },
        {
          "reference": "مسند احمد 1082",
          "translation": "سیدنا کعب بن عجرہ ؓ سے مروی ہے، وہ کہتے ہیں: میں مسجد ِ نبوی میں بیٹھا ہوا تھا، ہم سات افراد اِس مسجد کی قبلہ والی دیوار کے ساتھ ٹیک لگا کر بیٹھے تھے، چار ہمارے غلام تھے اور ہم تین عرب تھے کہ رسول اللہ ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ‌ ہمارے پاس ‌ تشریف لائے، یہاں تک ہمارے پاس پہنچے، یہ نمازِ ظہر کا وقت تھا، آپ ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ‌ نے فرمایا: تمہیں کس چیز نے یہاں بٹھایا ہوا ہے؟ ہم نے کہا: اے اللہ کے رسول! ہم نماز کا انتظار کر رہے ہیں، آپ ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ‌ تھوڑی دیر کے لیے خاموش ہو گئے اور پھر اپنا سر مبارک اٹھایا اور فرمایا: کیا تم جانتے ہو کہ تمہارا ربّ کیا کہتا ہے؟ ہم نے کہا: جی اللہ اور اس کا رسول ہی بہتر جانتے ہیں۔ آپ ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ‌ نے فرمایا: بیشک تمہارا ربّ کہتا ہے: جس نے بروقت نماز ادا کی اور اس کی مکمل حفاظت کی اور اس کے حق کو ہلکا سمجھتے ہوئے اس کو ضائع نہیں کیا، پس اس کے لیے مجھ پر عہد ہے کہ میں اس کو جنت میں داخل کروں گا، اور جس نے نماز کو وقت پر ادا نہ کیا اور اس کی مکمل حفاظت نہ کی اور اس کے حق کو ہلکا سمجھتے ہوئے اس کو ضائع کر دیا، اس کے لیے میرا کوئی عہد نہیں ہے، اگر میں چاہوں تو اس کو عذاب دوں اور چاہوں تو معاف کر دوں۔"
        },
        {
          "reference": "سوره ابراھیم آیت نمبر 40",
          "translation": "اے میرے پالنے والے! مجھے نماز کا پابند رکھ اور میری اولاد سے بھی ، اے ہمارے رب میری دعا قبول فرما ۔"
        },
        {
          "reference": "سوره الأنعام آیات نمبر 163-162",
          "translation": "کہہ دو کہ : بیشک میری نماز ، میری عبادت اور میرا جینا مرنا سب کچھ اللہ کے لیے ہے جو تمام جہانوں کا پروردگار ہے ۔ اس کا کوئی شریک نہیں ہے ، اسی بات کا مجھے حکم دیا گیا ہے ، اور میں اس کے آگے سب سے پہلے سر جھکانے والا ہوں ۔"
        }
      ]
    },
    {
      "id": "2",
      "content": [
        {
          "reference": "سنن ابن ماجہ 1426-1425 مشکوٰۃ المصابیح 1330",
          "translation": "نبی ﷺ نے فرمایا :’’ قیامت کے دن بندے سے جس عمل کا سب سے پہلے حساب لیا جائے گا ، وہ اس کی ( فرض ) نماز ہے"
        },
        {
          "reference": "سورہ مائدہ آیت نمبر 55",
          "translation": "بے شک ( مددگار ) دوست تو اللہ اور اس کا رسول ( صلی اللہ علیہ وآلہ وسلم ) ہی ہے اور ( ساتھ ) وہ ایمان والے ہیں جو نماز قائم رکھتے ہیں اور زکوٰۃ ادا کرتے ہیں اور وہ ( اللہ کے حضور عاجزی سے ) جھکنے والے ہیں"
        },
        {
          "reference": "سوره مدثر آیت نمبر 43-41",
          "translation": "مجرموں کے بارے میں کہ تمہیں کس چیز نے دوزخ میں داخل کردیا ؟ وہ کہیں گے کہ : ہم نماز پڑھنے والوں میں سے نہیں تھے"
        },
        {
          "reference": "سوره یٰسین آیت نمبر 64-63",
          "translation": "یہی وہ دوزخ ہے جس کا تمہیں وعدہ دیا جاتا تھا ۔ اپنے کفر کا بدلہ پانے کے لئے آج اس میں داخل ہو جاؤ ۔"
        },
        {
          "reference": "سوره روم آیت نمبر 31",
          "translation": "( لوگو! ) اللہ تعالٰی کی طرف رجوع ہو کر اس سے ڈرتے رہو اور نماز قائم رکھو اور مشرکین میں سے نہ ہو جاؤ ۔"
        },
        {
          "reference": "صحیح مسلم 247-246 سنن ترمذی 2620-2618 سنن ابو داود 4678 سنن نسائی 465 سنن ابن ماجہ 1078",
          "translation": "ابوسفیان سے روایت ہے ، انہوں نے کہا : میں نے حضرت جابر رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا :’’ بے شک آدمی اور شرک و کفر کے درمیان ( فاصلہ مٹانے والا عمل ) نماز کا ترک ہے ۔‘‘"
        },
        {
          "reference": "سنن ترمذی 2621 سنن نسائی 464 سنن ابن ماجہ 1079",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہمارے اور منافقین کے درمیان نماز کا معاہدہ ہے ۱؎ تو جس نے نماز چھوڑ دی اس نے کفر کیا“۔"
        },
        {
          "reference": "سنن ترمذی 2622",
          "translation": "صحابہ کرام ( رضی الله عنہم ) نماز کے سوا کسی عمل کے چھوڑ دینے کو کفر نہیں سمجھتے تھے"
        },
        {
          "reference": "سنن ابو داود 495 مشکوٰۃ المصابیح 572",
          "translation": "عمرو بن العاص رضی اللہ عنہ ) سے بیان کرتے ہیں کہ رسول اللہ ﷺ نے فرمایا :’’ اپنے بچوں کو جب وہ سات سال کے ہو جائیں تو نماز کا حکم دو اور جب دس سال کے ہو جائیں ( اور نہ پڑھیں ) تو انہیں اس پر مارو اور ان کے بستر جدا جدا کر دو ۔‘"
        },
        {
          "reference": "مسند احمد 1090 مشکوٰۃ المصابیح 578",
          "translation": "سیدنا عبد اللہ بن عمرو بن عاص ؓ سے مروی ہے کہ نبی کریم ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم ‌ نے ایک دن نماز کا ذکر کیا اور فرمایا: جس نے نماز کی اچھی طرح حفاظت کی تو یہ اس کے لیے قیامت کے روز نور، دلیل اور نجات ہو گی اور جس نے اس کی پوری طرح حفاظت نہ کی تو یہ اس کے لیے قیامت کے دن نہ نور ہو گی، نہ دلیل اور نہ نجات اور ایسا آدمی قارون، فرعون، ہامان اور ابی بن خلف کے ساتھ ہو گا۔"
        },
        {
          "reference": "سنن ابن ماجہ 4034",
          "translation": "حضرت ابودرداء رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : مجھ سے میرے جگری دوست ( جانی محبوب ) ﷺ نے نصیحت کرتے ہوئے فرمایا :’’ اللہ کے ساتھ کسی چیز کو شریک نہ کرنا ، خواہ تجھے ٹکڑے ٹکڑے کر دیا جائے يا تجھے جلا دیا جائے ۔ اور فرض نماز جان بوجھ کر ترک نہ کرنا ۔ جس نے اسے عمداً ترک کیا ، اس سے ( اللہ کی حفاظت کا ) ذمہ جاتا رہا ۔ اور شراب نہ پینا کیونکہ وہ ہر برائی کی چابی ہے ۔‘‘"
        },
        {
          "reference": "سوره القلم آیت نمبر 43-42",
          "translation": "جس دن پنڈلی کھول دی جائے گی اور سجدے کے لئے بلائے جائیں گے تو ( سجدہ ) نہ کر سکیں گے ۔ نگاہیں نیچی ہوں گی ان پر ذلت و خواری چھا رہی ہوگی حالانکہ یہ سجدے کے لئے ( اس وقت بھی ) بلائے جاتے تھے جبکہ صحیح سالم تھے ۔"
        },
        {
          "reference": "صحیح بخاری 4919",
          "translation": "ہمارا رب قیامت کے دن اپنی پنڈلی کھولے گا اس وقت ہر مومن مرد اور ہر مومنہ عورت اس کے لیے سجدہ میں گر پڑیں گے ۔ صرف وہ باقی رہ جائیں گے جو دنیا میں دکھاوے اور ناموری کے لیے سجدہ کرتے تھے ۔ جب وہ سجدہ کرنا چاہیں گے تو ان کی پیٹھ تختہ ہو جائے گی اور وہ سجدہ کے لیے نہ مڑ سکیں گے"
        },
        {
          "reference": "سوره مريم آیت نمبر 59",
          "translation": "پھر ان کے بعد ایسے نا خلف پیدا ہوئے کہ انہوں نے نماز ضائع کر دی اور نفسانی خواہشوں کے پیچھے پڑ گئے سو ان کا نقصان ان کے آگے آئے گا ۔"
        }
      ]
    },
    {
      "id": "3",
      "content": [
        {
          "reference": "سورة الأنعام آیات نمبر 27",
          "translation": "اور کبھی تم دیکھو جب وہ آگ پر کھڑے کئے جائیں گے تو کہیں گے کاش کسی طرح ہم واپس بھیجے جائیں اور اپنے رب کی آیتیں نہ جھٹلائیں اور مسلمان ہو جائیں"
        },
        {
          "reference": "سوره الکہف آیت نمبر 42",
          "translation": "اے کاش! میں نے اپنے رب کا کسی کو شریک نہ کیا ہوتا"
        },
        {
          "reference": "سورۃ الحاقة آیت نمبر 25",
          "translation": "رہا وہ شخص جس کا اعمال نامہ اس کے بائیں ہاتھ میں دیا جائے گا ، تو وہ کہے گا کہ : اے کاش ! مجھے میرا اعمال نامہ دیا ہی نہ جاتا"
        },
        {
          "reference": "سوره فرقان آیت نمبر 29-28",
          "translation": "ہائے افسوس کاش کہ میں نے فلاں کو دوست نہ بنایا ہوتا ۔میرے پاس نصیحت آچکی تھی ، مگر اس ( دوست ) نے مجھے اس سے بھٹکا دیا ۔ اور شیطان تو ہے ہی ایسا کہ وقت پڑنے پر انسان کو بے کس چھوڑ جاتا ہے"
        },
        {
          "reference": "سوره فجر آیت نمبر 24",
          "translation": "وہ کہے گا کہ : کاش ! میں نے اپنی اس زندگی کے لیے کچھ آگے بھیج دیا ہوتا !"
        },
        {
          "reference": "سوره فرقان آیت نمبر 27",
          "translation": "اور اس دن ظالم شخص اپنے ہاتھوں کو چبا چبا کر کہے گا ہائے کاش کہ میں نے رسول اللہ ( ﷺ ) کی راہ اختیار کی ہوتی"
        },
        {
          "reference": "سوره احزاب آیت نمبر 66",
          "translation": "جس دن ان کے چہروں کو آگ میں الٹا پلٹا جائے گا ، وہ کہیں گے کہ : اے کاش ! ہم نے اللہ کی اطاعت کرلی ہوتی ، اور رسول کا کہنا مان لیا ہوتا !"
        },
        {
          "reference": "سوره النسا آیت نمبر 73",
          "translation": "اور اگر تمہیں اللہ کا فضل ملے تو ضرور کہے گویا تم میں اس میں کوئی دوستی نہ تھی اے کاش میں ان کے ساتھ ہوتا تو بڑی مراد پاتا"
        },
        {
          "reference": "سوره النبا آیت نمبر 40",
          "translation": "ہم نے تمہیں عنقریب آنے والے عذاب سے ڈرا دیا ( اور چوکنا کر دیا ) ہے جس دن انسان اپنے ہاتھوں کی کمائی کو دیکھ لے گا اور کافر کہے گا کہ کاش! میں مٹی ہو جاتا"
        },
        {
          "reference": "سوره الزخرف آیت نمبر 38",
          "translation": "یہاں تک کہ جب وہ کافر ہمارے پاس آئے گا تو(اپنے ساتھی شیطان سے )کہے گا: اے کاش! میرے اور تیرے درمیان مشرق و مغرب کے برابر دوری ہوجائے تو (تُو) کتنا ہی برا ساتھی ہے"
        },
        {
          "reference": "27سورۃ الحاقة آیت نمبر",
          "translation": "اے کاش ! کہ میری موت ہی پر میرا کام تمام ہوجاتا !"
        }
      ]
    },
    {
      "id": "4",
      "content": [
        {
          "reference": "صحیح بخاری 46,1397 صحیح مسلم 100,106",
          "translation": "ایک دیہاتی نبی کریم ﷺ کی خدمت میں آیا اور عرض کی کہ آپ مجھے کوئی ایسا کام بتلائیے جس پر اگر میں ہمیشگی کروں تو جنت میں داخل ہو جاؤں ۔ آپ نے فرمایا کہ اللہ کی عبادت کر ‘ اس کا کسی کو شریک نہ ٹھہرا ‘ فرض نماز قائم کر ‘ فرض زکوٰۃ دے اور رمضان کے روزے رکھ ۔ دیہاتی نے کہا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ‘ ان عملوں پر میں کوئی زیادتی نہیں کروں گا ۔ جب وہ پیٹھ موڑ کر جانے لگا تو نبی کریم ﷺ نے فرمایا کہ اگر کوئی ایسے شخص کو دیکھنا چاہے جو جنت والوں میں سے ہو تو وہ اس شخص کو دیکھ لے ۔"
        }
      ]
    },
    {
      "id": "5",
      "content": [
        {
          "reference": "سنن ابن ماجہ 1426 مشکوٰۃ المصابیح 1330",
          "translation": "حضرت ابوہریرہ ؓ بیان کرتے ہیں ، میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا :’’ بندے سے روز قیامت اس کے اعمال میں سے سب سے پہلے نماز کا حساب لیا جائے گا ، اگر وہ صحیح و درست ہوئی تو وہ فلاح و نجات پا گیا اور اگر وہ صحیح و درست نہ ہوئی تو پھر وہ ناکام و نا مراد ہو گا ، اگر اس کے فرائض میں کوئی کمی ہوئی تو رب تبارک و تعالی فرمائے گا : دیکھو ، کیا میرے بندے کے کچھ نوافل ہیں ، تو اس طرح فرائض کی کمی کو ان (نوافل) سے پورا کر دیا جائے گا ، پھر باقی اعمال کا حساب اسی طرح ہو گا ۔‘‘ اور ایک دوسری روایت میں ہے :’’ پھر زکوۃ کا حساب بھی اسی طرح ہو گا اور پھر باقی اعمال کا حساب بھی اسی (مذکور مثال کی) طرح ہو گا ۔‘‘"
        },
        {
          "reference": "صحیح مسلم 1694",
          "translation": "میں نے ام حبیبہ رضی اللہ عنہا سے سنا ، وہ کہتی تھیں : میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’ جس نے ایک دن اور رات میں بارہ رکعتیں ادا کیں اس کے لیے ان کے بدلے جنت میں ایک گھر بنا دیا جاتا ہے ۔‘‘"
        },
        {
          "reference": "صحیح بخاری 1180,1182 صحیح مسلم 1699",
          "translation": "خالد نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا ، میں نے حضرت عائشہ رضی اللہ عنہا سے رسول اللہ ﷺ کی نفل نماز کے بارے میں سوال کیا ؟ تو انھوں نے جواب دیا : آپ میرے گھر میں ظہر سے پہلے چار رکعات پڑھتے ، پھر ( گھر سے ) نکلتے اور لوگوں کو نماز پڑھاتے ، پھر گھر واپس آتے اور دو رکعتیں ادا فرماتے ۔ اور آپ لوگوں کو مغرب کی نماز پڑھاتے پھر گھر آتے اور دو رکعتیں نماز پڑھتے ، اور لوگوں کو عشاء کی نماز پڑھاتے اور میرے گھر آتے اور دو رکعتیں پڑھتے ، اور رات کو نو رکعتیں پڑھتے ان میں وتر شامل ہوتے ، اور طویل رات کھڑے ہو کر اور طویل رات بیٹھ کر نماز ادا کرتے اور جب کھڑے ہو کر قراءت کرتے تو رکوع اور سجدہ بھی کھڑے ہو کر کرتے اور جب بیٹھ کر قراءت کرتے تو رکوع اور سجدہ بھی بیٹھے بیٹھے کرتے اور جب فجر طلوع ہوتی تو دو رکعتیں پڑھتے ۔"
        },
        {
          "reference": "وتر کی فضلیت"
        },
        {
          "reference": "سنن ترمذی 453",
          "translation": "وتر تمہاری فرض نماز کی طرح لازمی نہیں ہے ۱؎، بلکہ رسول اللہ صلی اللہ علیہ وسلم نے اسے سنت قرار دیا اور فرمایا: اللہ وتر ( طاق ) ۲؎ ہے اور وتر کو پسند کرتا ہے، اے اہل قرآن! ۳؎ تم وتر پڑھا کرو۔"
        },
        {
          "reference": "سنن ترمذی 465 سنن ابن ماجہ 1188 سنن ابو داود 1431",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو وتر پڑھے بغیر سو جائے، یا اسے پڑھنا بھول جائے تو جب یاد آئے یا جاگے پڑھ لے“۔"
        },
        {
          "reference": "سنن ترمذی 452",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم ( حجرے سے نکل کر ) ہمارے پاس آئے اور فرمایا: ”اللہ تعالیٰ نے تمہارے لیے ایک ایسی نماز کا اضافہ کیا ہے ۱؎، جو تمہارے لیے سرخ اونٹوں سے بہتر ہے، وہ وتر ہے، اللہ نے اس کا وقت تمہارے لیے نماز عشاء سے لے کر فجر کے طلوع ہونے تک رکھا ہے“۔"
        },
        {
          "reference": "وتر کے بعد دو نفل ادا کرنے کی فضلیت"
        },
        {
          "reference": "مشکوٰۃالمصابیح 1286",
          "translation": "حضرت ثوبان ؓ نبی ﷺ سے روایت کرتے ہیں ۔ آپ ﷺ نے فرمایا :’’ یہ بیداری ایک مشکل اور گراں کام ہے ، جب تم میں سے کوئی شخص وتر پڑھ لے تو وہ دو رکعت ادا کرے ، اگر وہ رات کے وقت بیدار ہو جائے (تو پھر وہ نماز تہجد پڑھے) ورنہ وہ دو رکعتیں اس کے لیے کافی ہوں گی"
        }
      ]
    },
    {
      "id": "6",
      "content": [
        {
          "reference": "صحیح بخاری 543,562 صحیح مسلم 1637-1628 سنن ترمذی 187",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے بغیر خوف اور بارش ۱؎ کے مدینے میں ظہر اور عصر کو ایک ساتھ اور مغرب اور عشاء کو ایک ساتھ جمع کیا ۲؎۔ ابن عباس رضی الله عنہما سے پوچھا گیا کہ نبی اکرم صلی اللہ علیہ وسلم کا اس سے کیا منشأ تھی؟ کہا: آپ صلی اللہ علیہ وسلم کا منشأ یہ تھی کہ آپ اپنی امت کو کسی پریشانی میں نہ ڈالیں۔"
        },
        {
          "reference": "صحیح بخاری 1111 صحیح مسلم1621.1625,1627 سنن ترمذی 553 سنن ابو داود 1220 سنن ابن ماجہ 1070",
          "translation": "نبی اکرم صلی اللہ علیہ وسلم غزوہ تبوک میں جب سورج ڈھلنے سے پہلے کوچ کرتے تو ظہر کو مؤخر کرتے یہاں تک کہ اسے عصر کے ساتھ ملا دیتے اور دونوں کو ایک ساتھ پڑھتے، اور جب سورج ڈھلنے کے بعد کوچ کرتے تو عصر کو پہلے کر کے ظہر سے ملا دیتے اور ظہر اور عصر کو ایک ساتھ پڑھتے پھر روانہ ہوتے۔ اور جب مغرب سے پہلے کوچ فرماتے تو مغرب کو مؤخر کرتے یہاں تک کہ اسے عشاء کے ساتھ ملا کر پڑھتے، اور جب مغرب کے بعد کوچ فرماتے تو عشاء کو پہلے کر کے مغرب کے ساتھ ملا کر پڑھتے۔"
        },
        {
          "reference": "میری زندگی کا مقصد ترے دین کی سرفرازی",
          "translation": "میں ایسے لیے مسلمان میں ایسے لیے نمازی"
        }
      ]
    }
  ],

  "duaSubHeading": [
    {
      "id": 1,
      "title": "اللّه کے ذکر کی فضلیت",
      "button": "Read more"
    },
    {
      "id": 2,
      "title": "بہترین ذکر",
      "button": "Read more"
    },
    {
      "id": 3,
      "title": "دنیا ایک امتحان کی جگہ ہے",
      "button": "Read more"
    },
    {
      "id": 4,
      "title": "دعا کی اہمیت",
      "button": "Read more"
    },
    {
      "id": 5,
      "title": "اسم اعظم",
      "button": "Read more"
    },
    {
      "id": 6,
      "title": "درود شریف",
      "button": "Read more"
    },
    {
      "id": 7,
      "title": "جنت میں جانے کی دعا",
      "button": "Read more"
    },
    {
      "id": 8,
      "title": "جہنم کے عذاب سے بچنے کی دعا",
      "button": "Read more"
    },
    {
      "id": 9,
      "title": "جب محمد صلی اللہ علیہ وسلم نے خواب میں اللہ کو دیکھا اور یہ دعا کی۔",
      "button": "Read more"
    },
    {
      "id": 10,
      "title": "والرین کی بخشش کی دعا",
      "button": "Read more"
    },
    {
      "id": 11,
      "title": "مشکل اور پریشانی سے نجات کی دعا",
      "button": "Read more"
    },
    {
      "id": 12,
      "title": "رزق میں برکت کی دعا",
      "button": "Read more"
    },
    {
      "id": 13,
      "title": "علم میں اضافے کی دعا",
      "button": "Read more"
    },
    {
      "id": 14,
      "title": "قبرستان جانے کی دعا",
      "button": "Read more"
    },
    {
      "id": 15,
      "title": "گھر سے نکلنے یا سفر کرنے کی دعا",
      "button": "Read more"
    },
    {
      "id": 16,
      "title": "میت کی بخشش کی دعا",
      "button": "Read more"
    },
    {
      "id": 17,
      "title": "ناگھانی افت سے بچنے کی دعا",
      "button": "Read more"
    },
    {
      "id": 18,
      "title": "اذان کے بعد کی دعا",
      "button": "Read more"
    }
  ],

  "duaDetailPage": [
    {
      "id": "1",
      "content": [
        {
          "reference": "سورة الرعد آیت نمبر 28",
          "translation": "جو لوگ ایمان لائے ان کے دل اللہ کے ذکر سے اطمینان حاصل کرتے ہیں ۔ یاد رکھو اللہ کے ذکر سے ہی دلوں کو تسلی حاصل ہوتی ہے ۔"
        },
        {
          "reference": "سورة آل عمران آیت نمبر 41",
          "translation": ".اپنے رب کا ذکر کثرت سے کر اور صبح شام اسی کی تسبیح بیان کرتا رہ"
        },
        {
          "reference": "سورہ الحجر آیت نمبر 99",
          "translation": "اور اپنے رب کی عبادت کرتے رہیں یہاں تک کہ آپ کو موت آجائے"
        },
        {
          "reference": "صحیح بخاری 6407، صحیح مسلم 1823",
          "translation": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ”اس شخص کی مثال جو اپنے رب کو یاد کرتا ہے اور اس کی مثال جو اپنے رب کو یاد نہیں کرتا زندہ اور مردہ جیسی ہے۔"
        },
        {
          "reference": "سنن ابن ماجہ 3792",
          "translation": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، نبی ﷺ نے فرمایا :’’ اللہ تعالیٰ فرماتا ہے : میں اپنے بندے کے ساتھ ہوتا ہوں ، جب وہ میرا ذکر کرتا ہے اور اس کے ہونٹ میرے ذکر کے ساتھ حرکت کرتے ہیں"
        },
        {
          "reference": "سنن ترمذی 3375",
          "translation": "ایک آدمی نے کہا: اللہ کے رسول! اسلام کے احکام و قوانین تو میرے لیے بہت ہیں، کچھ تھوڑی سی چیزیں مجھے بتا دیجئیے جن پر میں ( مضبوطی ) سے جما رہوں، آپ نے فرمایا: ”تمہاری زبان ہر وقت اللہ کی یاد اور ذکر سے تر رہے"
        },
        {
          "reference": "صحیح بخاری 43",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم ( ایک دن ) ان کے پاس آئے، اس وقت ایک عورت میرے پاس بیٹھی تھی، آپ نے دریافت کیا یہ کون ہے؟ میں نے عرض کیا، فلاں عورت اور اس کی نماز ( کے اشتیاق اور پابندی ) کا ذکر کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا ٹھہر جاؤ ( سن لو کہ ) تم پر اتنا ہی عمل واجب ہے جتنے عمل کی تمہارے اندر طاقت ہے۔ اللہ کی قسم! ( ثواب دینے سے ) اللہ نہیں اکتاتا، مگر تم ( عمل کرتے کرتے ) اکتا جاؤ گے، اور اللہ کو دین ( کا ) وہی عمل زیادہ پسند ہے جس کی ہمیشہ پابندی کی جا سکے۔ ( اور انسان بغیر اکتائے اسے انجام دے ) ۔"
        }
      ]
    },
    {
      "id": "2",
      "content": [
        {
          "reference": "صحیح مسلم 1358",
          "arabic": "اللهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَأَصِيلًا",
          "translation": "حضرت ابن عمر رضی اللہ عنہما سے روایت ہے ، انھوں نے کہا : ایک دفعہ ہم رسول اللہ ﷺ کے ساتھ نماز پڑھ رہے تھے کہ لوگوں میں سے ایک آدمی نے کہا : اللہ اکبر کبیرا ، والحمد للہ کثیرا ، وسبحان اللہ بکرۃ واصیلا اللہ سب سے بڑا ہے بہت بڑا ، اور تمام تعریف اللہ کے لیے ہے بہت زیادہ اور تسبیح اللہ ہی کے لیے ہے ، صبح و شام ۔‘‘ رسول اللہ ﷺ نے پوچھا :’’ فلاں فلاں کلمہ کہنے والا کون ہے ؟‘‘ لوگوں میں سے ایک آدمی نے کہا : اللہ کے رسول ! میں ہوں آپ نے فرمایا :’’ مجھے ان پر بہت حیرت ہوئی ، ان کے لیے آسمان کے دروازے کھول دیے گئے ۔‘‘ ابن عمر رضی اللہ عنہما نے کہا :’’ میں نے جب سے آپ سے یہ بات سنی ، اس کے بعد سے ان کلمات کو کبھی ترک نہیں کیا ۔"
        },
        {
          "reference": "سبحان اللّه ۔الحمداللہ ۔اللّه اکبر کی فضیلت"
        },
        {
          "reference": "  مسند احمد 10723، 1865،1864,سنن ابوداؤد 5065،سنن ترمذی3410،سنن ابن ماجہ926",
          "translation": "حضرت عبداللہ بن عمرو رضی اللہ عنہما سے روایت ہے ، رسول اللہ ﷺ نے فرمایا :’’ دو چیزوں پر جو شخص بھی پابندی سے عمل کرتا ہے جنت میں داخل ہو جاتا ہے اور وہ چیزیں ( کام ) آسان ہیں ( لیکن ) ان پر عمل کرنے والے کم ہیں ۔ ہر نماز کے بعد دس دفعہ ( سبحان اللہ ) کہے ، دس دفعہ ( اللہ اکبر ) کہے اور دس دفعہ ( الحمدللہ ) کہے ۔‘‘ صحابی کہتے ہیں : میں نے دیکھا کہ رسول اللہ ﷺ نے ہاتھ سے اس عدد کا اشارہ کیا اور فرمایا :’’ یہ زبان سے کہنے میں ( پانچوں نمازوں کے حساب سے ) ایک سو بچاس ( کلمات ) ہیں اور ( قیامت کے دن نیکیوں کے ) ترازو میں ( ایک نیکی کا اجر دس گنا کے اعتبار سے ) ایک ہزار پانچ سو ہوں گے ۔ اور جب اپنے بستر پر جائے تو ( سبحان اللہ ) اور ( الحمدللہ ) اور ( اللہ اکبر ) ( سب ملا کر کل ) سو مرتبہ کہہ لے ، یہ زبان سے کہنے میں سو ہیں اور ترازو میں ( دس گنا کے حساب سے ) ایک ہزار ۔ بھلا تم میں سے کون ہے جو دن میں ڈھائی ہزار گناہ کرتا ہو ؟‘‘ ( جب کہ نیکیاں وہ ڈھائی ہزار کماتا ہو ) صحابہ نے عرض کیا : انسان پابندی سے یہ دونوں عمل کیوں نہیں کر سکتا ؟ فرمایا :’’ ایک آدمی نماز پڑھ رہا ہوتا ہے کہ شیطان آ جاتا ہے اور اسے کہتا ہے : فلاں بات یاد کر ، فلاں بات یاد کر حتی کہ بندہ ( نماز سے ) غافل ہو جاتا ہے اور جب بندہ بستر پر جاتا ہے تو شیطان آ جاتا ہے اور اسے سلانے لگتا ہے حتی کہ آدمی کو نیند آ جاتی ہے ۔‘‘"
        },
        {
          "reference": "سنن ابن ماجہ 1356 سنن ابوداؤد 766",
          "arabic": "دس بار ( الله اكبر ) دس بار ( اَلْحَمْدُلِلَّہِ ) دس بار ( سُبْحَانَ اللہِ ) اور دس بار ( اَسْتَغْفِرُاللہ ) کہتے تھے ۔ پھر فرماتے : ( اللَّهُمَّ اغْفِرْلِى وَاهْدِنِى وَارْزُقْنِى وَعَافِنِى )",
          "translation": "نبی ﷺ رات کے قیام ( تہجد ) کی ابتدا کس چیز سے کرتے تھے ؟ انہوں نے کہا : تم نے مجھ سے وہ بات پوچھی ہے جو تم سے پہلے کسی نے نہیں پوچھی ، آپ دس بار ( اللہُ أَکْبَرُ ) دس بار ( اَلْحَمْدُلِلَّہِ ) دس بار ( سُبْحَانَ اللہِ ) اور دس بار ( اَسْتَغْفِرُاللہ ) کہتے تھے ۔ پھر فرماتے : ( اللَّهُمَّ اغْفِرْلِى وَاهْدِنِى وَارْزُقْنِى وَعَافِنِى ) ’’ اے اللہ ! مجھے بخش دے ، مجھے ہدایت دے ، مجھے رزق عنایت فرما اور مجھے آرام و راحت سے بہرہ ور فرما ۔‘‘ اور آپ قیامت کے دن ( میدان حشر میں ) کھڑے ہونے کی تنگی سے اللہ کی پناہ چاہتے تھے ۔"
        },
        {
          "reference": " صحیح مسلم6842, 6844، سنن ابو داود 5077، سنن ابن ماجہ 3867 , صحیح بخاری  6403,1154",
          "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "translation": "ایک اکیلے اللہ کے سوا کوئی معبود نہیں ۔ اس کا کوئی ساجھی نہیں ، ملک اسی کا ہے ‘ تعریف اسی کی ہے اور وہ ہر شے پر خوب قادر ہے"
        },
        {
          "reference": "صحیح بخاری 6409، صحیح مسلم 6862",
          "arabic": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "translation": "گناہوں سے بچنے اور نیکی کی قوت صرف اور صرف اللہ سے ملتی ہے آپ ﷺ نے فرمایا :’’ عبداللہ بن قیس ! کیا میں تمہیں جنت کے خزانوں میں سے ایک خزانے کا پتہ نہ بتاؤں ؟‘‘ میں نے کہا : کیوں نہیں ، اللہ کے رسول ! آپ نے فرمایا :’’ لا حول ولا قوة الا بالله ‘‘ کہا کرو ۔‘‘"
        },
        {
          "reference": "صحیح بخاری 6682، صحیح مسلم 6846، سنن ترمذی 3467، سنن ابن ماجہ 3806، مسند احمد 5463، مشکوٰۃ المصابیح 2298",
          "arabic": "سُبحَانَ اللَّهِ وَ بِحَمْدِهِ ، سُبحَانَ اللَّهِ الْعَظِيمِ",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ”دو کلمے جو زبان پر ہلکے ہیں لیکن ترازو پر ( آخرت میں ) بھاری ہیں اور اللہ رحمن کے یہاں پسندیدہ ہیں وہ یہ ہیں سبحان الله وبحمده،‏‏‏‏ سبحان الله العظيم‏"
        },
        {
          "reference": "صحیح مسلم 6847، سنن ترمذی 3597، 3462، مشکوٰۃ المصابیح 2295",
          "arabic": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ",
          "translation": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ ﷺ نے فرمایا :’’ یہ بات کہ میں ’’ سبحان الله والحمدلله ولا اله الا لله واللہ اکبر کہوں ، مجھے ان تمام چیزوں سے زیادہ محبوب ہے جن پر سورج طلوع ہوتا ہے ۔‘‘"
        },
        {
          "reference": "سنن ترمذی 3433",
          "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی مجلس میں بیٹھے اور اس سے بہت سی لغو اور بیہودہ باتیں ہو جائیں، اور وہ اپنی مجلس سے اٹھ جانے سے پہلے پڑھ لے: سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ”پاک ہے تو اے اللہ! اور سب تعریف تیرے لیے ہے، میں گواہی دیتا ہوں کہ تیرے سوا کوئی معبود برحق نہیں، میں تجھ سے مغفرت چاہتا ہوں اور تیری طرف رجوع کرتا ہوں“، تو اس کی اس مجلس میں اس سے ہونے والی لغزشیں معاف کر دی جاتی ہیں“۔"
        },
        {
          "reference": "صحیح بخاری 6306",
          "arabic": "اللَّهُمَّ أَنْتَ رَبِّي ، لَا إِلَهَ إِلَّا أَنْتَ ، خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
          "translation": "اے اللہ! تو میرا رب ہے، تیرے سوا کوئی معبود نہیں۔ تو نے ہی مجھے پیدا کیا اور میں تیرا ہی بندہ ہوں میں اپنی طاقت کے مطابق تجھ سے کئے ہوئے عہد اور وعدہ پر قائم ہوں۔ ان بری حرکتوں کے عذاب سے جو میں نے کی ہیں تیری پناہ مانگتا ہوں مجھ پر نعمتیں تیری ہیں اس کا اقرار کرتا ہوں۔ میری مغفرت کر دے کہ تیرے سوا اور کوئی بھی گناہ نہیں معاف کرتا۔“ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے اس دعا کے الفاظ پر یقین رکھتے ہوئے دل سے ان کو کہہ لیا اور اسی دن اس کا انتقال ہو گیا شام ہونے سے پہلے، تو وہ جنتی ہے اور جس نے اس دعا کے الفاظ پر یقین رکھتے ہوئے رات میں ان کو پڑھ لیا اور پھر اس کا صبح ہونے سے پہلے انتقال ہو گیا تو وہ جنتی ہے"
        },
        {
          "reference": "صحیح بخاری 1154,سنن ابن ماجہ 3878,سنن ترمذی 3414",
          "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، ‏‏‏‏‏‏وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب کوئی نیند سے جاگے پھر کہے لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وسبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ۱؎، پھر کہے رب اغفر لي ”اے میرے رب ہمیں بخش دے“، یا آپ نے کہا: پھر وہ دعا کرے تو اس کی دعا قبول کی جائے گی، پھر اگر اس نے ہمت کی اور وضو کیا پھر نماز پڑھی تو اس کی نماز مقبول ہو گی“۔"
        }
      ]
    },
    {
      "id": "3",
      "content": [
        {
          "reference": "سورة الأعلى آیت نمبر 19-16",
          "translation": "لیکن تم تو دنیا کی زندگی کو ترجیح دیتے ہو اور آخرت بہت بہتر اور بہت بقا والی ہے ۔یہ باتیں پہلی کتابوں میں بھی ہیں ۔ ( یعنی ) ابراہیم اور موسیٰ کی کتابوں میں ."
        },
        {
          "reference": "سورة البقرة آیت نمبر 155",
          "translation": "اور ہم کسی نہ کسی طرح تمہاری آزمائش ضرور کریں گے ، دشمن کے ڈر سے ، بھوک پیاس سے ، مال و جان اور پھلوں کی کمی سے اور ان صبر کرنے والوں کو خوشخبری دے دیجئے ۔"
        },
        {
          "reference": "سورة الحديد آیت نمبر 23-22",
          "translation": "نہ کوئی مصیبت دنیا میں آتی ہے نہ ( خاص ) تمہاری جانوں میں مگر اس سے پہلے کہ ہم اس کو پیدا کریں وہ ایک خاص کتاب میں لکھی ہوئی ہے یہ ( کام ) اللہ تعالٰی پر ( بالکل ) آسان ہے ۔تاکہ تم اپنے سے فوت شدہ کسی چیز پر رنجیدہ نہ ہو جایا کرو اور نہ عطا کردہ چیز پر اترا جاؤ اور اترانے والے شیخی خوروں کو اللہ پسند نہیں فرماتا ۔"
        }
      ]
    },
    {
      "id": "4",
      "content": [
        {
          "reference": "صحیح مسلم 6774,مشکوٰۃ المصابیح5298",
          "translation": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ ﷺ نے فرمایا :’’ طاقتور مومن اللہ کے نزدیک کمزور مومن کی نسبت بہتر اور زیادہ محبوب ہے ، جبکہ خیر دونوں میں ( موجود ) ہے ۔ جس چیز سے تمہیں ( حقیقی ) نفع پہنچے اس میں حرص کرو اور اللہ سے مدد مانگو اور کمزور نہ پڑو ( مایوس ہو کر نہ بیٹھ ) جاؤ ، اگر تمہیں کوئی ( نقصان ) پہنچے تو یہ نہ کہو : کاش ! میں ( اس طرح ) کرتا تو ایسا ایسا ہوتا ، بلکہ یہ کہو : ( یہ ) اللہ کی تقدیر ہے ، وہ جو چاہتا ہے کرتا ہے ، اس لیے کہ ( حسرت کرتے ہوئے ) کاش ( کہنا ) شیطان کے عمل ( کے دروازے ) کو کھول دیتا ہے ۔‘‘"
        },
        {
          "reference": "صحیح مسلم 1772,صحیح بخاری 1145",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ہمارا پروردگار بلند برکت والا ہے ہر رات کو اس وقت آسمان دنیا پر آتا ہے جب رات کا آخری تہائی حصہ رہ جاتا ہے۔ وہ کہتا ہے کوئی مجھ سے دعا کرنے والا ہے کہ میں اس کی دعا قبول کروں، کوئی مجھ سے مانگنے والا ہے کہ میں اسے دوں کوئی مجھ سے بخشش طلب کرنے والا ہے کہ میں اس کو بخش دوں۔"
        },
        {
          "reference": "سنن ترمذی2969،سنن ابن ماجہ3828,سنن ابوداؤد 1479",
          "translation": "حضرت نعمان بن بشیر رضی اللہ عنہما سے روایت ہے ، رسول اللہ ﷺ نے فرمایا :’’ دعا ہی عبادت ہے ۔‘‘ پھر نبی ﷺ نے یہ آیت پڑھی : ﴿ وَقَالَ رَبُّکُمُ ادْعُوْنِیۡ اسْتَجِبْ لَکُمْ ﴾ ’’ اور تمہارے رب نے فرمایا : مجھے پکارو ، میں تمہاری پکار قبول کروں گا ۔‘‘"
        },
        {
          "reference": "صحیح مسلم 6936",
          "translation": "ابوادریس خولانی نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی ﷺ سے روایت کی کہ آپ نے فرمایا :’’ جب تک کوئی بندہ گناہ یا قطع رحمی کی دعا نہ کرے اور قبولیت کے معاملے میں جلد بازی نہ کرے ، اس کی دعا قبول ہوتی رہتی ہے ۔‘‘ عرض کی گئی : اللہ کے رسول ! جلد بازی کرنا کیا ہے ؟ آپ ﷺ نے فرمایا :’’ وہ کہے : میں نے دعا کی اور میں نے دعا کی اور مجھے نظر نہیں آتا کہ وہ میرے حق میں قبول کرے گا ، پھر اس مرحلے میں ( مایوس ہو کر ) تھک جائے اور دعا کرنا چھوڑ دے ۔‘‘"
        },
        {
          "reference": "سنن ترمذی2516,مشکوٰۃ المصابیح 5302",
          "translation": "میں ایک دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سواری پر پیچھے تھا، آپ نے فرمایا: ”اے لڑکے! بیشک میں تمہیں چند اہم باتیں بتلا رہا ہوں: تم اللہ کے احکام کی حفاظت کرو، وہ تمہاری حفاظت فرمائے گا، تو اللہ کے حقوق کا خیال رکھو اسے تم اپنے سامنے پاؤ گے، جب تم کوئی چیز مانگو تو صرف اللہ سے مانگو، جب تو مدد چاہو تو صرف اللہ سے مدد طلب کرو، اور یہ بات جان لو کہ اگر ساری امت بھی جمع ہو کر تمہیں کچھ نفع پہنچانا چاہے تو وہ تمہیں اس سے زیادہ کچھ بھی نفع نہیں پہنچا سکتی جو اللہ نے تمہارے لیے لکھ دیا ہے، اور اگر وہ تمہیں کچھ نقصان پہنچانے کے لیے جمع ہو جائے تو اس سے زیادہ کچھ نقصان نہیں پہنچا سکتی جو اللہ نے تمہارے لیے لکھ دیا ہے، قلم اٹھا لیے گئے اور ( تقدیر کے ) صحیفے خشک ہو گئے ہیں“"
        },
        {
          "reference": "مشکوٰۃ المصابیح 2259",
          "translation": "حضرت ابوسعید خدری ؓ سے روایت ہے کہ نبی ﷺ نے فرمایا :’’ جب کوئی مسلمان کوئی ایسی دعا کرتا ہے جس میں گناہ اور قطع رحمی نہ ہو تو اللہ اس وجہ سے تین چیزوں میں سے کوئی ایک اسے عطا فرما دیتا ہے : یا تو اس کی دعا فوراً قبول فرما لیتا ہے یا اسے اس کے لیے آخرت میں ذخیرہ کر لیتا ہے یا پھر اس کی مثل تکلیف اس سے دور فرما دیتا ہے ۔ صحابہ نے عرض کیا ، تب تو ہم زیادہ دعائیں کریں گے ، آپ ﷺ نے فرمایا :’’ اللہ (دعائیں قبول کرنے میں) بہت زیادہ ہے ۔‘‘"
        },
        {
          "reference": "سنن ابو داود 521,سنن ترمذی212,مشکوٰۃ المصابیح 671",
          "translation": "رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”اذان اور اقامت کے درمیان کی دعا رد نہیں کی جاتی“۔"
        },
        {
          "reference": "مشکوٰۃ المصابیح 930، سنن نسائی 1285، سنن ابوداؤد 1481، سنن ترمذی 3476",
          "translation": "حضرت فضالہ بن عبید ؓ بیان کرتے ہیں ، رسول اللہ ﷺ تشریف فرما تھے تو ایک آدمی آیا ، اس نے نماز پڑھی اور دعا کی : اے اللہ ! مجھے بخش دے اور مجھ پر رحم فرما ، رسول اللہ ﷺ نے فرمایا :’’ نمازی شخص ! تم نے جلد بازی کی ، جب تم نماز پڑھ کر (تشہد کے لیے) بیٹھو تو اللہ کی ، اس کی شان کے لائق ، حمد بیان کرو ، مجھ پر درود بھیجو ، پھر اللہ تعالیٰ سے دعا کرو ۔‘‘ راوی بیان کرتے ہیں ، پھر اس کے بعد ایک اور آدمی نے نماز پڑھی تو اس نے اللہ کی حمد بیان کی ، نبی پر درود بھیجا تو نبی ﷺ نے اسے فرمایا :’’ نمازی شخص ! دعا کرو ، تمہاری دعا قبول ہو گی ۔‘‘ ترمذی ۔ ابوداؤد اور نسائی نے بھی اسی طرح روایت کیا ہے ۔ ۔"
        }
      ]
    },
    {
      "id": "5",
      "content": [
        {
          "reference": "2سنن ابوداؤد 1496 سورة البقرة آي 163، سورة آل عمران الم 1 و 2",
          "translation": "شہر بن حوشب حضرت اسماء بنت یزید‬ رضی اللہ عنہا سے روایت کرتے ہیں کہ نبی ﷺ نے فرمایا: ”اللہ کا اسم اعظم ان دو آیتوں میں ہے : ( وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لَا إِلَهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ ) اور سورہ آل عمران کی ابتدائی آیت میں ( الم اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ )"
        },
        {
          "reference": "سورة الصافات آية نمبر 180-182",
          "arabic": " سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ وَسَلَـٰمٌ عَلَى ٱلْمُرْسَلِينَ وَٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
          "translation": "پاک ہے آپ کا رب جو بہت بڑی عزت والا ہے ہر اس چیز سے ( جو مشرک ) بیان کرتے ہیں ۔ یغمبروں پر سلام ہے ۔ ور سب طرح کی تعریف اللہ کے لئے ہے جو سارے جہان کا رب ہے"
        },
        {
          "reference": "سورة الحشر آية نمبر 22-24",
          "arabic": "هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ۖ عَـٰلِمُ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ ۖ هُوَ ٱلرَّحْمَـٰنُ ٱلرَّحِيمُ هُوَ ٱللَّهُ ٱلَّذِىلَآ إِلَـٰهَ إِلَّا هُوَ ٱلْمَلِكُ ٱلْقُدُّوسُ ٱلسَّلَـٰمُ ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ ٱلْعَزِيزُ ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ ۚ سُبْحَـٰنَ ٱللَّهِ  عَمَّا يُشْرِكُونَ هُوَ ٱللَّهُ ٱلْخَـٰلِقُ ٱلْبَارِئُ ٱلْمُصَوِّرُ ۖ لَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ ۚ يُسَبِّحُ لَهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
          "translation": "وہی اللہ ہے جس کے سوا کوئی معبود نہیں چھپے کھلے کا جاننے والا مہربان اور رحم کرنے والا ۔ وہی اللہ ہے جس کے سوا کوئی معبود نہیں بادشاہ نہایت پاک سب عیبوں سے صاف امن دینے والا نگہبان غالب زورآور اور بڑائی والا پاک ہے اللہ ان چیزوں سے جنہیں یہ اس کا شریک بناتے ہیں ۔ وہی اللہ ہے پیدا کرنے والا وجود بخشنے والا صورت بنانے والا اسی کے لئے ( نہایت ) اچھے نام ہیں ہرچیز خواہ وہ آسمانوں میں ہو خواہ زمین میں ہو اس کی پاکی بیان کرتی ہے اور وہی غالب حکمت والا ہے ۔"
        },
        {
          "reference": "سنن ابوداؤد 1493، سنن ترمذی 3475، سنن ابن ماجہ 3857",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
          "translation": "عبداللہ بن بریدہ سے روایت ہے کہ ان کے والد کا بیان ہے کہ رسول اللہ ﷺ نے ایک شخص کو دعا کرتے سنا وہ کہہ رہا تھا : ( اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ) ’’ اے اللہ ! میں تجھ سے سوال کرتا ہوں اس بنا پر کہ میں گواہی دیتا ہوں کہ تو ہی اللہ ہے ۔ تیرے سوا اور کوئی معبود نہیں ۔ تو اکیلا ہے ، بے نیاز ہے جس نے نہ جنا اور نہ جنا ہی گیا اور کوئی بھی اس کی برابری کرنے والا نہیں ۔‘‘ تو آپ ﷺ نے فرمایا :’’ تو نے اللہ سے اس کے اس نام سے سوال کیا ہے کہ جب اس سے اس نام سے مانگا جائے تو عنایت فرماتا ہے ، دعا کی جائے تو قبول کرتا ہے ۔‘‘"
        },
        {
          "reference": "سنن نسائی 1301, سنن ابوداؤد 1495، سنن ترمذی 3544، سنن ابن ماجہ 3858",
          "arabic": "( اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ ، لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ ، يَا ذَالْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ )’’",
          "translation": "حضرت انس رضی اللہ عنہ سے مروی ہے کہ وہ رسول اللہ ﷺ کے پاس بیٹھے ہوئے تھے اور ایک آدمی نماز پڑھ رہا تھا ۔ اس نے دعا کی : ( اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ ، لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ ، يَا ذَالْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ )’’ اے اللہ ! میں تجھ سے سوال کرتا ہوں اس لیے کہ تیری ہی تعریف ہے ، تیرے سوا کوئی معبود نہیں ، تو بے انتہا احسان کرنے والا ہے ، آسمان و زمین کو بے مادہ و بے نمونہ پیدا کرنے والا ہے ۔ اے جلال و اکرام والے ! اے زندہ ! اے نگرانی کرنے والے ! ‘‘ تو نبی ﷺ نے فرمایا :’’ تحقیق اس نے اللہ سے اس کے اس عظیم نام کے واسطے سے دعا کی ہے جس سے دعا کی جائے تو وہ قبول کرتا ہے ، مانگا جائے تو دیتا ہے ۔‘‘"
        },
        {
          "reference": "سنن ابوداؤد 985",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ الْأَحَدُ الصَّمَدُ الَّذِي   لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ، أَنْ تَغْفِرَلِي ذُنُوبِي ، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "translation": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ، أَنْ تَغْفِرَلِي ذُنُوبِي ، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ) آپ ﷺ نے فرمایا :’’ اسے بخش دیا گیا ، اسے بخش دیا گیا ۔‘‘ تین بار فرمایا ۔ ( دعا کا ترجمہ ہے : ) میں تجھ سے سوال کرتا ہوں اے اللہ ! اکیلے ، بے نیاز ، نہ جس نے جنا نہ جنا گیا ، اور کوئی اس کے برابر نہیں ! یہ کہ میرے گناہ معاف فرما دے ۔ بے شک تو بہت ہی بخشنے والا رحم کرنے والا ہے ۔‘‘"
        },
        {
          "reference": "سورۃ الفاتحہ کی فضیلت"
        },
        {
          "reference": "سورہ الحجر آیت نمبر 87",
          "translation": "ہم نے آپ کو سات آیتیں دے رکھی ہیں کہ وہ دہرائی جاتی ہیں اور عظیم قرآن بھی دے رکھا ہے۔"
        },
        {
          "reference": "صحیح بخاری 5007",
          "translation": "ضرت ابوہریرہ ؓ بیان کرتےہیں ، رسول اللہ ﷺ نے ابی بن کعب ؓ سے فرمایا :’’ تم نماز میں کیسے قراءت کرتے ہو ؟‘‘ انہوں نے سورۂ فاتحہ پڑھی تو رسول اللہ ﷺ نے فرمایا :’’ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! اس جیسی سورت تورات و انجیل میں اتری ہے نہ زبور و قرآن (یعنی باقی قرآن) میں ، وہ سبع مثانی اور قرآن عظیم ہے جو مجھے دیا گیا ہے"
        },
        {
          "reference": "سنن ابو داود 3420",
          "translation": "جناب خارجہ بن صلت نے اپنے چچا ( حضرت علاقہ بن صحار تمیمی رضی اللہ عنہ ) سے روایت کیا کہ وہ ایک قوم کے پاس سے گزرے تو وہ لوگ ان کے پاس آئے اور کہا : تم اس شخص ( رسول اللہ ﷺ ) کے پاس سے خیر ( قرآن اور ذکر اللہ ) لے کر آئے ہو ، چنانچہ ہمارے اس شخص پر دم کر دو ۔ پھر وہ لوگ ان کے پاس ایک مجنون ( دیوانے ) کو لائے جو زنجیروں میں جکڑا ہوا تھا ۔ انہوں نے اسے تین دن تک صبح شام سورہ فاتحہ کا دم کیا ، وہ جب بھی اسے ختم کرتے تو اپنا لعاب جمع کرتے اور اس پر پھونک دیتے ۔ پھر وہ ایسے ہو گیا جیسے کہ بندھن سے کھول دیا گیا ہو ۔ ان لوگوں نے ان کو کچھ دیا تو وہ نبی ﷺ کے پاس آئے اور یہ سب بیان کیا ۔ تو رسول اللہ ﷺ نے فرمایا :’’ کھا لو ، قسم میری عمر کی ! لوگ باطل جھاڑ پھونک سے کھاتے ہیں اور تم نے حق سچ دم سے کھایا ہے ۔‘‘"
        },
        {
          "reference": "صحیح مسلم 878 مشکوٰۃ المصابیح 823",
          "translation": " سفیان بن عیینہ نے علاء بن عبدالرحمن سے خبر دی ، انہوں نے اپنے والد سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی ﷺ سے روایت کی کہ آپ نے فرمایا : جس نے کوئی نماز پڑھی اور اس میں ام القرآن کی قراءت نہ کی تو وہ ناقص ہے ۔‘‘ تین مرتبہ فرمایا ، یعنی پوری ہی نہیں ۔ ابوہریرہ رضی اللہ عنہ سے کہا گیا : ہم امام کے پیچھے ہوتے ہیں ۔ انہوں نے کہا : اس کو اپنے دل میں پڑھ لو کیونکہ میں نے رسول اللہ ﷺ سے سنا ، آپ فرما رہے تھے : اللہ تعالیٰ نے فرمایا : میں نے نماز اپنے اور اپنے بندے کے درمیان آدھی آدھی تقسیم کی ہے اور میرے بندے نے جو مانگا ، اس کا ہے جب بندہ ﴿الحمد لله رب العالمين﴾ سب تعریف اللہ ہی کے لیے جو جہانوں کا رب ہے ۔‘‘ کہتا ہے تو اللہ تعالیٰ فرماتا ہے : میرے بندے نے میری تعریف کی ۔ اور جب وہ کہتا ہے : ﴿الرحمن الرحيم﴾ سب سے زیادہ رحم کرنے والا ہمیشہ مہربانی کرنے والا ۔‘‘ تواللہ تعالیٰ فرماتا ہے : میرے بندے نے میری ثنا بیان کی ۔ پھر جب وہ کہتا ہے : ﴿ مالك يوم الدين﴾ جزا کے دن کا مالک ۔‘‘ تو ( اللہ ) فرماتا ہے : میرے بندے نے میری بزرگی بیان کی ۔ اور ایک دفعہ فرمایا : میرے بندے نے ( اپنے معاملات ) میرے سپرد کر دیے ۔ پھر جب وہ کہتا ہے : ﴿إياك نعبد وإياكنستعين﴾ ہم تیری ہی بندگی کرتے اور تجھ ہی سے مدد چاہتے ہیں ۔‘‘ تو ( اللہ ) فرماتا ہے : یہ ( حصہ ) میرے اور میرے بندے کے درمیان ہے اور میرے بندےنے جو مانگا ، اس کا ہے اور جب وہ کہتا ہے : ﴿إهدنا الصراط المستقيم صراطالذين أنعمت عليهم غير المغضوب عليهم والا الضالين﴾ ہمیں راہ راست دکھا ،ان لوگوں کی راہ جن پر تو نے انعام فرمایا ، نہ غضب کیے گئے لوگوں کی ہواور نہ گمراہوں کی ۔‘‘ تو ( اللہ ) فرماتا ہے : یہ میرے بندے کے لیے ہے اور میرے بندے کا ہے جو اس نے مانگا ۔"
        },
        {
          "reference": "سنن ترمذی 2875 مشکوٰۃ المصابیح 2142",
          "translation": "حضرت ابوہریرہ ؓ بیان کرتےہیں ، رسول اللہ ﷺ نے ابی بن کعب ؓ سے فرمایا :’’ تم نماز میں کیسے قراءت کرتے ہو ؟‘‘ انہوں نے سورۂ فاتحہ پڑھی تو رسول اللہ ﷺ نے فرمایا :’’ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! اس جیسی سورت تورات و انجیل میں اتری ہے نہ زبور و قرآن (یعنی باقی قرآن) میں ، وہ سبع مثانی اور قرآن عظیم ہے جو مجھے دیا گیا ہے"
        },
        {
          "reference": "سورت الاخلاص کی فضیلت"
        },
        {
          "reference": "صحیح مسلم 1886",
          "translation": "آپ ﷺ نے فرمایا :’’ کیا تم میں سے کوئی شخص اتنا بھی نہیں کر سکتا کہ ایک رات میں تہائی قرآن کی تلاوت کر لے ؟‘‘ انھوں ( صحابہ کرام ) نے عرض کی : ( کوئی شخص ) تہائی قرآن کی تلاوت کیسے کر سکتا ہے ؟ آپ ﷺ نے فرمایا : قُلْ هُوَ اللَّهُ أَحَدٌ ایک تہائی قرآن کے برابر ہے ۔‘‘"
        },
        {
          "reference": "مسند احمد 8869",
          "translation": "سیدنا معاذ بن انس جہنی ‌رضی ‌اللہ ‌عنہ سے روایت ہے، نبی کریم ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا: جو شخص {قُلْ ھُوَ اللّٰہُ اَحَدٌ} یعنی سورۂ اخلاص آخر تک دس مرتبہ پڑھے گا، اللہ تعالیٰ اس کے لیے جنت میں ایک محل تعمیر کرے گا۔ سیدنا عمر ‌رضی ‌اللہ ‌عنہ نے کہا: اے اللہ کے رسول! پھر تو میں بہت سے محلات حاصل کر سکتا ہوں۔ آپ ‌صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا: اللہ تعالیٰ بھی بہت کثرت والا اور بہت عمدہ عطا کرنے والا ہے۔"
        },
        {
          "reference": "سنن ابو داود 4722",
          "translation": "حضرت ابوہریرہ رضی اللہ عنہ سے مروی ہے ، وہ کہتے ہیں کہ میں نے رسول اللہ ﷺ کو فرماتے سنا ، کہتے تھے ۔۔۔۔۔ اور مذکورہ بالا کی مانند بیان کیا ۔ کہا :’’ جب وہ لوگ یہ کہیں تو تم کہو : اللہ ایک ہے ۔ اللہ بے نیاز ہے ۔ نہ اس نے جنا اور نہ وہ جنا گیا اور کوئی نہیں جو اس کی برابری کر سکے ۔ پھر چاہیے کہ بائیں جانب کچھ لعاب تھوکے اور شیطان کے شر سے اللہ کی پناہ مانگے ۔‘‘"
        },
        {
          "reference": "سنن ترمذی869",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے طواف کی دو رکعت میں اخلاص کی دونوں سورتیں یعنی قل يا أيها الكافرون اور قل هو الله أحد پڑھیں ۱؎۔"
        }
      ]
    },
    {
      "id": "6",
      "content": [
        {
          "reference": "سنن نسائی 1284",
          "translation": "آپ نے فرمایا :’’ میرے پاس ایک فرشتہ آیا اور اس نے کہا :’’ اے محمد ! تحقیق آپ کا رب تعالیٰ فرماتا ہے : کیا آپ کو یہ بات پسند نہیں کہ جو شخص بھی آپ پر درود پڑھے گا ، میں اس پر دس دفعہ رحمت کروں گا ؟ اور جو بھی آپ پر سلام کہے گا ، میں اس پر دس بار سلام نازل کروں گا ۔‘‘"
        },
        {
          "reference": "سنن ترمذی 3545 ،مشکوٰۃ المصابیح927",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اس شخص کی ناک خاک آلود ہو جس کے پاس میرا ذکر کیا جائے اور وہ شخص مجھ پر درود نہ بھیجے"
        },
        {
          "reference": "سنن نسائی 1293",
          "translation": "حضرت موسیٰ بن طلحہ بیان کرتے ہیں کہ میں نے حضرت زید بن خارجہ رضی اللہ عنہ سے پوچھا ، انھوں نے فرمایا : میں نے رسول اللہ ﷺ سے پوچھا تھا تو آپ نے فرمایا تھا :’’ مجھ پر درود پڑھو اور خوب کوشش سے دعا کرو اور کہو : [اللھم ! صل علی محمد و علی آل محمد] ’’ اے اللہ ! محمد ( ﷺ ) اور آل محمد پر خصوصی رحمتیں نازل فرما ۔‘‘"
        },
        {
          "reference": "مسند احمد9966",
          "translation": "حضرت ابو ہریرہ بیان سے مروی ہے کہ نبی علی نے فرمایا جو لوگ کسی جگہ پر مجلس کر ہیں ، لیکن اس میں اللہ کا ذکر اونبی علیم پر درود نہ کریں، اور جدا ہو جائیں وہ ان کے لئے قیامت کے دن باعث حسرت ہوگی ، اگر چہ وہ جنت میں داخل ہو جائیں۔"
        }
      ]
    },
    {
      "id": "7",
      "content": [
        {
          "reference": "مشکوٰۃ المصابیح 2478 , سنن ترمذی 2572, سنن نسائی 5523 , سنن ابن ماجہ4340",
          "translation": "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے ، رسول اللہ ﷺ نے فرمایا :’’ جو شخص اللہ تعالیٰ سے تین بار جنت مانگتا ہے ، جنت ( اس کے حق میں دعا کرتے ہوئے ) کہتی ہے : یا اللہ ! اسے جنت میں داخل فرما دے ۔ اور جو کوئی تین بار ( جہنم کی ) آگ سے پناہ مانگتا ہے ، جہنم ( اس کے حق میں دعا کرتے ہوئے ) کہتی ہے : یا اللہ ! اسے آگ سے محفوظ فرما ۔‘‘"
        },
        {
          "reference": "سورة الأعراف آیت نمبر 126",
          "arabic": "رَبَّنَاۤ اَفۡرِغۡ عَلَیۡنَا صَبۡرًا وَّ تَوَفَّنَا مُسۡلِمِیۡنَ",
          "translation": "اے ہمارے رب ہمارے اوپر صبر کا فیضان فرما اور ہماری جان حالت اسلام پر نکال ۔"
        },
        {
          "reference": "",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ الفردوس مع النَّبِیّٖنَ وَ الصِّدِّیۡقِیۡنَ وَ الشُّہَدَآءِ وَ الصّٰلِحِیۡنَ",
          "translation": "اے اللہ میں تجھ سے انبیاء اور صادقین اور شہداء اور صالحین کے ساتھ جنت الفردوس کا سوال کرتا ہوں"
        },
        {
          "reference": "سنن ابو داود 1522,سنن نسائی 1304",
          "arabic": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
          "translation": "حضرت معاذ بن جبل رضی اللہ عنہ سے منقول ہے کہ رسول اللہ ﷺ نے ان کا ہاتھ پکڑا اور فرمایا :’’ اے معاذ ! قسم اللہ کی ! مجھے تم سے محبت ہے ۔‘‘ پھر فرمایا :’’ اے معاذ ! میں تمہیں وصیت کرتا ہوں کہ کسی نماز کے بعد یہ دعا ہرگز ترک نہ کرنا : ( اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ ) ’’ اے اللہ ! اپنا ذکر کرنے ، شکر کرنے اور بہترین انداز میں اپنی عبادت کرنے میں میری مدد فرما ۔‘‘"
        },
        {
          "reference": "ایک عظیم دعا",
          "arabic": "اللّهُمَّ اغْفِرْ لَنَا قَبْلَ الْمَوْتِ وَارْحَمْنَا عِنْدَ الْمَوْتِ وَلَا تُعَذِّبْنَا بَعْدَ الْمَوْتِ وَلَا تُحَاسِبْنَا يَوْمَ الْقِيمَةِ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "translation": "اے اللہ ! موت سے پہلے ہماری مغفرت فرما اور موت کے وقت ہم پر رحم فرما اور موت کے بعد میں عذاب نہ دینا اور قیامت کے روز ہمارا حساب نہ لینا۔ بے شک تو ہر چیز پر قدرت رکھتا ہے"
        },
        {
          "reference": "3820سنن ابن ماجہ",
          "arabic": "اللَّهُمَّ اجْعَلْنِي مِنْ الَّذِينَ إِذَا أَحْسَنُوا اسْتَبْشَرُوا وَإِذَا أَسَاءُوا اسْتَغْفَرُوا",
          "translation": "حضرت عائشہ‬ رضی اللہ عنہا سے روایت ہے ، نبی ﷺ فرمایا کرتے تھے :’’ اے اللہ ! مجھے ان لوگوں میں شامل فرما جو جب نیکی کرتے ہیں تو انہیں خوشی ہوتی ہے اور جب گناہ کرتے ہیں تو استغفار کرتے ہیں ۔‘‘"
        },
        {
          "reference": "سورة آل عمران آیت نمبر 193",
          "arabic": "رَبَّنَا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَ کَفِّرۡ عَنَّا سَیِّاٰتِنَا وَ تَوَفَّنَا مَعَ الۡاَبۡرَارِ",
          "translation": "الٰہی! اب تُو ہمارے گُناہ معاف فرما اور ہماری بُرائیاں ہم سے دُور کردے اور ہماری موت نیکوں کے ساتھ کر"
        },
        {
          "reference": "",
          "arabic": "اَلَّلھُمَّ اغْفِرْلِی وَلِوَالِدَیَّ وَلِلْمُوْمِنِیْنَ وَالْمُوْمِنَاتْ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَات",
          "translation": "اے اللہ مجھے اور میرے والدین کو اور مومن مردوں اور عورتوں اور مسلمان مردوں اور عورتوں کو بخش دے"
        },
        {
          "reference": "سورة الحشر آیت نمبر 10",
          "arabic": "رَبَّنَا اغۡفِرۡ لَنَا وَ لِاِخۡوَانِنَا الَّذِیۡنَ سَبَقُوۡنَا بِالۡاِیۡمَانِ وَ لَا تَجۡعَلۡ فِیۡ قُلُوۡبِنَا غِلًّا لِّلَّذِیۡنَ اٰمَنُوۡا رَبَّنَاۤ اِنَّکَ رَءُوۡفٌ رَّحِیۡمٌ",
          "translation": "اے ہمارے پروردگار ہمیں بخش دے اور ہمارے ان بھائیوں کو بھی جو ہم سے پہلے ایمان لاچکے ہیں اور ایمانداروں کی طرف سے ہمارے دل میں کینہ ( اور دشمنی ) نہ ڈال اے ہمارے رب بیشک تو شفقت و مہربانی کرنے والا ہے"
        }
      ]
    },
    {
      "id": "8",
      "content": [
        {
          "reference": "مشکوٰۃ المصابیح 2478 , سنن ترمذی 2572, سنن نسائی 5523 , سنن ابن ماجہ4340",
          "translation": "حضرت انس بن مالک رضی اللہ عنہ سے روایت ہے ، رسول اللہ ﷺ نے فرمایا :’’ جو شخص اللہ تعالیٰ سے تین بار جنت مانگتا ہے ، جنت ( اس کے حق میں دعا کرتے ہوئے ) کہتی ہے : یا اللہ ! اسے جنت میں داخل فرما دے ۔ اور جو کوئی تین بار ( جہنم کی ) آگ سے پناہ مانگتا ہے ، جہنم ( اس کے حق میں دعا کرتے ہوئے ) کہتی ہے : یا اللہ ! اسے آگ سے محفوظ فرما ۔‘‘"
        },
        {
          "reference": "سورہ بقرہ آیت نمبر 201، صحیح بخاری 6389، صحیح مسلم 6840",
          "arabic": "اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً ، وَفِي الْآخِرَةِ حَسَنَةً ، وَقِنَا عَذَابَ النَّارِ",
          "translation": "اے اللہ! ہمیں دنیا میں بھلائی ( حسنة ) عطا کر اور آخرت میں بھلائی عطا کر اور ہمیں دوزخ سے بچا۔"
        },
        {
          "reference": "سورة الفرقان آیت نمبر 65",
          "arabic": "رَبَّنَا اصۡرِفۡ عَنَّا عَذَابَ جَہَنَّمَ ٭ۖ اِنَّ عَذَابَہَا کَانَ غَرَامًا",
          "translation": "اے ہمارے پروردگار! ہم سے دوزخ کا عذاب پرے ہی پرے رکھ ، کیونکہ اس کا عذاب چمٹ جانے والا ہے"
        },
        {
          "reference": "سورة آل عمران آیت نمبر 16",
          "arabic": "رَبَّنَاۤ اِنَّنَاۤ اٰمَنَّا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَ قِنَا عَذَابَ النَّارِ",
          "translation": "اے ہمارے رب !ہم ایمان لا چکے اس لئے ہمارے گناہ معاف فرما اور ہمیں آگ کے عذاب سے بچا ۔"
        },
        {
          "reference": "صحیح بخاری 832، صحیح مسلم 1324،1333",
          "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
          "translation": "رسول اللہ ﷺ نے فرمایا :’’ جب تم میں سے کوئی تشہد پڑھ لے تو چار چیزوں سے اللہ کی پناہ طلب کرے ۔’’ اے اللہ ! میں جہنم کے عذاب سے اور قبر کے عذاب سے اور زندگی اور موت میں آزمائش سے اور مسیح دجال کے فتنے کے شر سے تیری پناہ میں آتا ہوں ۔‘‘"
        },
        {
          "reference": "المُستدرِک حاکِم 6508,مسند احمد 17778",
          "arabic": "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآخِرَةِ",
          "translation": "اے اللہ آپ بہتر کیجیے ہمارا انجام تمام امور میں، اور ہمیں بچادیجیے دنیا اور آخرت کے عذاب کی رسوائی سے۔"
        },
        {
          "reference": "سورة آل عمران آیت نمبر 8",
          "arabic": "رَبَّنَا لَا تُزِغۡ قُلُوۡبَنَا بَعۡدَ اِذۡ ہَدَیۡتَنَا وَ ہَبۡ لَنَا مِنۡ لَّدُنۡکَ رَحۡمَۃً ۚ اِنَّکَ اَنۡتَ الۡوَہَّابُ",
          "translation": "اے ہمارے رب! ہمیں ہدایت دینے کے بعد ہمارے دل ٹیڑھے نہ کر دے اور ہمیں اپنے پاس سے رحمت عطا فرما ، یقیناً تو ہی بہت بڑی عطا دینے والا ہے ۔"
        },
        {
          "reference": "سنن نسائی 1303، صحیح بخاری 834",
          "arabic": "اللهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "translation": "حضرت ابوبکر صدیق رضی اللہ عنہ نے رسول اللہ ﷺ سے گزارش کی کہ مجھے کوئی ایسی دعا سکھا دیجیے جو میں اپنی نماز میں کروں ۔ آپ نے فرمایا :’’ یوں کہا کرو : (اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ )’’ اے اللہ ! میں نے اپنی جان پر بہت زیادہ ظلم کیا ہے اور تیرے سوا کوئی گناہ معاف نہیں کر سکتا ، لہٰذا میرے لیے اپنی طرف سے بخشش فرما اور مجھ پر رحم فرما ۔ بلاشبہ تو ہی بہت زیادہ معاف کرنے والا ، نہایت رحم کرنے والا ہے ۔"
        },
        {
          "reference": "سنن ابوداؤد 5079",
          "arabic": "اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ",
          "translation": "اے اللہ مجھے جہنم سے بچا"
        },
        {
          "reference": "صحیح بخاری 6370,6374",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ",
          "translation": "ان کلمات کے ذریعہ اللہ کی پناہ مانگو جن کے ذریعہ نبی کریم ﷺ پناہ مانگتے تھے ” اے اللہ ! میں تیری پناہ مانگتا ہوں بزدلی سے ، تیری پناہ مانگتا ہوں بخل سے ، تیری پناہ مانگتا ہوں اس سے کہ ناکارہ عمر کو پہنچوں ، تیری پناہ مانگتا ہوں دنیا کی آزمائش سے اور قبر کے عذاب سے ۔"
        }
      ]
    },
    {
      "id": "9",
      "content": [
        {
          "reference": "سنن ترمذی 3235، مشکوٰۃ المصابیح 748",
          "description": "جب محمد صلی اللہ علیہ وسلم نے خواب میں اللہ کو دیکھا اور یہ دعا کی۔",
          "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ فِتْنَةَ قَوْمٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ، أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبَّ عَمَلٍ يُقَرِّبُ إِلَى حُبِّكَ",
          "translation": "اے اللہ! میں تجھ سے بھلے کاموں کے کرنے اور منکرات (ناپسندیدہ کاموں) سے بچنے کی توفیق طلب کرتا ہوں، اور مساکین سے محبت کرنا چاہتا ہوں، اور چاہتا ہوں کہ مجھے معاف کر دے اور مجھ پر رحم فرما، اور جب تو کسی قوم کو آزمائش میں ڈالنا چاہے، تو مجھے تو فتنہ میں ڈالنے سے پہلے موت دیدے، میں تجھ سے اور اس شخص سے جو تجھ سے محبت کرتا ہو، محبت کرنے کی توفیق طلب کرتا ہوں، اور تجھ سے ایسے کام کرنے کی توفیق چاہتا ہوں جو کام تیری محبت کے حصول کا سبب بنے",
          "note": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہ حق ہےاسے پڑھو یاد کرو اور دوسروں کو پڑھاؤ سکھاؤ“۔"
        }
      ]
    },

    {
      "id": "10",
      "content": [
        {
          "reference": "سنن ابن ماجہ 3660",
          "translation": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، نبی ﷺ نے فرمایا :’’ قنطار بارہ ہزار اوقیے کے برابر ہے ۔ ہر اوقیہ زمین و آسمان کے درمیان کی تمام چیزوں سے بہتر ہے ۔‘‘ اور رسول اللہ ﷺ نے فرمایا :’’ جنت میں آدمی کا درجہ بلند کیا جاتا ہے ۔ وہ کہتا ہے : یہ کس وجہ سے ہوا ؟ اسے کہا جاتا ہے : تیری اولاد کے تیرے لیے دعائے مغفرت کرنے کی وجہ سے ۔‘‘"
        },
        {
          "reference": "سورة بنی اسراءیل آیت نمبر 24",
          "arabic": "رَّبِّ ارۡحَمۡہُمَا کَمَا رَبَّیٰنِیۡ صَغِیۡرًا",
          "translation": "اے میرے پروردگار ان پر ویسا ہی رحم کر جیسا انہوں نے میرے بچپن میں میری پرورش کی ہے"
        },
        {
          "reference": "سورة إبراهيم آیت نمبر 41-40",
          "arabic": "رَبِّ اجۡعَلۡنِیۡ مُقِیۡمَ الصَّلٰوۃِ وَ مِنۡ ذُرِّیَّتِیۡ ٭ۖ رَبَّنَا وَ تَقَبَّلۡ دُعَآءِ رَبَّنَا اغۡفِرۡ لِیۡ وَ لِوَالِدَیَّ وَ لِلۡمُؤۡمِنِیۡنَ یَوۡمَ یَقُوۡمُ الۡحِسَابُ",
          "translation": "اے میرے پالنے والے! مجھے نماز کا پابند رکھ اور میری اولاد سے بھی ، اے ہمارے رب میری دعا قبول فرما ۔اے ہمارے پروردگار! مجھے بخش دے اور میرے ماں باپ کو بھی بخش اور دیگر مومنوں کو بھی جس دن حساب ہونے لگے ۔"
        },
        {
          "arabic": "اَلَّلھُمَّ اغْفِرْلِی وَلِوَالِدَیَّ وَلِلْمُوْمِنِیْنَ وَالْمُوْمِنَاتْ وَالْمُسْلِمِیْنَ وَالْمُسْلِمَات",
          "translation": "اے اللہ مجھے اور میرے والدین کو اور مومن مردوں اور عورتوں اور مسلمان مردوں اور عورتوں کو بخش دے"
        }
      ]
    },
    {
      "id": "11",
      "content": [
        {
          "reference": "سورة الأنبياء آیت نمبر 87 سنن ترمذی 3505",
          "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
          "translation": "تیرے سوا کوئی معبود برحق نہیں، تو پاک ہے، میں ہی ظالم ( خطاکار ) ہوں"
        },
        {
          "reference": "سورہ آل عمران آیت نمبر 173، صحیح بخاری 4563",
          "arabic": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
          "translation": "ہمارے لیے اللہ کافی ہے اور وہی بہترین کام بنانے والا ہے"
        },
        {
          "reference": "المُستدرِک حاکِم 1875, سنن ترمذی 3524, مشکوٰۃ المصابیح 2454",
          "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ",
          "translation": "اے زندہ اور ہمیشہ رہنے والے! تیری رحمت کے وسیلے سے تیری مدد چاہتا ہوں"
        },
        {
          "reference": "صحیح بخاری 6345",
          "arabic": "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ وَالْأَرْضِ ، وَرَبُّ الْعَرْشِ الْعَظِيمِ",
          "translation": "نبی کریم صلی اللہ علیہ وسلم پریشانی کے وقت یہ دعا کرتے تھے لا إله إلا الله العظيم الحليم،‏‏‏‏ لا إله إلا الله رب السموات والأرض،‏‏‏‏ رب العرش العظيم ”اللہ کے سوا کوئی معبود نہیں جو بہت عظمت والا ہے اور برد بار ہے، اللہ کے سوا کوئی معبود نہیں جو آسمانوں اور زمین کا رب اور بڑے بھاری عرش کا رب ہے۔“"
        },
        {
          "reference": "سورہ بقرہ کی آخری آیات کی فضیلت"
        },
        {
          "reference": " سورة البقرة آیت نمبر 286-284,صحیح بخاری 4008, صحیح مسلم,431,1877,1878,1880,سنن ترمذی 2882,مشکوٰۃ المصابیح 2145",
          "translation": "حضرت ابن عباس رضی اللہ عنہما سے روایت ہے کہ جبریل علیہ السلام نبی اکرم ﷺ کے پاس بیٹھے ہوئے تھے کہ اچانک انھوں نے اوپر سے ایسی آواز سنی جیسی دروازہ کھلنے کی ہوتی ہے تو انھوں نے اپنا سر اوپر اٹھایا اور کہا : آسمان کا یہ دروازہ آج ہی کھولا گیا ہے ، آج سے پہلے کبھی نہیں کھولا گیا ، اس سے ایک فرشتہ اترا تو انھوں نے کہا : یہ ایک فرشتہ زمین پر اترا ہے ، یہ آج سے پہلے کبھی نہیں اترا ، اس فرشتے نے سلام کیا اور ( آپ ﷺ سے ) کہا : آپ کو دو نور ملنے کی خوش خبری ہو جو آپ سے پہلے کسی نبی کو نہیں دیئے گئے : ( ایک ) فاتحۃ الکتاب ( سورہ فاتحہ ) اور ( دوسری ) سورہ بقرہ کی آخری آیات"
        },
        {
          "reference": "10 سورہ کہف آیت نمبر",
          "arabic": "رَبَّنَاۤ اٰتِنَا مِنۡ لَّدُنۡکَ رَحۡمَۃً وَّ ہَیِّیٔۡ لَنَا مِنۡ اَمۡرِنَا رَشَدًا",
          "translation": "اے ہمارے پروردگار! ہمیں اپنے پاس سے رحمت عطا فرما اور ہمارے کام میں ہمارے لئے راہ یابی کو آسان کر دے"
        },
        {
          "reference": "25-28 سورہ طٰہٰ آیت نمبر",
          "arabic": "رَبِّ ٱشْرَحْ لِى صَدْرِى وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
          "translation": "اے میرے رب! میرا سینہ میرے لئے کھول دے اور میرے کام کو مجھ پر آسان کر دے اور میری زبان کی گرہ بھی کھول دے تاکہ لوگ میری اچھی طرح بات سمجھ سکیں"
        },
        {
          "reference": "صحیح بخاری 5425",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
          "translation": "اے اللہ ! میں تیری پناہ مانگتا ہوں غم سے ، رنج سے ، عجز سے ، سستی سے ، بخل سے ، بزدلی سے ، قرض کے بوجھ سے اور لوگوں کے غلبہ سے"
        },
        {
          "reference": "غم کی خبر کو خوشی میں بدلنے کی دعا"
        },
        {
          "reference": "صحیح مسلم 2126، مشکوٰۃ المصابیح 1618",
          "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
          "translation": "حضرت ام سلمہ رضی اللہ عنہا سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا :’’ کوئی مسلمان نہیں جسے مصیبت پہنچے اور وہ ( وہی کچھ ) کہے جس کا اللہ نے اسے حکم دیا ہے :’’ یقیناً ہم اللہ کے ہیں اور اسی کی طرف لوٹنے والے ہیں ، اے اللہ ! مجھے میری مصیبت پر اجر دے اور مجھے ( اس کا ) اس سے بہتر بدل عطا فرما ‘‘ مگر اللہ تعالیٰ اسے اس ( ضائع شدہ چیز ) کا بہتر بدل عطا فرما دیتا ہے ۔‘‘"
        },
        {
          "reference": "سنن ابن ماجہ 1385, سنن ترمذی 3578, مشکوٰۃ المصابیح 2495",
          "arabic": "( اللَّهُمَّ إِنِّى أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ نَبِىِّ الرَّحْمَةِ يَا مُحَمَّدُ إِنِّى قَدْ تَوَجَّهْتُ بِكَ إِلَى رَبِّى فِى حَاجَتِى هَذِهِ لِتُقْضَى اللَّهُمَّ فَشَفِّعْهُ فِىَّ )",
          "translation": "حضرت عثمان بن حنیف رضی اللہ عنہ سے روایت ہے کہ ایک نابینا آدمی نبی ﷺ کی خدمت میں حاضر ہوا اور عرض کیا : میرے لیے دعا کیجیے کہ اللہ مجھے شفا دےنبی ﷺ نے فرمایا :’’ اگر تو چاہے تو میں تیرے لیے آخرت کی بھلائی چاہوں اوروہ تیرے لیے بہتر ہے اور اگر تو چاہے تو میں دعا کر دوں ۔‘‘ اس نے کہا :دعا ہی کر دیجیے ۔ نبی ﷺ نے اسے حکم دیا کہ وہ خوب اچھی طرح وضو کر کے دو رکعتیں پڑھے ، پھر یہ دعا مانگے : ( اللَّهُمَّ إِنِّى أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِمُحَمَّدٍ نَبِىِّ الرَّحْمَةِ يَا مُحَمَّدُ إِنِّى قَدْ تَوَجَّهْتُ بِكَ إِلَى رَبِّى فِى حَاجَتِى هَذِهِ لِتُقْضَىاللَّهُمَّ فَشَفِّعْهُ فِىَّ ) ’’ اے اللہ ! میں تجھ سے سوال کرتا ہوں اور نبی رحمت حضرت محمد ﷺ کے ذریعے سے تیری طرف توجہ کرتا ہوں ۔ اے محمد ! میں آپ کے ذریعے سے اپنی اس حاجت کے سلسلے میں اپنے رب کی طرف توجہ کرتا ہوںتاکہ وہ حاجت پوری ہو جائے ۔ اے اللہ ! نبی ﷺ کی شفاعت میرے حق میں قبول فرما ۔‘‘ ابواسحاق نے کہا : یہ حدیث صحیح ہے "
        }
      ]
    },
    {
      "id": "12",
      "content": [
        {
          "reference": "سنن ترمذی 3489، سنن ابن ماجہ 3832",
          "arabic": "اللَّهُمَّ إِنِّيأَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
          "translation": "اے اللہ! میں تجھ سے ہدایت کا طالب ہوں، تقویٰ کا طلب گار ہوں، پاکدامنی کا خواہشمند ہوں، مالداری اور بے نیازی چاہتا ہوں"
        },
        {
          "reference": "سنن ابن ماجہ 925",
          "arabic": "(اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً)",
          "translation": "اے اللہ! میں تجھ سے فائدہ دینے والے علم ، پاک رزق اور قبول ہونے والے عمل کا سوال کرتا ہوں"
        },
        {
          "reference": "سنن ترمذی 3563 مشکوٰۃ المصابیح 2449",
          "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، ‏‏‏‏‏‏وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
          "translation": "اے اللہ! تو ہمیں حلال دے کر حرام سے کفایت کر دے، اور اپنے فضل ( رزق، مال و دولت ) سے نواز کر اپنے سوا کسی اور سے مانگنے سے بے نیاز کر دے"
        },
        {
          "reference": "سورة المائدة آیت نمبر 114",
          "arabic": "اللّٰہُمَّ رَبَّنَاۤ اَنۡزِلۡ عَلَيۡنَا مَآئِدَۃً مِّنَ السَّمَآءِ تَكُوۡنُ لَنَا عِیۡدًا لِّاَوَّلِنَا وَ اٰخِرِنَا وَ اٰیَۃً مِّنۡكَ ۚ وَ ارۡزُقۡنَا وَ اَنۡتَ خَیۡرُ الرّٰزِقِیۡنَ",
          "translation": "اے اللہ اے ہمارے پروردگار! ہم پر آسمان سے کھانا نازل فرما !کہ وہ ہمارے لئے یعنی ہم میں جو اول ہیں اور جو بعد کے ہیں سب کے لئے ایک خوشی کی بات ہو جائے اور تیری طرف سے ایک نشانی ہو جائے اور تو ہم کو رزق عطا فرما دے اور تو سب عطا کرنے والوں سے اچھا ہے"
        }
      ]
    },
    {
      "id": "13",
      "content": [
        {
          "reference": "سنن ابن ماجہ 925",
          "arabic": "(اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً)",
          "translation": "اے اللہ! میں تجھ سے فائدہ دینے والے علم ، پاک رزق اور قبول ہونے والے عمل کا سوال کرتا ہوں"
        },
        {
          "reference": "سورہ طٰہٰ آیت نمبر 114",
          "arabic": "رَّبِّ زِدۡنِیۡ عِلۡمًا",
          "translation": "پروردگار میرا علم بڑھا"
        }
      ]
    },
    {
      "id": "14",
      "content": [
        {
          "reference": "صحیح مسلم 2257",
          "arabic": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ لَلَاحِقُونَ أَسْأَلُ اللَّهَ لَنَا وَلَكُمْ الْعَافِيَةَ",
          "translation": "مومنوں اور مسلمانوں کے ٹھکانوں کے لوگوں پر سلامتی ہو، اور زہیر کی روایت میں ہے: مومنوں اور مسلمانوں کے ٹھکانوں کے لوگوں پر ۔۔۔ اور ان شاء اللہ ہم ضرور ملیں گے، میں اللہ سے تمام کے لیے عافیت مانگتا ہوں۔"
        }
      ]
    },
    {
      "id": "15",
      "content": [
        {
          "reference": "سنن ترمذی 3426",
          "arabic": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
          "translation": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص گھر سے نکلتے وقت: بسم الله توكلت على الله لا حول ولا قوة إلا بالله “میں نے اللہ کے نام سے شروع کیا، میں نے اللہ پر بھروسہ کیا اور گناہوں سے بچنے اور کسی نیکی کے بجا لانے کی قدرت و قوت نہیں ہے سوائے سہارے اللہ کے“ کہے، اس سے کہا جائے گا: تمہاری کفایت کر دی گئی، اور تم ( دشمن کے شر سے ) بچا لیے گئے، اور شیطان تم سے دور ہو گیا"
        },
        {
          "reference": "سورہ الزخرف آیت 13-14",
          "arabic": "سُبۡحٰنَ الَّذِیۡ سَخَّرَ لَنَا ہٰذَا وَ مَا کُنَّا لَہٗ مُقۡرِنِیۡنَ وَ اِنَّاۤ اِلٰی رَبِّنَا لَمُنۡقَلِبُوۡنَ",
          "translation": "کہو پاک ذات ہے اس کی جس نے اسےہمارے بس میں کر دیا حالانکہ ہمیں اسے قابو کرنے کی طاقت نہ تھی ۔اور بالیقین ہم اپنے رب کی طرف لوٹ کر جانے والے ہیں ۔"
        }
      ]
    },
    {
      "id": "16",
      "content": [
        {
          "reference": "سنن ابو داود 3201",
          "arabic": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا، وَشَاهِدِنَا وَغَائِبِنَا، وَصَغِيرِنَا وَكَبِيرِنَا، وَذَكَرِنَا وَأُنْثَانَا اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلَامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِيمَانِ",
          "translation": "اے اللہ! بخش دے ہمارے زندوں کو، ہمارے مردوں کو، ہمارے حاضر کو اور ہمارے غائب کو، ہمارے چھوٹے کو اور ہمارے بڑے کو، ہمارے مردوں کو اور ہماری عورتوں کو اے اللہ! ہم میں سے جسے تو زندہ رکھ، اسے اسلام پر زندہ رکھ اور جسے موت دے اسے ایمان پر موت دے۔"
        },
        {
          "reference": "صحیح مسلم 2232,2234, سنن نسائی 62,1985,1986, سنن ترمذی 1025, سنن ابن ماجہ 1500",
          "arabic": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأَدْخِلْهُ الْجَنَّةَ وَأَعِذْهُ مِنْ عَذَابِ الْقَبْرِ أَوْ مِنْ عَذَابِ النَّارِ",
          "translation": "اے اللہ! اسے بخش دے اور اس پر رحم فرما اور اسے عافیت دے ، اسے معاف فرما اور اس کی باعزت ضیافت فرما اور اس کے داخل ہونے کی جگہ ( قبر ) کو وسیع فرما اور اس ( کے گناہوں ) کو پانی ، برف اور اولوں سے دھو دے ، اسے گناہوں سے اس طرح صاف کر دے جس طرح تو نے سفید کپڑے کو میل کچیل سے صاف کیا اور اسے اس گھر کے بدلے میں بہتر گھر ، اس کے گھر والوں کے بدلے میں بہتر گھر والے اور اس کی بیوی کے بدلے میں بہتر بیوی عطا فرما اور اس کو جنت میں داخل فرما اور قبر کے عذاب سے اور آگ کے عذاب سے اپنی پناہ عطا فرما"
        },
        {
          "reference": "سنن ابوداؤد 3202, سنن ابن ماجہ 1499",
          "arabic": "اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِى ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ فَاغْفِرْ",
          "translation": "اے اللہ! فلاں کا بیٹا فلاں تیرے سپرد اور تیری حفاظت میں ہے ، اسے قبر کی آزمائش اور آگ کے عذاب سے محفوظ رکھنا تو وفا اور حق والا ہے، اس کی بخشش فرما دے۔",
          "note": "نوٹ : یہاں فُلاَنَ بْنَ فُلاَنٍ کی جگہ نام لے گے"
        },
        {
          "reference": "صحیح مسلم 2130, سنن ابوداؤد 3118, سنن ابن ماجہ 1454",
          "arabic": "اللَّهُمَّ اغْفِرْ لِأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ وَافْسَحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ",
          "translation": "اے اللہ! ابوسلمہ کی مغفرت فرما، ہدایت یافتہ لوگوں میں اس کے درجات بلند فرما اور اس کے پیچھے رہ جانے والوں میں تو اس کا جانشین بن اور اے جہانوں کے پالنے والے! ہمیں اور اس کو بخش دے، اس کے لیے اس کی قبر میں کشادگی پیدا فرما اور اس کے لیے اس قبر میں روشنی کر دے۔",
          "note": "نوٹ : ابو سلمہ کی جگہ کسی کا بی نام لے سکتے ہیں"
        },
        {
          "reference": "صحیح بخاری 2884,6383,4323, صحیح مسلم 6406",
          "arabic": "اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ",
          "translation": "اے اللہ! عبید ابوعامر (رضی اللہ عنہ) کی مغفرت فرما اے اللہ! قیامت کے دن ابوعامر کو اپنی بہت سی مخلوق سے بلند تر درجہ عطا فرمائیو۔",
          "note": "نوٹ : ابو عامر کی جگہ کسی کا بی نام لے سکتے ہیں"
        },
        {
          "reference": "المُستدرِک حاکِم 1328",
          "arabic": "اللَّهُمَّ عَبْدُكَ، وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ إِنْ كَانَ مُحْسِنًا فَزِدْ فِي إِحْسَانِهِ، وَإِنْ كَانَ مُسِيئًا فَتَجَاوَزَ عَنْهُ",
          "translation": "اے اللہ! یہ تیرا بندہ ہے اور تیری بندی کا بیٹا ہے۔ (یا اللہ) یہ تیری رحمت کا محتاج ہے اور تو اس کے عذاب سے بے نیاز ہے، اگر یہ نیک ہے تو اس کی نیکیوں میں اضافہ فرما اور اگر یہ گنہگار ہے تو اس کو معاف فرما۔"
        }
      ]
    },
    {
      "id": "17",
      "content": [
        {
          "reference": "سنن ترمذی 3388, سنن ابو داود 5088",
          "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
          "translation": "میں اس اللہ کے نام کے ذریعہ سے پناہ مانگتا ہوں جس کے نام کی برکت سے زمین و آسمان کی کوئی چیز نقصان نہیں پہنچا سکتی، اور وہ سننے والا جاننے والا ہے"
        },
        {
          "reference": "صحیح مسلم 6880",
          "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
          "translation": "میں ہر اس چیز کے شر سے جسے اللہ نے پیدا کیا"
        },
        {
          "reference": "سنن نسائی 5533",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ التَّرَدِّي وَالْهَدْمِ وَالْغَرَقِ وَالْحَرِيقِ وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا",
          "translation": "اے اللہ ! میں تیری پناہ میں آتا ہوں اس بات سے کہ کسی اونچی جگہ سے گر جاؤں یا کوئی عمارت مجھ پر گر جائے یا غرق ہو جاؤں یا آگ میں جل مروں ۔ اور اس بات سے بھی تیری پناہ میں آتا ہوں کہ مجھے مرتے وقت شیطان بدحواس کر دے ۔ اور میں اس بات سے بھی تیری پناہ میں آتا ہوں کہ تیرے راستے میں ( دوران جہاد میں ) میدان جنگ سے پیٹھ پھیر کر بھاگتا ہوا مارا جاؤں ۔ اور اس بات سے بھی تیری پناہ میں آتا ہوں کہ کسی زہریلی چیز کے ڈسنے سے مر جاؤں"
        },
        {
          "reference": "صحیح مسلم 6944",
          "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ",
          "translation": "میں تیری پناہ چاہتا ہوں تیری نعمت کے زوال سے ، تیری عافیت کے ہٹ جانے سے ، تیری ناگہانی سزا سے اور تیری ہر طرح کی ناراضی سے"
        }
      ]
    },
    {
      "id": "18",
      "content": [
        {
          "reference": "صحیح بخاری 614",
          "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ ، حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ",
          "translation": "یا اللہ! اس کامل اعلان اور قائم ہونے والی نماز کے مالک، محمد کو مقامِ وسیلہ عطا فرما اور ان کی فضیلت میں اضافہ فرما اور ان کو مقامِ محمود پر پہنچا جس کا تو نے ان سے وعدہ کیا ہے"
        }
      ]
    }
  ],

  "QuranwithTran": [
    {
      "id": "1",
      "link": "http://bit.ly/2qpLHGY",
      "text": "پارہ 1",
      "button": "Read more"
    },
    {
      "id": "2",
      "link": "http://bit.ly/2qnS2Ha",
      "text": "پارہ 2",
      "button": "Read more"
    },
    {
      "id": "3",
      "link": "http://bit.ly/2sbSqoq",
      "text": "پارہ 3",
      "button": "Read more"
    },
    {
      "id": "4",
      "link": "http://bit.ly/2r6TOeq",
      "text": "پارہ 4",
      "button": "Read more"
    },
    {
      "id": "5",
      "link": "http://bit.ly/2qzzsYk",
      "text": "پارہ 5",
      "button": "Read more"
    },
    {
      "id": "6",
      "link": "http://bit.ly/2qI4EE2",
      "text": "پارہ 6",
      "button": "Read more"
    },
    {
      "id": "7",
      "link": "http://bit.ly/2rW88HS",
      "text": "پارہ 7",
      "button": "Read more"
    },
    {
      "id": "8",
      "link": "http://bit.ly/2qK0aO4",
      "text": "پارہ 8",
      "button": "Read more"
    },
    {
      "id": "9",
      "link": "http://bit.ly/2rBqzB0",
      "text": "پارہ 9",
      "button": "Read more"
    },
    {
      "id": "10",
      "link": "http://bit.ly/2s3dkdd",
      "text": "پارہ 10",
      "button": "Read more"
    },
    {
      "id": "11",
      "link": "http://bit.ly/2so5po5",
      "text": "پارہ 11",
      "button": "Read more"
    },
    {
      "id": "12",
      "link": "http://bit.ly/2rzgVP9",
      "text": "پارہ 12",
      "button": "Read more"
    },
    {
      "id": "13",
      "link": "http://bit.ly/2rSIJ1l",
      "text": "پارہ 13",
      "button": "Read more"
    },
    {
      "id": "14",
      "link": "http://bit.ly/2sk5Lid",
      "text": "پارہ 14",
      "button": "Read more"
    },
    {
      "id": "15",
      "link": "http://bit.ly/2rKJHw3",
      "text": "پارہ 15",
      "button": "Read more"
    },
    {
      "id": "16",
      "link": "http://bit.ly/2sMTr7y",
      "text": "پارہ 16",
      "button": "Read more"
    },
    {
      "id": "17",
      "link": "http://bit.ly/2r9opp2",
      "text": "پارہ 17",
      "button": "Read more"
    },
    {
      "id": "18",
      "link": "http://bit.ly/2rpK4c8",
      "text": "پارہ 18",
      "button": "Read more"
    },
    {
      "id": "19",
      "link": "http://bit.ly/2rpq1iW",
      "text": "پارہ 19",
      "button": "Read more"
    },
    {
      "id": "20",
      "link": "http://bit.ly/2rAX4Mc",
      "text": "پارہ 20",
      "button": "Read more"
    },
    {
      "id": "21",
      "link": "http://bit.ly/2rBv2Aa",
      "text": "پارہ 21",
      "button": "Read more"
    },
    {
      "id": "22",
      "link": "http://bit.ly/2sbmkft",
      "text": "پارہ 22",
      "button": "Read more"
    },
    {
      "id": 23,
      "link": "http://bit.ly/2rtPXpH",
      "text": "پارہ 23",
      "button": "Read more"
    },
    {
      "id": 24,
      "link": "http://bit.ly/2sfUCOE",
      "text": "پارہ 24",
      "button": "Read more"
    },
    {
      "id": 25,
      "link": "http://bit.ly/2smfZxF",
      "text": "پارہ 25",
      "button": "Read more"
    },
    {
      "id": 26,
      "link": "http://bit.ly/2tLUEvC",
      "text": "پارہ 26",
      "button": "Read more"
    },
    {
      "id": 27,
      "link": "http://bit.ly/2tru5wz",
      "text": "پارہ 27",
      "button": "Read more"
    },
    {
      "id": 28,
      "link": "http://bit.ly/2rXeW98",
      "text": "پارہ 28",
      "button": "Read more"
    },
    {
      "id": 29,
      "link": "http://bit.ly/2s5NLEk",
      "text": "پارہ 29",
      "button": "Read more"
    },
    {
      "id": 30,
      "link": "http://bit.ly/2s1BBB4",
      "text": "پارہ 30",
      "button": "Read more"
    }
  ],

  "navbar": {
    "navHeading": "اللہ کی  یاد  ہی سے دلوں کو سُکون ملتا ہے",
    "quran": "قرآن کا ترجمہ ",
    "dua": "دعا کی اہمیت",
    "namaz": "نماز کی اہمیت",
    "wealth": "مال ایک فتنہ"
  },

  "drawerHeadings": [
    {
      "id": "translationQuran",
      "title": "قرآن کا ترجمہ "
    },
    {
      "id": "dua",
      "title": "دعا"
    },
    {
      "id": "namaz",
      "title": "نماز"
    },

    {
      "id": "wealth",
      "title": "مال"
    }
  ]
}
